[
  {
    "title": "Inchcailloch island",
    "summary": "Inchcailloch may not be the largest, but it is the most accessible and probably the most beautiful, of Loch Lomond's islands. Part of a National Nature Reserve, the island has wonderful woodlands and offers fabulous views out across the loch.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/inchcailloch.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.5,
    "ascent_m": 94,
    "start_grid_ref": "NS413906",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Inchcailloch is a stunning wooded island on Loch Lomond, just a short distance off-shore from Balmaha. Balmaha boat-yard operate a ferry service to the island on-demand, available throughout the year, weather permitting. The walk begins from the north pier, where most boats land. Head up the short flight on steps to begin your exploration of the island. The path heads to the right through the woods, soon turning inland. An information board with a map of the island is soon reached; the largest path continues ahead, but to make an ascent to the highest point of the island, turn left here onto a slightly rougher path."
      },
      {
        "stage": 2,
        "description": "The path crosses a wooden boardwalk across a wet area; alder trees thrive in these damp conditions. Once nearer to the south side of the island the path begins to ascend, with some steps, making a wide zig-zag. The rocks above the path are puddingstone - a conglomerate that gets its name from its resemblance to fruit pudding. At the top of the climb a bench looks out to the flat and wide southern stretches of the loch."
      },
      {
        "stage": 3,
        "description": "The path now swings left to another bench, this time on the summit of the island, and looking north. The panorama is truly stunning, with the first hills and mountains of the Highlands arranged around the head of the loch. Ben Lomond rises particularly proudly as the centrepiece of the scene. After enjoying this, continue along the path, with a brief view along several other islands all in a perfect line - like Inchcailloch, these islands are all on the Highland Boundary Fault that separates Highlands and Lowlands."
      },
      {
        "stage": 4,
        "description": "The path descends to reach a junction with the main path once more; unless you need to hurry back to the boat, turn left through the woods, which are spectacularly decorated with a carpet of bluebells in May. The path leads to Port Bawn, a picnic area at the western edge of the island, with a pebbly beach and its own jetty."
      },
      {
        "stage": 5,
        "description": "Turn right from the picnic area to follow a wooden walkway, passing the island's public toilets and then bearing right before the walkway reaches the jetty to head onto the 'Low path' that heads northeast fairly close to the coast. The path heads very pleasantly through the woods, soon reaching a low ruin. This is a reminder that until the end of the 18th century the island was farmed, with its residents growing oats and barley. As landowners switched their holdings from tenants to sheep, the owner of Inchcailloch was asked to plant trees and the era of farming the island was at an end."
      },
      {
        "stage": 6,
        "description": "The path now heads to the right across wooden duckboards and then ascends a slope to reach a  junction. The walk continues by heading sharply right here, but first, detour ahead to visit the ancient graveyard. According to legend Saint Kentigerna, an Irish princess and the mother of St Fillan, set up a nunnery here 1,300 years ago. Although the modern meaning of Inchcailloch is the island of the old woman, an old meaning of cailloch is a cowled woman - a nun. Centuries later a church was built here and dedicated to her but it fell into ruin when farming ended, though the cemetery continued to be used. Return to the path junction and turn left at the junctions to head back to the jetty - hopefully in time for your boat."
      }
    ],
    "scraped_at": 1756310972.973915
  },
  {
    "title": "Ardess History Trail",
    "summary": "The National Trust for Scotland own this part of Loch Lomond and have established a short history trail to explore the archaeology found beneath the heather, bracken and oak trees and to use it to explain how this part of the countryside used to be lived and worked in. An easy circular walk with good views.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/ardess.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 175,
    "start_grid_ref": "NS359986",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the car park at Rowardennan where there is an information centre and toilets. Follow the shoreside path as it heads north away from the car park and jetty. It soon passes the circular sculpture in tribute to those who have fought for Britain's armed forces and to whom the area is dedicated. Turn left when the main track is reached and keep right where the entrance to the Youth Hostel turns off. At the next fork keep left. Soon the driveway to Ardess Ranger Centre is reached. Turn right up the drive and pass to the left of the building. There is a leaflet which can picked up from the wooden box here. After the building head right and pass through a gate and then climb gently uphill bearing right. From here the stone built kennels can be seen below - these were built when the Youth Hostel was a 19th century hunting lodge."
      },
      {
        "stage": 2,
        "description": "At a bend in the track turn right through a gate and follow the path through the oak woods, crossing a stream. The original woodland was planted in the 18th century to produce wood for charcoal and fuel and also bark which was used for tanning leather. The area is now fenced from grazing sheep and deer and other native species such as holly, rowan and hazel have been regenerating. Pass through another gate and when a track is reached turn right. After another gate follow the track until an area of ridged ground can be seen on the other side of the fence. This is the remains of the ridge and furrow method of farming, where soil was mounded up with other nutrients to grow crops and the furrows provided drainage. Each family would be allotted a certain number of different ridges to farm each year to ensure everyone had a fair chance of getting good ground."
      },
      {
        "stage": 3,
        "description": "Soon afterwards bear left uphill heading for a tree and a seat. Follow the old remains of the stone dyke which would have been used to keep livestock and cultivation areas separate. Head across the open ground passing the remains of sheilings, or summer homes where cheese and butter would have been made in the summer months before the family moved back to their permanent homes lower down. Bear left at the remains to head downhill following the red marker arrows. The route soon goes through a gate to re-enter the wood."
      },
      {
        "stage": 4,
        "description": "Follow the path as it meanders through the wood, passing the ruins of a house before crossing another area of more open ground. Just before the next gate the remains of a turf house can be seen on the left. Little is known about the use of this type of building, constructed using only turf and no stones. Pass through the gate."
      },
      {
        "stage": 5,
        "description": "Cross a bridge over the Ardess Burn and very soon head to the right to look at the remains of two stone houses. Go through the wooden gate and follow the path past the remains of a long house, probably one used by a family at one end and their animals at the other. The path soon emerges onto the Ptarmigan path which is used as a way up or down Ben Lomond. Turn left onto this path and follow it downhill. Soon it comes close to the burn and there is a good viewpoint for a waterfall. When the path reaches the main track turn left and follow the track all the way back to the information building and the car park at the start of the walk."
      }
    ],
    "scraped_at": 1756310975.5654857
  },
  {
    "title": "Strathyre circuit",
    "summary": "This circular walk around Strathyre and the nearby hillside combines a section of the Rob Roy Way with a waymarked forestry walk. Part way up the hillside it crosses the Tighanes Burn and higher up there are good views. A good walk for spotting wildlife, especially deer and red squirrels and forest birds.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/strathyre.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 140,
    "start_grid_ref": "NN560168",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the forestry car park at the south end of Strathyre, beyond the Broch cafe. This route combines parts of the Rob Roy Way and the waymarked route. Start by climbing up the ramp from the car park onto the pathway. Turn right and cross a small bridge before passing along the back of a row of houses. After the small play park turn right at the road junction and walk to the main road opposite the former hotel. Cross the main road and go straight ahead to a metal gateway. Go through this and bear right to climb up behind the metal railings, passing behind the converted church to reach the memorial cairn for local victims of the world wars."
      },
      {
        "stage": 2,
        "description": "From the cairn continue along the path which bears left and leads down to the corner of the tennis court in the recreation ground. Turn right here, following the Rob Roy Way to pass a covered shelter and cross a wooden bridge. Follow the meandering path through the woods until a fork. Keep right here passing a picnic table before heading up through the trees and over another bridge. Beyond this the path climbs up through the pinewoods. This is a good area to look out for red squirrels."
      },
      {
        "stage": 3,
        "description": "Keep following the path which climbs gently. Looking across the valley, the small crag of An Sìdhean is visible - this south summit of Beinn an t-Sìdhean is a popular walk with good views of the nearby lochs and mountains. When the path emerges onto a forest track turn right and follow the track. In this area it is common to see deer, particularly in the early morning. Birds of prey can sometimes be seen overhead and jays can be heard shrieking as they move through the trees."
      },
      {
        "stage": 4,
        "description": "At a junction turn left to follow the yellow marker posts uphill through an area of forestry. When the track levels off, a sign is reached for the Coille MacCaskill path, named after Don MacCaskill who worked as a forester for 40 years and was a keen naturalist and introduced many changes to forestry to manage woodlands in a more environmentally sustainable way. You could extend the walk here by continuing up the track before turning right to cross the Tighanes Burn and follow a path back down the far side. Otherwise, turn right down the MacCaskill path which meanders through the open forest near to the Tighanes Burn on the left."
      },
      {
        "stage": 5,
        "description": "Just before the path reaches a track you can detour to the left to visit the standing stones erected by Don MacCaskill's family and friends as a memorial to him. The cup marked stone is similar to those found at Dalriada in Argyll, the area where Don MacCaskill grew up. At the track turn left."
      },
      {
        "stage": 6,
        "description": "Cross the Tighanes Burn on a bridge and take the path to the right immediately after. The path follows the burn through the trees until it bears left. Just before a building is reached, and within sight of the main road, turn right down a marked path to join a track where you turn right for a short while before reaching the main road. Cross the road and follow the driveway on the opposite side back to car park. Here there is a reconstructed cross-section of an iron-age broch, a fortified house which would have sheltered people and livestock when under threat from raiders."
      }
    ],
    "scraped_at": 1756310978.1575181
  },
  {
    "title": "Ardmore Point, near Helensburgh",
    "summary": "A short, easy walk around a small peninsula in the Firth of Clyde. Excellent views with seal and bird watching opportunities.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/ardmore-point.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.25,
    "estimated_hours": 45.0,
    "ascent_m": 2,
    "start_grid_ref": "NS324786",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Ardmore Point is reached by turning off the A814 south east of Helensburgh at Lyleston Cottage and following the minor road over the level crossing to a small parking area at the shore. From here there is a fabulous view across the Clyde estuary with many wading birds here at low tide. Start the walk by heading towards the cottage and very soon turning right onto a grassy path between fenced fields."
      },
      {
        "stage": 2,
        "description": "At the shore turn left to follow the path around the edge of the headland. From here the view is directly across to Helensburgh with the old stone fish trap visible across the small bay at low tide. Further away there are views of the Arrochar Alps and the mountains on the east side of Loch Lomond in the distance."
      },
      {
        "stage": 3,
        "description": "The path keeps near the shore with gorse bushes and muddy conditions sometimes making the path hard going. In spring and summer the combination of bright yellow gorse flowers, red sandstone and bluebells make a colourful display. As the headland is rounded there are views across the Clyde to Greenock."
      },
      {
        "stage": 4,
        "description": "Grey seals can often be seen basking on rocks just off the shore on this section. These rocks were formed 375 million years ago when the area was an arid desert. Since then the rocks have folded and been eroded leaving rocks from different eras exposed in stripes on the foreshore. The hillock behind in the centre of the peninsula is actually a cliff from when the sea level was much higher so the area you are walking on is an ancient raised beach."
      },
      {
        "stage": 5,
        "description": "The white castellated front of Ardmore House can be seen up on the left as the path continues along a short section of sea wall passing the lodge house to return to the start. The area of mudflats is known for oystercatchers, curlews, sandpipers, redshank and other waders and seabirds."
      }
    ],
    "scraped_at": 1756310980.7524505
  },
  {
    "title": "Glasdrum Wood, Loch Creran",
    "summary": "A short, but steep, walk up through part of the Glasdrum Wood National Nature Reserve, renowned for its rich variety of plants, birds and butterflies. The walk has good views over the head of Loch Creran.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/glasdrum.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.0,
    "estimated_hours": 1.0,
    "ascent_m": 113,
    "start_grid_ref": "NN011451",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The marked trail starts at the left side of the car park and is marked with an information board. Scottish Natural Heritage, which manages the site, have provided leaflets on the trail which are often available from the wooden box. There is also a picnic table and a superb view across Loch Creran to the great Munro of Beinn Sgulaird. The path climbs gently to begin with, and soon reaches a fork. Take the left hand path."
      },
      {
        "stage": 2,
        "description": "The marker post signs this cleared area, under powerlines, as a natural powerpoint. This relates to the fact that the butterflies and other insects that thrive in this wildwood can use the cleared area to store up solar energy, warming themselves to prepare for flight. Glasdrum is one of the few places in Britain which is home to the rare chequered skipper butterfly. The trail continues to climb through the mixed woodland, where evidence of coppicing can be seen. The path crosses a wooden bridge and comes to a fork where a short detour is marked, 'Getting a Glasdrum tan'. The detour path takes you uphill to the spot where charcoal burners, two centuries or more ago, used to light slow burning fires covered with earth to create charcoal. Return to the main path and turn left uphill continuing on the trail."
      },
      {
        "stage": 3,
        "description": "The path passes through the woodland with views over the surrounding countryside and crosses a second bridge. A little further along the path levels off and a bench is reached. The path now starts to head downhill and soon reaches a bench with a good view over the head of Loch Creran."
      },
      {
        "stage": 4,
        "description": "A marker posts says, Looking to Europe. This refers to the marine worms called serpulids that live in the waters of Loch Creran. These amazing creatures form hard tubes around their bodies and in Loch Creran these have formed colonies making a reef that in turn supports a huge number of other species. This has lead Loch Creran to be designated as a Special Conservation Area by the European Union."
      },
      {
        "stage": 5,
        "description": "Continue steeply downhill. The path crosses more open ground and then runs alongside a small stream. There are good views across to Druimavuic House across the valley. The trail crosses another bridge before rejoining the outward path at the 'natural powerpoint' marker post. Turn left here and head downhill to reach the car park."
      }
    ],
    "scraped_at": 1756310983.3377295
  },
  {
    "title": "Moine Mhòr and Dunadd",
    "summary": "This is really two separate very short walks on the edge of the Moine Mhor, the Great Moss - one of Britain's finest boglands and a National Nature Reserve. The second part of the walk ascends the miniature hill of Dunadd, a remarkable historic site that is tied in with the very beginnings of the Kingdom of Scotland.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/moine-mhor.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.2,
    "estimated_hours": 45.0,
    "ascent_m": 58,
    "start_grid_ref": "NR824958",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The first of these two short walks is the Moine Mhòr Tileworks Trail, a short all-abilities path on the edge of this great National Nature Reserve. The parking is signed on the B8025. The trail is best done clockwise; a local tileworks used to take clay from the bog to make tiles and bricks, hence the name. The trail begins by heading through the woodland of birch, alder, sycamore and oak, heavily draped with lichen - a sign of clean air."
      },
      {
        "stage": 2,
        "description": "The path soon emerges on the edge of the great bog itself, with a seat by the path. The Moine Mhòr has become deeper over its 5000 year development as the decaying plant material builds up; from some viewpoints the gentle dome-shape can be well seen as the centre of the bog slowly rises. Across the marsh can be seen the rocky hill of Dunadd - well worth a visit as described later. The path heads to the right, back amongst the trees, soon reaching a junction. Turn left here to visit a raised wooden walkway that extends out across the bog and allows a close inspection of this fabulous habitat."
      },
      {
        "stage": 3,
        "description": "Return to the junction, this time bearing left. The path soon heads back through the trees to return to the start. The woods have been cleared of invasive alien rhododendrons to permit the growth of more native trees, mosses, ferns and flowering plants. Look out for the lungwort on an old rowan tree. Back at the car park, the farming landscape across the road shows what the Moine Mhòr would have been like if it had not been protected and preserved."
      },
      {
        "stage": 4,
        "description": "Before leaving the area it is well worth driving to Dunadd to visit this remarkable historic site; the walk to the top is no longer but much rougher and steeper than the Moine Mhòr trail. Take the minor road across to the A816. Head south and the road that gives access to Dunadd is off on the right hand side - leading to a parking area. From here a path (signed initially) climbs up the hill; it is mostly grassy but boggy and steep in some places."
      },
      {
        "stage": 5,
        "description": "The summit has wonderful views across the Moine Mhòr and has a special place in the history. There are a number of carvings around the rock including a footprint near the top, said to have been used in the crowning ceremonies of the Kings of Dalriada, the Kingdom of Argyll and an antecedent of the creation of Scotland. Return back down the hill the same way."
      }
    ],
    "scraped_at": 1756310986.181019
  },
  {
    "title": "Achnabreac Cup and Ring carvings, Cairnbaan",
    "summary": "This short forest walk visits the most extensive prehistoric rock carvings in the UK: the Achnabreac Cup and Ring rocks. The easy circular also gives good views over Lochgilphead towards the Isle of Arran.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/achnabreck.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.75,
    "estimated_hours": 45.0,
    "ascent_m": 65,
    "start_grid_ref": "NR851908",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The car park for Achnabreac (charge) can be found by taking a signed turn off the A816 to the north of Cairnbaan. Continue along the track for nearly a kilometre until the car park is found off to the right hand side. There are picnic tables and mountain bike trails leaving from here as well as two short walks - this one, and another that leads to a dragonfly pond."
      },
      {
        "stage": 2,
        "description": "The footpath begins over the little footbridge. Turn left at a junction, then right onto the direct path from the car park. The small but steep and rocky hill on the right - hidden amongst the conifers - is Dùn na Marag, the site of an ancient fort. Continue straight ahead on the path at a cross-roads - the route crossing here is part of the mountain bike trail. The path continues to climb very slightly. Soon the celebrated Achnabreac rocks are reached, enclosed by a fence to prevent damage; the route keeps to the walkway alongside. The rocks were formerly known by their anglicised name of Achnabreck."
      },
      {
        "stage": 3,
        "description": "The cup-and-ring markings - of which there are many, sometimes overlaid in layers, are 5,000 years old. There are no representation carvings and the designs are completely abstract, with the rings sometimes enclosing the cup markings and sometimes running along them. Despite study by experts no-one is really sure of the purpose of meanings of the carvings."
      },
      {
        "stage": 4,
        "description": "The path soon forks right though there are more carvings on the rocks by the fence - which can be hard to see from below. When you've finished looking at these remarkable remains, continue on the main path. It soon reaches a second, smaller fenced area with another series of less well-preserved markings. The path now climbs gently via zig-zags, with seats from which you can admire the fine views over Lochgilphead towards the Isle of Arran, with Goat Fell visible on a clear day."
      },
      {
        "stage": 5,
        "description": "The path now swings left and climbs past a bench through the forest until it reaches a wide forest track. Turn left along the track, keeping on the main left-hand track at a junction, to return to the entrance to the car park. Turn left once more to head into the car park and return to the start."
      }
    ],
    "scraped_at": 1756310988.765854
  },
  {
    "title": "River Lochy Falls & Strone Woods, Glen Lochy",
    "summary": "Strone Hill woods are a very beautiful remnant of ancient oakwood almost hidden by the surrounding forestry of Glen Lochy. There is a short waymarked trail - a delightful and very easy walk - that also visits the falls on the river.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/strone-woods.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 60,
    "start_grid_ref": "NN209271",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "There is a signposted forestry car park off the A85 marked for Strone Hill. The waymarked trail begins from the information board. Take the left hand trail first; the walk is waymarked in yellow. The trail soon leaves any conifers behind and passes through some beautiful mature oakwoods."
      },
      {
        "stage": 2,
        "description": "The trail soon bends round to the right. When a junction is reached, turn left to make the short detour to view the waterfalls - where the River Lochy plunges over some steep slabs. Return to the main path and continue along it."
      },
      {
        "stage": 3,
        "description": "Soon another junction is reached. The path aheead leads straight straight back to the car park. To continue the walk, turn left. Continue along this path; at the next fork an unmarked path goes off to the left. This is a short detour that leads to a picnic table in a beautiful location by a pool in the river. Back on the main route, continue along the path."
      },
      {
        "stage": 4,
        "description": "Further on the path forks again. The waymarked route makes a loop from here and returns to the same point, so it doesn't really matter which way you go. The oaks are mixed with birches in this part of the wood and the many nestboxes help ensure a rich birdlife. The river is close by but usually well hidden by the trees, whilst a bench provides a chance for a rest. Once the loop is complete, return along the trail back to the junction. Turn left here to return to the car park."
      }
    ],
    "scraped_at": 1756310991.349959
  },
  {
    "title": "Kilchurn Castle, Loch Awe",
    "summary": "Kilchurn Castle is a marvellously evocative ruin with a stunning setting on Loch Awe. Unsigned from road this short walk is a delight and ideal for a picnic on a fine summer's day.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/kilchurn-castle.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 40.0,
    "ascent_m": 10,
    "start_grid_ref": "NN139279",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Turn off the A85 onto a track on the south side between the turning for Inveraray and the bridge over the River Orchy. There is plenty of room for parking near the start of the track. Begin the walk along the track which immediately forks; take the signed path to the right, passing through a gate, to head to the river and cross under the railway bridge beside it."
      },
      {
        "stage": 2,
        "description": "Follow the surfaced path which rejoins the old route which came over a level crossing. Bear right towards the ruined castle which is now in clear view ahead; continue on the excellent path to reach it."
      },
      {
        "stage": 3,
        "description": "The castle is entered through a doorway marked 1693. An initial vaulted room leads through into the open courtyard. The main keep - a tower house - was actually built between 1440 and 1460 by Colin Campbell, 1st of Glen Orchy - a branch of the main Campbell clan based in Inveraray."
      },
      {
        "stage": 4,
        "description": "The remains are hugely impressive. You can ascend one of the turrets on the Loch Awe side, but the best views are to be had from the top of the keep. To climb this, go to the right through the courtyard and follow a series of modern wooden staircases to get to the top. The views are magnificent - both down Loch Awe and looking up the loch towards mighty Ben Lui."
      },
      {
        "stage": 5,
        "description": "The castle is usually pretty quiet. It is well worth walking out round to the left of the castle by the shores of the loch. Beyond it grassy ground slopes down into Loch Awe."
      },
      {
        "stage": 6,
        "description": "After you've explored the ruins, return to the start the same way."
      }
    ],
    "scraped_at": 1756310993.9358077
  },
  {
    "title": "Arichonan Clearance Village",
    "summary": "This short walk visits the haunting ruins of Arichonan, a township which was the scene of a riot during the Highland Clearances. The site has fine views down Caol Scotnish.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/arichonan.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 110,
    "start_grid_ref": "NR777910",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the Glean a' Gealbhan (the Glen of Burning) forestry car park off the B8025. Start by heading back up to the road and look out for a yellow marker post on the far side indicating the beginning of the path. This heads through the trees to the right, keeping just above, but parallel, to the road at first. Further on the path curves left uphill. There are great views looking back over Caol Scotnish. Further on the path slopes downhill before bearing right once more."
      },
      {
        "stage": 2,
        "description": "The path crosses a small burn before reaching the start of the abandoned village. In 1848 the landowner terminated the leases of four of the tenant families but when police came to enforce the evictions the villagers, supported by others from surrounding townships, rioted. Eventually several were jailed. The haunting remains of the houses enjoy a beautiful site, with fine views along the narrow channel of Caol Scotnish."
      },
      {
        "stage": 3,
        "description": "It is worth wandering up to the top end of the village, passing above two houses with more substantial remains; note the triangular windows on the upper house. After pondering the past and enjoying the present, return to the steps mentioned earlier, and this time head up them. They climb through the forest and soon reach a vehicle track."
      }
    ],
    "scraped_at": 1756310996.5269518
  },
  {
    "title": "Big Tree walk, Black Gates",
    "summary": "This short forest walk beside the Benmore Botanic Garden climbs between Californian Redwoods, Western Hemlock and Douglas Fir trees for good views across Strath Eachaig and to the hills beyond.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/big-trees.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 120,
    "start_grid_ref": "NS143854",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "This walk starts from the Benmore Botanic Gardens car park where there is a cafe and toilets as well as the famous gardens. From the car park cross the main road to reach the Black Gates forestry sign and an information board giving details on this and several other walks. You could easily link this route with Puck's Glen or the River Eachaig circuit. The route as described here is the shortest, blue waymarked route."
      },
      {
        "stage": 2,
        "description": "Begin by taking the path that begins climbing beside the information board. Almost immediately it reaches a fork; go right here. The path climbs up between the mighty conifers, at one point contouring to the right beneath a high crag. Further on is a huge fallen Silver Fir tree that was brought down in the Boxing Day gales of 1998. It weighs over 10 tonnes and was over a hundred feet tall - containing enough timber to build two wooden chalet houses or 60 garden sheds. The path crosses the trunk on a wooden stairway."
      },
      {
        "stage": 3,
        "description": "Continue along the path, passing a seat and turning left at a fork. There are good views up the glen towards Beinn Ruadh. When the path emerges on a forestry track, turn right. This track passes the starts of several different waymarked paths which head downhill to the right and rejoin the route of the old road which can be followed back to the start, including the celebrated Puck's Glen route; eventually the track links to Kilmun Arboretum. For our route, however, take the next right hand turn, signposted for the Big Tree walk."
      },
      {
        "stage": 4,
        "description": "When the path forks during the descent, keep left. The path eventually leads down to the old road, now a track, in Strath Eachaig. A left turn here would lead to the foot of Puck's Glen and its car park, but to return to the Benmore Garden car park turn right. The track soon leads back to Black Gates and the mighty trees at start of the walk."
      }
    ],
    "scraped_at": 1756310999.1132245
  },
  {
    "title": "Easdale explorer, Isle of Easdale",
    "summary": "Wander around the pretty cottages and old slate quarries then climb to the highest point on the tiny but fascinating car-free island of Easdale. Leave plenty of time to soak up the atmosphere, watch for wildlife or visit the museum or cafe.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/easdale.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.25,
    "estimated_hours": 1.0,
    "ascent_m": 35,
    "start_grid_ref": "NM739170",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "A regular passenger ferry runs between Ellenabeich on the Isle of Seil to Easdale (every half hour except lunch hour - timetable at the harbour). From the slipway on Easdale walk up past the waiting room and then past the community hall and cafe/pub on your left (note all the wheelbarrows which residents use to move items from the boat to the houses)."
      },
      {
        "stage": 2,
        "description": "After the cafe turn left to cross the square of grass towards the museum. Once the centre of the Scottish slate industry in the 19th century with over 500 men working in 7 quarries until storm flooding and a decline in the price of slate caused quarry closures. Slate production ceased in the 1950s and by 1960 there were only 4 people living on the island. That figure is now around 60 with Easdale often cited as an example of island regeneration. The folk museum, situated in the detached white and blue house just beyond the square, holds a wealth of information about life on Easdale."
      },
      {
        "stage": 3,
        "description": "Continue past the museum on a grassy path (wooden railing to the left) onto a rocky promontory overlooking a deep quarry. Head down to the rocky area between 2 quarries (the one on the right being the venue for the annual world stone skimming championship held in September) and then bear right to clamber up a faint path on the natural rock wall between the quarry and the sea - this rocky section can be avoided by short cutting across the green square at the centre of the village."
      },
      {
        "stage": 4,
        "description": "Continue towards an unusual house with a square tower, (all the buildings are made of slate) keeping to the seaward side of the slate garden wall before turning right to pass the far side of the square tower and head back towards the main cottages. At a main slate path turn left and follow it between slate walls bearing right at the next junction to rejoin the main path coming from the jetty and cafe and then immediately left to pass in front of a row of cottages looking out to sea."
      },
      {
        "stage": 5,
        "description": "Keep on the path as it passes a row of cottages with a tree outside and a boat anchorage on your right. Keep right on the slate path as it heads away from the buildings towards the quarries overlooking Easdale Sound. The walking is now on great spoil heaps of slate - bear left on a clear path keeping fairly near the sea to overlook a deep quarry before slightly doubling back to a dip; turn right in the dip on a path that aims for the right hand side (north) of the rocky hill."
      },
      {
        "stage": 6,
        "description": "Cross a dramatic path between two quarries and follow it up steps and round the far side of the hill. Stay on the main path and continue until just beyond a ruined building where a clear path heads away from the sea and soon up a series of steps uphill."
      },
      {
        "stage": 7,
        "description": "Follow the path to the highest point where a view indicator points out the various peaks and islands visible from this wonderful viewpoint. Below the cottages of Easdale and the quarries look peaceful and it is hard to imagine the noise and dust the industry must once have generated."
      },
      {
        "stage": 8,
        "description": "Return back down the hill by the outward route and turn left to continue on the path around the island. This passes through thick undergrowth and a stone wall before passing a cottage and turning left after this to pass between two slate walls and down steps to reach the main village path. Turn right here to return past the cafe and village hall to the ferry jetty."
      }
    ],
    "scraped_at": 1756311001.7013128
  },
  {
    "title": "Port Appin circuit",
    "summary": "An easy-going coastal walk taking in the headland beyond Port Appin with fine views over Lismore and out towards Mull.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/portappin.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.5,
    "ascent_m": 71,
    "start_grid_ref": "NM028538",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start the walk from the ferry car park at the back of the Pierhouse Hotel near Port Appin jetty. Follow the sign for Public Footpath to Clach Thoull around the right hand side of a house and along a track. Pass through a farm gate and continue on the wide track between the high cliffs and the coast."
      },
      {
        "stage": 2,
        "description": "The track curves slightly to the left and passes a bench with a fine view over Lismore, a fertile, green island who's name translates as 'big garden'. As you start to turn the corner of the track, a large arch comes into view - this was formed as a coastal arch before the sea level fell and formed the raised beach below. Just before you reach this, a path bears right through the bracken to the end of the headland. This is a very worthwhile detour with good views over the Lynn of Lorn and the possibility of seeing seals. When you reach the shore at the headland turn left and after a very short while the path heads back left inland and returns to the track just beyond the arch."
      },
      {
        "stage": 3,
        "description": "Having passed the arch, continue on the track as it curves around the headland. The track passes another cave on the left and then another arch which can be easily walked through. The track heads inland following the side of Airds Bay which is a good bird watching spot at low tide. There is also a good view of Airds House across the bay."
      },
      {
        "stage": 4,
        "description": "The end of the track is reached at a house. A sign for Port Appin shows the way around the far side of the house and along a path between woodland and a fenced field. Continue along this path until it goes through a metal kissing gate and emerges onto a minor road. Turn left along the road and left again at the next junction."
      },
      {
        "stage": 5,
        "description": "The road passes Port Appin village hall with its interesting display in the old lighthouse lantern adjacent to it. The display has information about Port Appin's history and industry and a great photograph of the lighthouse painted pink and yellow with a sad face as part of the campaign to stop it being replaced by a modern solar powered lighthouse. Continue along the road passing two shops including one offering cake and teas, until the ferry jetty is reached at the start of the walk."
      }
    ],
    "scraped_at": 1756311004.296508
  },
  {
    "title": "Barnluasgan Oakwood, Beaver trial site",
    "summary": "This very attractive walk climbs to a low ridge, richly forested with ancient oaks and birches, looking out over the scattered lochs and great forests of Knapdale. The route lies within the Scottish Beaver reintroduction trial area.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/barnluasgan.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.5,
    "ascent_m": 125,
    "start_grid_ref": "NR790909",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a well-signed Forestry and Land Scotland car park (charge) at Barnluasgan (not the Wildlife Information Centre signed with a beaver sign earlier from the road). Before beginning the walk it is worth visiting the log cabin which has information about the beavers and the forests of the area. This route follows the green waymarked trail at first before finishing on the blue trail on the far side of Loch Barnluasgan. Begin on the clear path which heads to the right hand side of the loch. After a short distance a faint path heads off into the trees on the right - ignore this, and pass the small boat mooring point."
      },
      {
        "stage": 2,
        "description": "Slightly further on a (waymarked) flight of steps leads up to the right. Turn up these steps, which give a steep, winding climb with good views back over Loch Barnluasgan. The birch trees soon give way to old oaks; at the top of the climb the path begins to run along a fine wooded ridge, with glimpses of Loch Linne down through the fine trees on the right."
      },
      {
        "stage": 3,
        "description": "Continue along the undulating ridge, eventually climbing slightly to reach a wooden bench with particularly fine views. From here the path heads left and begins the descent. This is marginally less steep than the way up, but still involves several flights of wooden steps. Soon the path passes through a gate in a deer fence and a grand view of Loch Barluasgan opens up ahead. Pass through a second gate as the steps lead back down to the all-abilities path close to the loch shore."
      },
      {
        "stage": 4,
        "description": "The quickest way back is to turn left but the walk can be slightly extended by turning right and passing round the far side of the loch. Almost immediately there is a wildlife hide overlooking the loch just to the left. Keep on the surfaced path that leads round the loch to return to the car park."
      }
    ],
    "scraped_at": 1756311006.8795164
  },
  {
    "title": "Puck's Glen",
    "summary": "Deservedly the most popular short walk in the region, Puck's Glen is a dark and atmospheric defile. A tumbling burn, criss-crossed by bridges, is enclosed by rocky walls heavily hung with mosses and overshadowed by dense trees.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/pucks-glen.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.5,
    "ascent_m": 126,
    "start_grid_ref": "NS146839",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Begin from Puck's Glen car park. There is an information board giving details of various waymarked routes; this description follows the Red route. It is also possible to link the walk with several others from different car parks, including the Big Tree walk and River Eachaig circuit from the Benmore Garden car park, and the Kilmun arboretum walk from near Kilmun. Begin the walk by following the old road to the north (to your left with the main road behind you), now a wide forestry path, passing behind a large complex of wooden chalets. After just under half a kilometre turn right onto the start of the path up Puck's Glen beside an old mile marker post. The path up Puck's Glen was built by the Youngers brewing family but fell into disrepair before being restored in 1986. This path starts up the right side of the burn at first but crosses it many times on footbridges."
      },
      {
        "stage": 2,
        "description": "The burn is broken by many small waterfalls, and the path edge above them is often unprotected so care is needed with children. The route climbs several short flights of stone steps whilst the steep and rocky sides of the gorge are heavily draped with mosses and ferns, as well as being shadowed by the dense forest."
      },
      {
        "stage": 3,
        "description": "There are handrails on the steepest sections of the path which has been expertly constructed to wind its way upstream. Eventually a junction is reached, with a sign indicating the 'Lower Glen' just visited, and the 'Upper Glen' ahead, whilst a path off to the right short-cuts the walk by heading back to the car park. Continue into the Upper Glen, descending briefly before crossing yet more bridges. There was once an ornate hut known as Puck's Hut built in the glen to heighten the drama, but it has now been moved to the Benmore Botanic Garden where you could visit it after finishing the walk."
      },
      {
        "stage": 4,
        "description": "There are several more waterfalls; this section of the path involves less climbing than the lower part of the glen."
      },
      {
        "stage": 5,
        "description": "Continue ahead to eventually emerge into daylight at a forestry track at a junction. Straight ahead is the Upper Puck's Loop. A left turn eventually enables a link with the Big Trees walk; several other waymarked paths leads off to the left from this track enabling routes of various length before returning to the car park along the old road. A right turn enables a link with the walk at Kilmun Arboreturm. For our route, turn right along the track at first. The waymarked return route soon forks off to the right (the rightmost of two paths going off to the right at the same point)."
      },
      {
        "stage": 6,
        "description": "This broad path gives some good views of the wide strath to the left at first before heading into the tall pines. After some descent a path junction is reached by a seat; the short-cut path from half-way up Puck's Glen comes in from the right here. Turn left to continue the descent, eventually crossing a hump-backed wooden footbridge and returning to the car park."
      }
    ],
    "scraped_at": 1756311009.47962
  },
  {
    "title": "Torinturk and Dùn a'Choin Dhuibh",
    "summary": "This short forestry circuit visits some fascinating archaeological remains including a hill-top Dun or iron-age fort with stunning views.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/torinturk.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 4,
    "distance_km": 2.5,
    "estimated_hours": 1.0,
    "ascent_m": 120,
    "start_grid_ref": "NR808640",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the Torinturk Forestry car park which is up a rather rough and rutted lane from Torinturk village - be careful not to ground your car! Start the walk along the waymarked left hand track from the car park. This runs across the densely forested hillside."
      },
      {
        "stage": 2,
        "description": "The track (really no more than a broad grassy path) ends at a turning area, and the walk continues uphill to the right on a much smaller path. This soon climbs to reach the Achaglachgach Cairns. The larger of these two ancient burials is neolithic, thought to date back as far as 4000 - 2000 BC. The smaller cairn, which is known locally as Diarmid's Grave after a Celtic hero, is bronze age - 2500 - 600 BC, and is marked by a distinctive triangular upright stone. The grassy path continues to the right of the cairns."
      },
      {
        "stage": 3,
        "description": "The path climbs up past a bench and bears right once more level ground is reached; not much further on, it starts to descend. Soon a marker indicates the start of a path off left signed for Dùn a' Choin Duibh. Take care to stay on the path as it winds up through the trees, then bears right. It meets the original path up to the Dùn at a t-junction; turn left up a very steep grassy path to reach the top. Here a bare, heathery hilltop is crowned with the impressive remains of the stone fort. Along the wall to the left is a small doorway which may have led to a small chamber. Local legend has it that this housed a black wolfhound bitch which guarded the Dùn and gave it its name, which means the Fort of the Black Dog."
      },
      {
        "stage": 4,
        "description": "Pass around the wall to the right to reach the inner part of the Dun, with views over West Loch Tarbert to the mountains of Arran. The only descent route from the Dun itself is back the way you came, taking care on the steep grass; you can continue down to the track on the original old path which is clearer than the waymarked one. Once back on the track turn left to continue the walk. Turn right when a larger track is reached and follow this back to the car park at the start."
      }
    ],
    "scraped_at": 1756311012.0613987
  },
  {
    "title": "Sutherland's Grove forest walks, Barcaldine",
    "summary": "This walk follows a waymarked trail through the forest, leading up through a fine gorge. The return route follows tracks and paths to complete a circuit through the forest.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/glen-dubh.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.7,
    "estimated_hours": 1.0,
    "ascent_m": 60,
    "start_grid_ref": "NM965421",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the Sutherland's Grove forestry walks car park (parking charge); this route is waymarked in blue as the Troll Trail - there are also a couple of shorter waymarked walks. Do not cross the stone bridge at the far end of the parking area, instead beginning the walk by turning left onto the footpath (waymarked in all colours) that begins next to the bridge, following the burn uphill. The path runs through some picturesque woodland with giant Douglas Firs as well as oak, birch, beech and rowan, and there are some pretty waterfalls in the stream alongside."
      },
      {
        "stage": 2,
        "description": "Soon the stream issues from a small gorge and the fairly rough path runs along the edge giving good views of the tumbling water. A path junction is reached; turn right, following the blue route, to descend steps and cross the bridge over the gorge; it gives great views of the rocky stream bed."
      },
      {
        "stage": 3,
        "description": "Continue following the path which now climbs gently through the trees. Ignore a path off to the right, instead curving left and eventually reaching a forestry track. Turn left along this."
      },
      {
        "stage": 4,
        "description": "At the next junction keep left again, following the track downhill. Keep straight ahead to cross a bridge over the burn, then keep ahead again at each of three junctions where tracks lead off to the right."
      },
      {
        "stage": 5,
        "description": "Shortly before the track emerges at a road turn left on a surfaced path. Look out for a blue waymarker indicating where to leave this and take a narrower path through the trees. Keep straight ahead when this crosses a cycle path, and again across the entrance track to Sutherland's Grove. The path now leads to the riverbank and then heads left along it to return to the start, passing some magnificent fir trees planted in the 1870s."
      }
    ],
    "scraped_at": 1756311014.645088
  },
  {
    "title": "Gleneck Viewpoints walk, Glenbranter",
    "summary": "This waymarked trail climbs high above Glenbranter through native forest, giving superb aerial views over the glen and away to the head of Loch Eck.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/gleneck.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.75,
    "estimated_hours": 2.0,
    "ascent_m": 180,
    "start_grid_ref": "NS110977",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins at the Forest & Land Scotland car park in Glenbranter. Several circular routes are waymarked from here; this trail is marked throughout in green. Start the walk up the path from the posts by the visitor centre. The path heads up some steps; go left (marked in all colours at a junction), then right (waymarked in green only) to pass a picnic bench. A turning area is reached; follow the track ahead, ignoring a track coming in from the left, which is used on the return, and instead continue for a couple of hundred metres to where a made path on the left is waymarked with a green marker post. Head up this path."
      },
      {
        "stage": 2,
        "description": "The path climbs steeply, swinging left and right in a series of zig-zags and giving improving views back over Glenbranter. A bench provides an opportunity for a rest part way up, whilst further on the path rises again up a flight of wooden steps. Looking back the view now stretches as far as the head of Loch Eck. The going levels off slightly as the path rounds an area of much sparser trees. The memorial in view on the right commemorates Queen Victoria's Diamond Jubilee."
      },
      {
        "stage": 3,
        "description": "The path now curves round to the left below the steep crags of Creag Bhaogh. There is another seat with grand views down through the native trees towards Loch Eck."
      },
      {
        "stage": 4,
        "description": "The path climbs steeply once more - with good views back - before becoming a track and beginning to descend gradually. After some distance a junction is reached; turn sharp left down the track here to continue the descent."
      },
      {
        "stage": 5,
        "description": "At the next marked junction a path waymarked in yellow, red and blue goes off to the right - this leads eventually to the Allt Robuic Waterfalls walk visiting a gorge which is well worth doing if you have the time. Otherwise, continue ahead down the track, ignoring another path off to the right, to eventually return to the access track for Glenbranter car park. Turn right here to return to the car."
      }
    ],
    "scraped_at": 1756311017.243601
  },
  {
    "title": "Stonefield Castle and Barmore Island",
    "summary": "Stonefield Castle dates back to 1837 and is now a hotel. The walk descends through the gardens to make an idyllic round of Barmore Island.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/stonefield-castle.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 12,
    "distance_km": 2.75,
    "estimated_hours": 1.0,
    "ascent_m": 60,
    "start_grid_ref": "NR653490",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the very impressive Stonefield Castle Hotel, where tea and coffee is served as well as lunches and accommodation; parking is courtesy of the hotel. Begin the walk by heading down the steps to the right of the hotel, leading into the gardens. Almost immediately the path reaches a junction; head to the left first (signed for the harbour and jetty)."
      },
      {
        "stage": 2,
        "description": "The path heads through a fabulous collection of rhododendrons before it soon crosses a track. The route eventually heads to the right along this but first continue on the path straight ahead to visit the jetty or harbour. There is a bench here which provides the perfect spot to enjoy the lovely views of Barmore Island and across to Kintyre."
      },
      {
        "stage": 3,
        "description": "After enjoying this lovely spot, return to the track just crossed and turn left. Another left turn leads down to the shore once more at a second stunning spot for a break, again with a bench. Otherwise, turn left at the following junction, following a track across a bridge and heading out onto the grassy neck of land that connects the so-called Barmore island with the mainland. Join a track coming in from the right, and head out to Barmore."
      },
      {
        "stage": 4,
        "description": "Once on the 'island' turn right onto an idyllic footpath along the near shore. After a short distance through this heads down to and then runs along a rocky shore - which may be water-covered at high tide. At the far end of this the path climbs up steeply to the left to cross over to the far side of Barmore."
      },
      {
        "stage": 5,
        "description": "Follow the path down on the seaward side of the island and then follow it as it runs around the shore to the left. This is a very peaceful spot, with views across to the Cowal peninsula. Continue round the northernmost part of the island and past two monkey puzzle trees on the way back to the grassy isthmus, with Stonefield Castle looking impressive ahead."
      },
      {
        "stage": 6,
        "description": "Head back across the isthmus, bearing right, and then following the sign which cuts more directly up through the rhododendron gardens to return to the hotel."
      }
    ],
    "scraped_at": 1756311019.9087927
  },
  {
    "title": "Rhue Lighthouse, near Ullapool",
    "summary": "A short and easy walk to Rhue lighthouse with good views down Loch Broom and out to sea including to the Summer Isles. Can be combined with a walk up the road and track to the mast on Meall Mòr to make a longer walk.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/rhue.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.2,
    "estimated_hours": 20.0,
    "ascent_m": 32,
    "start_grid_ref": "NH097973",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "From the car park at the end of the public road in Rhue take the path heading down towards the coast. Go through a wooden kissing gate and follow the grassy path, which can be boggy in places."
      },
      {
        "stage": 2,
        "description": "The path skirts the coast, passing above a nice pebbly beach on Loch Broom. The path crosses a small stream and undulates as it heads towards the lighthouse visible against the sea behind. The lighthouse provides a good vantage point looking up Loch Broom towards Ullapool or seawards towards the Summer Isles. The shapely mountain of Beinn Ghobhlach is directly across Loch Broom whilst Ben More Coigach forms an impressive wall to the north. It is possible to walk a short distance north west along the coast for some different views."
      },
      {
        "stage": 3,
        "description": "The return route is by the same outward path. A longer walk can be made by walking (or driving) back along the Rhue road to the point where the track descends from the mast at the top of Meall Mòr . The walk up to the mast takes approximately 40 minutes and provides a fine viewpoint on a good day."
      }
    ],
    "scraped_at": 1756311022.4918826
  }
]