[
  {
    "title": "The Fairy Glen, near Uig",
    "summary": "A bizarre and delightful miniature landscape of grassy, cone-shaped hills, the Fairy Glen (sometimes spelt Faerie Glen) is a fascinating and otherworldly place to visit.",
    "source_url": "https://www.walkhighlands.co.uk/skye/fairyglen.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.5,
    "estimated_hours": 1.0,
    "ascent_m": 45,
    "start_grid_ref": "NG411632",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Take the side road which leaves the A87 near the Uig Hotel - signed for Sheader and Balnaknock. After a few houses the Fairy Glen comes into view ahead as you descend. There is a pay-and-display car park on the left.  Take the obvious path from the car park that slopes uphill from a parking meter. It soon reveals a striking view of a unique landscape; the Fairy Glen was formed by the land being disrupted by a series of landslides (on a smaller scale than the huge landslips that formed the Storr and the Quiraing), with the results then smoothed by subsequent glaciation."
      },
      {
        "stage": 2,
        "description": "Stay on the good path that descends and passes between some of the striking grassy conical hills. The path leads past a small lochan and then emerges on the road. Go straight across and follow the path as it bends left, running parallel to the road briefly, and then diverging around the opposite side of a lochan. Soon the sharp park of Castle Ewen is seen - the path climbs to the right of this."
      },
      {
        "stage": 3,
        "description": "The path emerges at a grassy hollow next to Castle Ewen. From here you can make a detour to the summit of this rocky tower if you wish - a steep path leads up onto the ridge. Head left along the narrow ridge and then up a final scramble up a rocky step in a gap in the summit tower - great care is needed."
      },
      {
        "stage": 4,
        "description": "The summit is surprisingly spacious, with enough flat grass for a picnic."
      },
      {
        "stage": 5,
        "description": "Retrace your steps to return to the grassy hollow below the ridge. A great deal of work has taken place here to clear away the stone stacks made by visitors which were causing damage to the grazing land - please leave any stones as you find them. Now take the path that heads through the gap to the right of the Castle Ewen ridge. This soon descends to meet the minor road."
      },
      {
        "stage": 6,
        "description": "Once back at the road, turn left to head back to the start along it. Castle Ewen looks impressive across a small loch."
      }
    ],
    "scraped_at": 1756310176.3094475
  },
  {
    "title": "Coille Iòsal, Braes",
    "summary": "This short walk is set in the heart of the lovely Braes area south of Portree. It climbs up through native woodland to visit a waterfall before a more open return giving great views across the Sound to Raasay and Ben Tianavaig.",
    "source_url": "https://www.walkhighlands.co.uk/skye/braes.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 111,
    "start_grid_ref": "NG515366",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "There is a parking area at Braes village hall, by the recycling bins. The Braes was the site of the famous Battle of the Braes where local crofters fought Glasgow policemen during the Crofters' struggle for security of tenure - there's a memorial to the Battle a kilometre further down the road. Back at the car park, the walk begins opposite the stone buildings. It heads through some lovely native woodland of birch, hazel, rowan and juniper."
      },
      {
        "stage": 2,
        "description": "Follow the white markers as the path heads uphill, passing above a ravine to eventually emerge onto the open moor. The path continues up the moor, crossing a tiny bridge and having some wooden steps in places. There are great views looking back across the Sound."
      },
      {
        "stage": 3,
        "description": "Near the top, it comes alongside a pretty cascading waterfall. Continue above the waterfall to a gate."
      },
      {
        "stage": 4,
        "description": "Go through the gate and immediately turn right (ignoring the second gate ahead). Soon the path becomes a track. There's a bench here with a fabulous view of Raasay and Ben Tianavaig."
      },
      {
        "stage": 5,
        "description": "Continue on the track, which passes beneath a waterworks and a small electricity substation as it descends back down to the Braes road. Turn right along the road to return to the start."
      }
    ],
    "scraped_at": 1756310178.8940446
  },
  {
    "title": "Dùn Scaith Castle, Tokavaig",
    "summary": "This very short walk leads to the dramatic remains of Dùn Scaith Castle. The views are quite simply sensational, well justifying the drive along the switchback road to reach the start.",
    "source_url": "https://www.walkhighlands.co.uk/skye/dunscaith.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 2,
    "distance_km": 2.0,
    "estimated_hours": 40.0,
    "ascent_m": 20,
    "start_grid_ref": "NG600118",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park off the road at Tokavaig Bay, which has the most sensational views of the Cuillin and Bla Bheinn, with Dùn Scaith castle visible as a foreground. Walk along the road towards Ord. Just past the cattle grid a track branches off to the left. Turn sharp left here."
      },
      {
        "stage": 2,
        "description": "Follow the track across the head of the bay passing a prominent rock outcrop on your right. The track leads to a whitewashed crofthouse. Pass to the left of the house; the going from here has only faint paths, but it doesn't matter whether you head directly over the low rise or keep closer to the shoreline; either way you'll approach the castle."
      },
      {
        "stage": 3,
        "description": "The remains of Dùn Scaith castle date back to the 13th century but occupying an older, fortified site. The castle, perched on a rock above Loch Eishort, was a stronghold of the Macleod before it became the principal seat of the MacDonalds of Skye in the 15th century.  Among the many legends associated with Dùn Scaith are those recounted in Macpherson's 'Ossian' concerning the adventures of the Irish folk hero Cu Chulainn, who came here when he first landed in Skye. One tradition tells how he came here to learn the marshal arts of war from the warrior queen 'Sgathaich', whose home this was. The castle is reached over a gully bridged by two walls which flanked a drawbridge, whose pivot holes are still visible on the far side. With the drawbridge missing the dangers of entering the castle can be clearly seen. On the far side of the bridge a door would have opened onto a flight of steps leading up between walls to the castle."
      },
      {
        "stage": 4,
        "description": "Parts of the curtain wall (one of the earliest surviving examples in the district of lime-mortared construction, being random rubble with smaller infill bound with lime) still cling to the cliff edge, but what survives of the internal structures (which probably included a tower) are identifiable only by grassy mounds. In the courtyard is a well, and at the south east angle are remains of a stair within a tower leading to the parapet walkway. To the right of the castle great views of the Cuillins can be seen on a clear day. Immediately across the water are the remains of the cleared villages of Boreraig and Suisnish."
      },
      {
        "stage": 5,
        "description": "Return to the road along the same outward path and track."
      }
    ],
    "scraped_at": 1756310181.4763572
  },
  {
    "title": "Kylerhea Otter Hide trail",
    "summary": "Easy walk with lovely views over the Kyle strait to the mainland. The hide at the midway point gives a good opportunity to spot otters, seals and other wildlife. Picnic tables and toilets near start.",
    "source_url": "https://www.walkhighlands.co.uk/skye/kylerheaotter.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 1,
    "distance_km": 2.25,
    "estimated_hours": 1.0,
    "ascent_m": 43,
    "start_grid_ref": "NG786211",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the Kylerhea Forestry and Land Scotland car park on the left as you come down the hill towards Kylerhea. Just below the parking there's a lovely picnic area overlooking the water and the Skye Ferry from Glenelg."
      },
      {
        "stage": 2,
        "description": "Follow the track north, soon passing the toilets. There are breaks in the mixed woodland with seats offering great views over the water."
      },
      {
        "stage": 3,
        "description": "Turn right at a fork, then right again on the main path whic leads downhill to reach the otter hide. The hide is free (donation box) and open all year.  While otters may prove elusive, there are usually seals to be seen on the rocks to the left of the lighthouse."
      },
      {
        "stage": 4,
        "description": "Retrace your steps the same way back to the car park."
      }
    ],
    "scraped_at": 1756310184.063243
  },
  {
    "title": "Scorrybreac circuit, Portree",
    "summary": "A beautiful circuit on the north side of Portree bay, popular with both visitors and local dog walkers.",
    "source_url": "https://www.walkhighlands.co.uk/skye/scorrybreac.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 2.0,
    "ascent_m": 164,
    "start_grid_ref": "NG488437",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Scorrybreac Road is the first right turn after passing above the harbour on the road towards Staffin (signed Cullin Hills Hotel). There are marked parking bays on the shore just after the turning to the Cuillin Hills hotel. There are picnic tables here, and further along the route. A display board gives a map and details of this walk. The walk begins along the tarmac path close to the wooded shore, giving excellent views of the cottages around Portree Harbour. A prominent tower in the woods above the harbour is an example of an Apothecary's tower, built as a sign to passing seafarers that medical supplies and expertise are available in the village. Photo: Portree harbour from Staffin road"
      },
      {
        "stage": 2,
        "description": "The path soon passes the boathouse which is the home of Portree sailing club before crossing a footbridge and reaching a gate signed 'Urras Clann Mhicneacail'. This is Gaelic for the Nicolson Trust, the headland beyond has been purchased by members of the Clan Nicolson from all around the world, Scorrybreac being considered the homeland of the clan."
      },
      {
        "stage": 3,
        "description": "Through the gate, the path becomes gravelled. To the left of the path is a memorial with a flagpole and grand views across Loch Portree to the distant Cuillin hills. The plaque commemorates the members of Clan Nicolson who contributed to buying this land. A further gravel path and steps can be optionally climbed to reach a higher viewpoint above the cliff."
      },
      {
        "stage": 4,
        "description": "Back on the main path, continue beside the shore. The low lying land blocking the entrance to Portree bay is part of the Isle of Raasay, whilst the hill directly across the bay is Ben Tianavaig. White-tailed eagles nest on the inaccessible cliffs below Ben Tianavaig, so keep a keen eye out. The outcrop of rock just offshore, which can be reached at low tide, is the Black Rock, whilst across Loch Portree you can clearly see the sandy beach at Camas Ban. The loch itself is home to a number of salmon farms. The fish can usually be seen within their enclosures as they jump up from the water. Common seals can also sometimes be seen swimming by the shore."
      },
      {
        "stage": 5,
        "description": "The path reaches a stone seat where a view of the high coastal cliffs to the north are revealed. The going becomes stonier at this point; continue ahead on the path until it reaches a dry stone wall. Here, turn left and follow the path uphill, at first beside the wall; soon it bends left and ascends a steep series of zig-zags."
      },
      {
        "stage": 6,
        "description": "Above the zigzags, the route levels off. There are great views over the salmon farms to Raasay, with Dùn Caan prominent like a little volcano. The route now loses sight of the coastline and crosses more open countryside. Continue on the path, passing through a kissing gate before heading downhill to a further gate. The path now enters an attractive silver birchwood. After another kissing gate, the path descends along the edge of the wood before emerging behind the Cuillin Hills hotel. Continue down the tarmac road back to the start point."
      }
    ],
    "scraped_at": 1756310186.652054
  },
  {
    "title": "Neist Point",
    "summary": "Neist Point - the most westerly headland on Skye - is an iconic destination, with stunning cliff scenery, a fine lighthouse, an outlook to the Outer Hebrides, and the chance to watch for minke whales in the summer months.",
    "source_url": "https://www.walkhighlands.co.uk/skye/neistpoint.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 2.0,
    "ascent_m": 142,
    "start_grid_ref": "NG132478",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the end of the road. There is enough space for a number of cars. The parking can be congested in the summer months, but new spaces created alongside the road are a great help. Begin by following the path through the gate, which if locked can be easily walked round. The only actual private area is that fenced around the lighthouse and cottages - the rest is the common grazings for Waterstein township. Almost immediately turn left on the path, which then swings right to ease the descent to the headland far below. There is a metal handrail for most of the descent."
      },
      {
        "stage": 2,
        "description": "There is an aerial ropeway which is used to take supplies out to the lighthouse and cottages at the Point. Continue along the now level path. Several scenes in Lars Von Trier's film Breaking the Waves were shot here. It is possible to detour to the right to visit the edge of the cliffs, overlooking the great prow of An t-Aigeach  (meaning the Stallion's Head), the dramatic upstanding crag half way out on the headland. The crag is the site of some of Skye's hardest rockclimbs.  To the left are great views to the impressive cliffs of Waterstein Head and the Hoe, the second highest on Skye."
      },
      {
        "stage": 3,
        "description": "At the highest point of the constructed path, a grassy path heads off to the right - this is an optional detour to the top of  An t-Aigeach. If you decide to visit the top take great care near the cliff edge, and retrace your steps back to the main path. As the corner is rounded the lighthouse comes into view for the first time."
      },
      {
        "stage": 4,
        "description": "Continue along the path towards the lighthouse and the former keepers' cottages (once run as accommodation but now closed down). The complex was built in 1909 at a cost of £4,350 - the engineer being David A Stevenson of the famous Stevenson family of lighthouse builders. From the path junction, you can turn left along a made path to reach the crane and crane which was once used to bring in supplies. It is also worth detouring across rougher pathless ground beyond the lighthouse complex to reach the furthest point. Look out for breaching fins and blows in the sea - this is one of the best places for whales and dolphins on Skye."
      },
      {
        "stage": 5,
        "description": "The return route is back the same way. It is worth detouring to the left from the path before it heads round An t-Aigeach to visit the cliff edge; from here you can watch seabirds in season but take care as the edge is, of course, unprotected."
      },
      {
        "stage": 6,
        "description": "For the classic view of the lighthouse beyond the cliffs, you can head on a boggy path northwest from the car park for a short distance (this is the start of the Neist and Milovaig clifftop walk). This must rank as one of the best places imaginable from which to watch the sunset."
      }
    ],
    "scraped_at": 1756310189.236361
  },
  {
    "title": "Dunvegan Two Churches Walk, Dunvegan",
    "summary": "Park in the car park at the Duirinish Church of Scotland in Dunvegan village, on the road towards the castle. The walk starts through gate to the left of the church; there is an information board giving details of the route. At first the route leads through a felled area - which is being replanted with native trees.",
    "source_url": "https://www.walkhighlands.co.uk/skye/twochurches.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 45.0,
    "ascent_m": 88,
    "start_grid_ref": "NG251479",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the car park at the Duirinish Church of Scotland in Dunvegan village, on the road towards the castle. The walk starts through gate to the left of the church; there is an information board giving details of the route. At first the route leads through a felled area - which is being replanted with native trees."
      },
      {
        "stage": 2,
        "description": "Further on the path narrows and reaches more established native woodland. There are many wild flowers here in spring and summer, and glimpses of a view over Loch Dunvegan. After some Eventually an unmarked T junction is reached with a larger path. Turn right, heading uphill. The path climbs up to pass through a gate and reaches the open moor beyond."
      },
      {
        "stage": 3,
        "description": "As the path begins to descend look for a pedestrian gate in the fence on the right  - there's a prominent standing stone on the hill beyond. Pass through the gate and head for the stone. The stone is a commanding viewpoint for Dunvegan village and miles around, but it is not a prehistoric monument. Instead, it was erected on midsummer's day 2000 by the villagers of Dunvegan, using only hand power and ropes. As the stone is fifteen feet high and weighs five tons, this was an impressive feat, and presumably used the same techniques as would have been used to build stone circles thousands of years ago."
      },
      {
        "stage": 4,
        "description": "There are excellent views of Macleods Tables, and the distant Cuillin ridge. Head downhill on a faint grassy path towards the ruined church in view."
      },
      {
        "stage": 5,
        "description": "The path passes just to the right of St Mary's Church, which dates to before the reformation, to reach the road. Turn right on the road (crossing over for the pavement), and right again at the T junction to return to the current church and the start."
      }
    ],
    "scraped_at": 1756310191.8314097
  },
  {
    "title": "Dùn Ringill, Kilmarie",
    "summary": "A short, attractive walk to the remains of a medieval castle, visiting a Chambered Cairn on the way back.",
    "source_url": "https://www.walkhighlands.co.uk/skye/dunringill.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.5,
    "ascent_m": 27,
    "start_grid_ref": "NG554172",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the small car park just beyond the Kilmarie house next to Kilmarie burial ground. Walk back up the road past the house until you reach a metal gate on the right leading to a woodland path. Follow this path and cross the ornate bridge over the Abhainn Cille Mahaire. Kilmarie House was until 1994 owned and lived in by Ian Anderson, the singer and flautist who fronted Jethro Tull, since 1968. He sold the estate at a very reasonable price to the John Muir Trust who now manage the land with conservation as the first priority. The house - and most of the ground on this route - remain privately owned and the current owners request that walkers observe the access code and in particular keep dogs under tight control to protect the wildlife along the route."
      },
      {
        "stage": 2,
        "description": "Immediately after crossing the bridge take the path on the right running parallel to the river. The path heads out to the bay passing a ford with stepping stones. Don't go through the gate but keep to a grassy path alongside the fence. At one point the fence turns left (leading towards a stile) - continue straight on here across a tiny stream to reach another stile further on. Cross this stile and follow the boggy path beyond."
      },
      {
        "stage": 3,
        "description": "A clear, and in places boggy, path follows the coast climbing very gently. In a short distance it joins a clearer path coming in from the left (this route is used for the return). After a small rocky headland, the built remains of Dùn Ringill can be seen on the right near the cliff edge. The path leads over to the Dùn. The entrance is intact and can be passed through to give a good view up and down the coast from the Dùn. Dùn Ringill was the original seat of Clan Mackinnon before they moved to Castle Moil at Kyleakin. It was built on the site of an earlier iron age broch or fort."
      },
      {
        "stage": 4,
        "description": "After exploring the coast and enjoying the views, return back along the path to where you came up from the left earlier. This time continue on the main path; soon it crosses a stream on the edge of the wood. One path goes downhill left from here to return to the outward route; instead, follow the path uphill to the right into the trees. Soon this path passes a bench; a very short distance beyond this turn left along another grassy path. This passes the remains of some stone buildings with a view of the twin summits of Bla Bheinn ahead. Turn left at yet another fork and the path soon becomes a track."
      },
      {
        "stage": 5,
        "description": "Continue along the track. Soon it heads down towards a dip with a rise ahead; look out on the left before the dip for a path heading into the trees (a sign here reads 'No Camping, No Fires). This path leads back down through the woods to the footbridge crossed near the start of the walk. Immediately before reaching the footbridge, look left to see a prominent but overgrown grassy mound. This is the Kilmarie Chambered Cairn, one of the best examples on the island. Near the top of the cairn (on the same side as the stream) is a small square opening or cist; these were used for burial. A beaker found in the cist here is in the National Museum of Scotland. Take great care not to disturb or damage the site before returning over the bridge to the start."
      }
    ],
    "scraped_at": 1756310194.416503
  },
  {
    "title": "Cnoc a'Mhadaidh Ruaidh, Kyleakin",
    "summary": "This short walk follows the Anavig Trail climbs through mixed woodland above the edge of Kyleakin. There are superb views over the Skye Bridge, Kyleakin, the Cuillin and distant Trotternish, more than making up for the massive nearby quarry works that mar the coast below.",
    "source_url": "https://www.walkhighlands.co.uk/skye/cnoc-a-mhadaidh-ruaidh.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 10,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 89,
    "start_grid_ref": "NG743263",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Old Kyle Farm Road is the minor road heading south from the Skye Bridge roundabout on the edge of Kyleakin. There is a layby on the right a short distance along the road before the first house; the walk begins from here, where there is an information board. Follow the gravel path that starts between the two boulders and climbs through into native woodland, soon crossing a small wooden bridge."
      },
      {
        "stage": 2,
        "description": "Soon the views really begin to improve, first towards the flat-topped summit of Dùn Caan on the Isle of Raasay, and then back over the steep hump of the Skye bridge and over Kyleakin."
      },
      {
        "stage": 3,
        "description": "After a climb a fork is reached where a rocky path leads off right; this is used on the return route so ignore it for now. Continue ahead on the main path, ignoring a blue waymarked path which turns off to the left. The path then reaches a clear section near the summit of Cnoc a'Mhadaidh Ruaidh (the hill of the red fox). The views are simply superb. Applecross is visible on the mainland, with the long outline of Raasay to its left, and the distant Storr in Trotternish is visible beyond."
      },
      {
        "stage": 4,
        "description": "However perhaps the dominant feature are the steep but rounded outlines of the Red Hills, with the spikier Cuillin peaking out over them in places; the path heads this way, eventually curving left."
      },
      {
        "stage": 5,
        "description": "Soon the path reaches a bench backed by a view of the Kylerhea Hills. Continue to reach a path junction. The easiest way back from here is to turn left on the blue route which soon loops back to the outward route. Otherwise, turn right to keep following the red route; this path descends gradually around the north side of the hill across a felled area, eventually swinging back to return across the hillside at a lower level. There are views through birchwoods to the industrial buildings comprising a massive fish feed plant."
      },
      {
        "stage": 6,
        "description": "The path crosses a wooden bridge and climbs once more to reach an area of more open, native woodland. At one point the path climbs a rocky slab, but this can be bypassed using a route off to the left. Once again there are views ahead of Kyleakin and the Skye Bridge, now from a new angle. Eventually the outward route is rejoined; continue ahead and follow the path back down to the start."
      }
    ],
    "scraped_at": 1756310197.045206
  },
  {
    "title": "Bearreraig Bay",
    "summary": "Bearreraig Bay is a beautiful stony bay famous for its fossils - a short walk with a very steep path. This is a quiet and secluded place when the nearby Old Man of Storr is packed with visitors.",
    "source_url": "https://www.walkhighlands.co.uk/skye/beareraigbay.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.25,
    "estimated_hours": 2.0,
    "ascent_m": 153,
    "start_grid_ref": "NG516524",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Heading north on the main road from Portree, the Hydro road turns off on the right immediately after the Storr Lochs. There is a bus shelter next to the turning. There is a parking area part way along this road before the dam. Start the walk here and continue along the road before turning right to leave the road at a path sign to follow a short section of path skirting the house and turning area."
      },
      {
        "stage": 2,
        "description": "The winch house is the square flat roofed building used to pull a carriage up and down a funicular track to the Hydro station below. Bear left to head down the far side of the winch house to reach a viewpoint.  The viewpoint has superb views of the bay below, with the Storr cliffs visible far above. Interpretative displays explain about the fossil finds and the geology. The path down to the bay starts on the seaward side of this viewing area, descending in a series of zigzags. It soon reaches a staircase cut out of the rock above a big drop - luckily this part has a handrail!"
      },
      {
        "stage": 3,
        "description": "Beyond the path continues zigzagging right down to the Hydro station on the beach. The hydroelectric scheme, which includes the Storr Lochs on the moorland above, was built in 1952 and gave Skye its first electricity supply (apart from the Royal Hotel which had a generator). It has a capacity of 2.4MW, not nearly enough to supply the island's needs today. You can see the turbine through the windows. Go through the gate and head along the front wall of the building, passing above the water rushing out from the turbines. Beyond the building, cross the stile. Usually it is easy to cross the burn near here as most of the water now heads through the turbines instead but occasionally there is more water here and it may be impassable."
      },
      {
        "stage": 4,
        "description": "After crossing there's a broken stile. Cross to head out onto the stony beach - looking out for otters which can sometimes be spotted swimming offshore. At the far end of the bay crumbling cliffs reach down almost to the sea. Below these cliffs is the best place to hunt for fossils - at low tide; but don't take any away as this is a protected site. Afterwards, return back past the front of the hydro building. Before heading back up the steep path to the right, it's worth crossing the stile ahead and exploring the wave cut platforms at this end of the beach. If you round the corner of the bay you can see Holm Island just offshore - according to local legends this was Tir Na Nog, the land of eternal youth. It's necessary to reascend the path you came down in order to return to the start."
      }
    ],
    "scraped_at": 1756310199.6332908
  },
  {
    "title": "Torridon Trail - boathouse walk",
    "summary": "Easy waymarked walk with beautiful views across Loch Torridon. The walk includes a beauiful section of shoreline.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Lochtorridon.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.5,
    "estimated_hours": 45.0,
    "ascent_m": 40,
    "start_grid_ref": "NG889542",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the parking for Torridon Activities/Beinn Bar (the entrance after the Torridon Hotel turn off the A896 heading east between Torridon and Sheildaig). From the car park head into the courtyard behind the Beinn Bar and follow the track over a small bridge. At the cross-tracks, keep straight ahead - our route follows the markers for 'Torridon Trail'."
      },
      {
        "stage": 2,
        "description": "The track continues through the pinewoods - great effort has been made in recent years to restore these to good condition, after the area was blighted by invasive rhododendrons. It is now starting to recover its former glory. Eventually a junction is reached - the track ahead continues towards the Falls of Balgy - a much longer walk - whereas our route turns right onto a path, signed for Torridon Trail."
      },
      {
        "stage": 3,
        "description": "The path winds through the trees, passes through a gate, gives a view over the boathouse to the left, and then descends steeply to reach a track. Turn right along the track along the loch shores. There are superb views across the water towards Torridon village and Liathach looming behind."
      },
      {
        "stage": 4,
        "description": "Continue along the shore, with an increasinly lovely view back over the pine-clad islet of Eilean Chasgaig across Loch Torridon to the mountain of Beinn Alligin on the far side. This is a good spot to catch a sighting of herons, oystercatchers and otters. Eventually the track swings right away from the loch. Turn left through a gate signed for the Kitchen Garden. Head into this walled garden which still produces vegetables for the Loch Torridon hotel. Turn right in the centre of the garden to pass alongside the polytunnels, passing through a gate to leave the garden and join a track. Turn right along the track to return to the start."
      }
    ],
    "scraped_at": 1756310847.817512
  },
  {
    "title": "Buzzard Path, Beinn Eighe visitor centre",
    "summary": "This short, attractive walk in the Beinn Eighe National Nature Reserve begins from the visitor centre - a great source of information. The walk has a good path through the pinewoods leading past several excellent sculptures but perhaps the greatest attraction is the superb views of Beinn Eighe and Slioch.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Talkingtrail.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.5,
    "estimated_hours": 30.0,
    "ascent_m": 50,
    "start_grid_ref": "NH020630",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the car park for the Beinn Eighe Visitor Centre at Aultroy on the A832. The visitor centre is housed in an old white cottage; there are also toilets. The walk begins past the front of the visitor centre, reaching an attractive picnic area with finely carved benches and tables."
      },
      {
        "stage": 2,
        "description": "There is a large wooden hide here overlooking bird feeders - with more information on the species you might see inside. Continue along the path until a junction, with a curved stone seat opposite; turn right here. Ignore the next turning on the right, keeping on the main path (with a buzzard symbol). Soon there's a curved wooden seat on the right, engraved with poetry."
      },
      {
        "stage": 3,
        "description": "The walk continues along the excellent, dry path. When a seat is reached it is possible to make a short detour to the left to visit a woodland pond - a great place for dragonfly. Back on the main path, continue to reach and cross a large wooden bridge. Beyond this the path leads through some silver birches."
      },
      {
        "stage": 4,
        "description": "The path then emerges at a track. Bear right here to continue on a footpath, soon climbing a long flight of steps. There are great views of the eastern scree-girt peaks of Beinn Eighe ahead, and Slioch behind. The path soon reaches a junction; turn right, ignoring the lesser path straight ahead. Soon you will reach an elaborately built seat at the highest point on the trail."
      },
      {
        "stage": 5,
        "description": "From here, the trail continues downhill, with fine views of Slioch ahead, to emerge briefly on the outward route. Turn left here, then turn right at the next junction for a different route back to the start."
      },
      {
        "stage": 6,
        "description": "The car park is just a short distance further on, past a fine stone sculpture of a pine cone. If you've enjoyed this walk, consider also doing the Woodland Trail just a short distance north up the A832, which has much older pinewoods."
      }
    ],
    "scraped_at": 1756310850.4018145
  },
  {
    "title": "Cuaig Beach",
    "summary": "This short walk to a little visited but beautiful sandy beach. The walk is best done around low tide as the sands are covered when the sea comes in.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Cuaig.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 1.0,
    "ascent_m": 40,
    "start_grid_ref": "NG706578",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park on the inland side of the road where it is widened, just east of Cuaig bridge. The walk begins by heading west along the road and across the bridge. Around 80m after the bridge turn right to head through a gate. The path beyond is good at first but becomes boggy; soon it passes through a gap in a fence, keeping to the top of the bank above the burn at first."
      },
      {
        "stage": 2,
        "description": "Slowly the path slopes down to reach the river bank and becomes very boggy, passing through another gate. Ahead on this side of the river, the bank has been built up as part of the construction of an old salmon fishing station. Cross the river using the large stepping stones."
      },
      {
        "stage": 3,
        "description": "On the other side, turn left to head towards the beach. It is easiest to keep just to the right of the old stone walls and boat nousts before heading across to the sands where there are fewest boulders. If the tide is half in you'll need to scramble over rocks to reach the beach - which is completely submerged at high tide. The beach here has wonderful fine sands at low tide and is very infrequently visited."
      },
      {
        "stage": 4,
        "description": "The return is the same way."
      }
    ],
    "scraped_at": 1756310852.983593
  },
  {
    "title": "Laide Wood, near Aultbea",
    "summary": "This short and easy walk leads through a former commercial plantation, now run as a community woodland with broadleaf species being planted. It visits two forest lochs and a cascading burn, and is very popular with local dog-walkers.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/laide-wood.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 45.0,
    "ascent_m": 25,
    "start_grid_ref": "NG894907",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "The car park for Laide Wood is well signed from the A832 south of Laide. Planted by the Forestry Commission from 1963 - 1967, the forest was aquired by a community charity in 2003. Since then a series of paths have been laid out between the original lodgepole pines and the newer native trees. Begin the walk from the far end of the car park where there is a noticeboard and a picnic table."
      },
      {
        "stage": 2,
        "description": "On a good day the mountains visible include the tent-shaped Beinn Ghobhlach as well as pinnacled An Teallach.  Follow the path as it heads downhill through a felled area to pass between two blocks of trees. The path crosses a small bridge and then follows a burn, the banks of which are decked with primroses in the spring. The path then turns to the right, crossing the burn by another bridge near a bench."
      },
      {
        "stage": 3,
        "description": "Continue, crossing yet another burn, to reach a path junction. Turn left here to begin a short detour loop to visit Loch na Creige, which is reached at an angled path junction by a wildlife hide. Continue ahead here, crossing a footbridge and ignoring a new path off to the left. The trail eventually reaches the burn feeding the loch, with a cascade on the left and a bench overlooking the water to the right."
      },
      {
        "stage": 4,
        "description": "Retrace your steps to the hide and this time take the left fork. This path winds through the trees for some distance before eventually emerging by Loch na Cathrach Duibhe. Continue along the path until it reaches a t-junction with the main trail. Turn left here."
      },
      {
        "stage": 5,
        "description": "The route passes more picnic tables and climbs from the loch.The habitat is being improved by the planting of varied species by volunteers; look out for moorhens, mallard or herons using the loch and for woodpeckers and treecreepers amongst the trees. Continue on the main path which eventually leads back up to the car park."
      }
    ],
    "scraped_at": 1756310855.5765748
  },
  {
    "title": "Gruinard Bay and the Eas Dubh falls",
    "summary": "This short walk combines a visit to a beautiful sandy beach with a brief but rough hike up a beautiful glen to reach an attractive waterfall.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/gruinardbay.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 90,
    "start_grid_ref": "NG952899",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Gruinard Bay ranks amongst the finest sandy bays in this part of the Highlands - a beautiful sweep of golden sand, especially at low tide; it is seen particularly well from an elevated layby a short distance west along the main road. The walk itself begins from the car park east of the river near Little Gruinard."
      },
      {
        "stage": 2,
        "description": "Cross over the road and go down the wooden broadwalk to reach the sands of Gruinard beach.  Turn left along the beach; before reaching the river, look out for a path leading back up the dunes - this leads back to the road at a pedestrian gate."
      },
      {
        "stage": 3,
        "description": "Turn right along the road (care - it can be busy) for a short distance before turning left through the gate just before the bridge. The path - initially more of a muddy ATV track - swings left to avoid the gorse bushes, but it's worth detouring for a look upriver first."
      },
      {
        "stage": 4,
        "description": "Back on the muddy track, this soon becomes an indistinct path - follow the clearest trod past the area of gorse bushes, eventually losing a little height. The path becomes clearer as it runs along a short distance above the river, and eventually it runs beside the water itself."
      },
      {
        "stage": 5,
        "description": "After about a kilometre and a half the path reaches a viewpoint for the Eas Dubh a Ghlinne Ghaibh, a fine and very attractive waterfall. The path does continue further upstream but runs across a steep slope above a gorge, and it isn't really possible to make a circular walk, so it is probably better to return the same way. Rather than head back across the beach, it is possible to shortcut from near the end of the glen section to head more directly down to a stile giving access to the car park."
      }
    ],
    "scraped_at": 1756310858.1787775
  },
  {
    "title": "Gairloch Beach and Pier",
    "summary": "This short but varied walk takes in the stunning Gaineamh Mhòr beach of Gairloch before climbing across to the pier at Charlestown. The return walk is via the Flowerdale Arboretum.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/gairloch-beach.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.0,
    "ascent_m": 85,
    "start_grid_ref": "NG806756",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Begin from the large public car park by Gairloch golf club. From here a wooden walkway slopes down towards the beach; at one point it forks - the left branch continues through the dunes but unless the tide is very high, continue ahead down to the golden sand. The beach, known as Gaineamh Mhòr in Gaelic, is truly stunning, all the better for being between the two built up parts of Gairloch (Charlestown and Strath) and thus backed by the verdant green of the golf course and hills."
      },
      {
        "stage": 2,
        "description": "Turn left and cross the sands to the far end of the beach where a clear path climbs up. The dune path rejoins from the left here beside a buoy; instead head slightly to the right and then left, as indicated 'To the Pier' on a wooden signpost. Before taking the path it is worth exploring the tiny An Dùn headland on the right - the name being an indicator that this was once the site of an ancient fort. Contininuing the walk, the excellent path climbs south above a rocky bay before passing through native woodland via a wooden walkway. Another signpost then indicates where to turn left (counter intuitively!) and climb across the moorland above the beach. There are stunning views over the sands to the Strath part of Gairloch."
      },
      {
        "stage": 3,
        "description": "After passing a bench the path becomes rocky as it curves round to the right, with magnificent views to the mountains, dominated by the great square block of Baosbhein. The path soon begins to descend beside a fence as the buildings of Charlestown and the pier come into view below. Another signpost indicates where to turn right down the steps to emerge on the road beside the chandlery. Charlestown has both a cafe and a shop; the walk continues by turning left along the road."
      },
      {
        "stage": 4,
        "description": "Cross directly over the main A832 road to reach a parking area opposite the Old Inn (see Gairloch hotels for details). Do not cross the bridge but instead take the 'Flowerdale' path that continues parallel to a track. This soon passes a pond with a beautiful view up the Flowerdale Glen."
      },
      {
        "stage": 5,
        "description": "Look out for a wooden signpost that indicates a left turn for the 'Flowerdale Arboretum circuit', which continues directly across the track. This ascends slightly and is marked by green spots on posts; turn left at the next two path junctions. Now continue on the main path as it winds up to the top of the Ord na h-Eaglaise. A bench provides an opportunity for a break with a great outlook over the golf course to the sea beyond. Continuing, the path now descends gradually through the fine woodland, decorated with rhododendrons."
      },
      {
        "stage": 6,
        "description": "At the bottom of the slope again keep to the main path as it swings back to the left before heading right across a small wooden bridge and pass along the edge of the woodland. Cross the flat valley floor and climb slightly up into the trees on the far side to reach a clear path at a t-junction. The waymarkers head back to the right, across a bridge, to return to the Flowerdale Glen here. Our walk instead turns to the left and continues to contour the slope through the woods. Once level with a cemetery follow the path as it turns down to the left and across the back of the cemetery. At the far end turn right onto a broad lane that leads back to the main road immediately opposite the car park and the start. Before leaving the area, be sure to enjoy the view of the beach from the viewpoint a short distance north along the road."
      }
    ],
    "scraped_at": 1756310860.8094175
  },
  {
    "title": "Applecross and Milltown circuit",
    "summary": "This circuit around Applecross explores the nearby woods, crofts and loch all providing havens for wildlife. The route also visits a broch, a reconstructed round house and some historic barns. The return route has good sea views;  this short walk should leave plenty of time to explore the shore and visit the renowned Inn.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/milton-applecross.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.75,
    "estimated_hours": 1.0,
    "ascent_m": 75,
    "start_grid_ref": "NG711445",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the Applecross village car park where there are community-run toilets. From here walk up to the road, turn left to pass between the petrol pump and a coffee shop, and then turn right up the hill out of Applecross (along the Bealach road). After a short distance branch off along the clear path to the right and head steeply uphill through trees. Once past the houses the path emerges onto the drive to the farm and campsite."
      },
      {
        "stage": 2,
        "description": "Turn right along the track, then fork slightly left at a track junction past the old farm buildings - ignoring the campsite off to the right. Go through a gate - with a footpath sign for Càrnach and Torgarve. Immediately through the gate and before the barns a short detour to the right leads up to Applecross broch overlooking the campsite - this archaeological site has been excavated in recent years."
      },
      {
        "stage": 3,
        "description": "Return to the track and continue to the right. The two beautiful barn buildings on the right have been restored, and the nearer contains intepretation. Known as Hebridean ventilated barns - a type found only in Wester Ross - they date from the 18th century and were used for drying crops, winnowing and making sileage. There's a signed path between the two barns  - a short detour to visit a reconstructed ancient thatched round house. After visting this, return to the track once again and follow it to the right through another gate. It leads through some lovely old woodland of hazel and a fine pines before passing through another gate."
      },
      {
        "stage": 4,
        "description": "This area is being regenerated as community woodland. Our route ignores the archaeological trail turning off to the right (it visits some ruined houses on a loop if you wish to take it). The main route passes a wooden cabin, and then the archaeological trail joins back in from the left and leaves on the right. Keep ahead on the main path; the route now continues downhill towards a cottage, Torgarve House. There are great views to Skye and Raasay. Go through the gate and pass in front of the cottage and continue on the clear path across the croftland towards Loch a' Mhuillin."
      },
      {
        "stage": 5,
        "description": "Here in winter you may see whooper swans and otters are occasionally spotted here all year round. The path emerges onto a track just before the loch, turn right here to pass in front of Lochend Cottage and through another gate, continuing by the loch heading back towards the village. At the end of the Loch go through the gate onto the main road at the start of the houses making up Milltown."
      },
      {
        "stage": 6,
        "description": "Turn left then immediately right to follow the small loop road through the houses and past the fishing sheds and slipway - it's worth detouring onto this for a lovely view to Applecross village. Re-emerge onto the main road and turn left, then look for a sign indicating a footpath up through the woods on the right. Take this turn up to the right and climb steeply for a short section until the path levels off."
      },
      {
        "stage": 7,
        "description": "Go through a gate and then follow the path to the left, keeping right of a house to emerge through a gap immediately left of some agricultural buildings. From here go through a gate into the campsite, and follow the campsite track as it curves right. Continue round to the right on the track, passing the reception building until it rejoins the outward route. Turn left here to head down the campsite entrance track back to the road, retracing your steps back to the car park at the start. The famous Applecross Inn is a short distance further along the road."
      }
    ],
    "scraped_at": 1756310863.3928964
  },
  {
    "title": "Applecross House and Walled Garden circuit",
    "summary": "This straightforward walk combines woodland, riverside, and seafront as it passes through the grounds of Applecross House. The walk begins and ends at the beautiful Walled Garden which has a cafe / restaurant. Many variations are possible as there is a wide range of signed paths across the estate.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Applecrosshouse.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.1,
    "estimated_hours": 1.5,
    "ascent_m": 60,
    "start_grid_ref": "NG719455",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the car park at the Applecross Walled Garden - which is signed from the public road. The garden itself is a beautiful place to visit - and at the far end is an excellent cafe and restaurant. Begin the walk from the walled garden entrance adjacent to the car park, go through the wooden gate and turn right to head alongside the outer wall of the garden - signed for the Tree House. The path curves left round the far end of the garden. Pass to the left of the greenhouse and then fork right, passing the potting shed."
      },
      {
        "stage": 2,
        "description": "The path now crosses a wooden bridge to reach the Tree House on the far side; turn left once across the bridge. Soon the path leads through a gate. Bear right after the gate, ignoring a footbridge to the left, and continue uphill to reach a broad track through a gap in a drystone wall. Turn right along the track, keeping right when the main track continues ahead. The track narrows and continues ahead with deciduous woodland on the left. Continue until a footpath sign indicates the Roe's Walk path heading left into the trees - take this turning."
      },
      {
        "stage": 3,
        "description": "Soon the trees thin and the path runs through an area of regenerating woodland and gorse - a tower off to the left gives an elevated viewpoint. Continue through a wooden gate and then follow the path as it descends to the river. At the river turn sharp left to follow the path that leads downstream. Pass through a gate and continue downstream."
      },
      {
        "stage": 4,
        "description": "Eventually the track curves left away from the river - leave it to follow the narrower path that keeps beside the water. This leads to a tarred track which crosses on a bridge - ignore the track (and bridge) and stay on the signed River Walk that continues opposite. This passes through some fine mature woodland along a very attractive stretch of riverbank."
      },
      {
        "stage": 5,
        "description": "Eventually some steps lead up to the coastal road beside a bridge. Turn left to walk carefully along the road, giving fine views across the bay and to Applecross village. Continue along the road for around 650m until the signed turning for the Walled Garden on the left - turn left up this."
      },
      {
        "stage": 6,
        "description": "Ignore the Beechwood Trail off to the right (that links with Applecross village) and follow the tarred lane until a track leaves on the right. Turn right onto the track, but ignore the 'Lost Path' up to the right. Further on take a signed path on the left ('Arboretum Walk and Walled Garden'). The path heads through woodland and a couple of gates to eventually reach a signed crossroads of paths. Turn left here to return to the Walled Garden car park. There are views towards the private Applecross House from the entrance."
      }
    ],
    "scraped_at": 1756310865.9805245
  },
  {
    "title": "Flowerdale Glen, Gairloch",
    "summary": "A delightful waymarked walk up a sheltered glen to an attractive waterfall. The Flowerdale Glen was given its English name by the MacKenzies of Gairloch (the owners of the estate) after its impressive displays of wild flowers.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Flowerdale.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.75,
    "estimated_hours": 2.0,
    "ascent_m": 156,
    "start_grid_ref": "NG811753",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Turn off the main road in Gairloch into a car park opposite the turning for the harbour. The fine Old Inn is situated just across the old bridge over the river here.  Don't cross the bridge, instead taking the path that runs to the right of and parallel to a track, heading up the glen. The path passes a pond with many varied trees and rhododendrons. Ignore the signed route off to the left ('Arboretum Circular') instead keeping straight on, signed 'Waterfall Walk'."
      },
      {
        "stage": 2,
        "description": "You'll soon glimpse Flowerdale House over to the left, seat of the Mackenzies since 1738; the house remains a private residence so please respect the privacy screens. Keep on the path as it curves right, then turn left at the next junction (again signed 'Waterfall Walk'). The path crosses a bridge and boardwalk, and then another bridge. Beyond this follow the main path upriver - with lovely bluebells in summer - to reach a track at a 'T' junction. You'll return to this point later; turn left now, cross a bridge over the main river and then turn right, still signed for the waterfall. The path passes a hydroelectric station and then meets a main track - bear right along this."
      },
      {
        "stage": 3,
        "description": "Keep straight on at the utility area (ignore the track over the bridge to the righ - you'll come back across this later). Later bear right off the track onto a signed path. You'll now see glimpses the Flowerdale Waterfalls ahead, actually two falls known as the Eas Dubh and the Easan Bana. Cross a bridge to approach the falls. Although not particularly high or big by Highland standards, and hard to see with the trees, it's an attractive spot. There are two options for the ascent near the falls - a newer broad path/track on the left, or the narrower but rougher original path that keeps closer to the falls. Above the falls the routes rejoin; the glen is barer and the path soon reaches another bridge. Cross this and follow the well made path back down the far side of the stream."
      },
      {
        "stage": 4,
        "description": "There's a really beautiful view back down the Flowerdale Glen to the sea and islands beyond. The route crosses a bridge and then reaches a track at a 'T' junction - note the memorial on the left to the Blind Piper of Gairloch. Turn right to follow the track to a bridge, crossing and then rejoining the outward route at the wide turning area. Turn left here to retrace your steps back towards the start."
      },
      {
        "stage": 5,
        "description": "Keep retracing steps - forking left off the track onto the path past the hydro, and left over the bridge. At the next junction the outward route came in on the path on the right - ignore this and instead keep ahead, signed for Cherry Tree Hill."
      },
      {
        "stage": 6,
        "description": "Soon another junction is reached; keep right here, now following apath which was until the nineteenth century the main road to Gairloch from the south. Further on, keep left on the main path at a fork. It soon leads to some old commercial buildings; continue to reach the back of the Old Inn. Pass round the front of the Inn (if not going in for a drink!) and cross the old bridge back to the car park."
      }
    ],
    "scraped_at": 1756310868.571451
  },
  {
    "title": "Lochcarron Coffin Road circuit",
    "summary": "This circuit follows the line of the old coffin and drove road from Kirkton, before descending to Lochcarron and returning along the shore road.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/lochcarron-coffin-road.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 5.0,
    "estimated_hours": 1.5,
    "ascent_m": 116,
    "start_grid_ref": "NG914412",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the public car park at the Golf Club at Kirkton at the eastern extremity of Lochcarron - there is a cafe here. The route starts on the opposite side of the road up a track - signed for Kishorn Road via Kirkton Wood. It follows the route of an old coffin road (linking Kishorn to Kirkton burial ground) and a drove road for bringing cattle over from Applecross to a local market held here."
      },
      {
        "stage": 2,
        "description": "When the track reaches a gate and cottage, do not pass through - instead following the marker indicating the route diverting to the right uphill, then left, passing above the cottage before descending left again to a footbridge. Cross and go through the gate opposite. The route now follows a rough path, soon bearing right to head along a low bank through the scattered birch trees. The route is marked with scallop shell markers. Ignore a path off left (a detour to the remains of the cleared settlement of Kirkton), instead continuing along the ATV track through the trees and gorse. Good views begin to open up over Loch Carron."
      },
      {
        "stage": 3,
        "description": "The route curves left at a stand of old pines, and then continues by a long line of birches. Eventually a gate is reached leading onto the open moorland."
      },
      {
        "stage": 4,
        "description": "Continue across the moor until a clearer path is reached at a t-junction. The old drove and coffin route to Kishorn turns right here, but our circular walk turns left to begin heading back towards Lochcarron. When the path forks, take the right branch, towards a stand of conifers."
      },
      {
        "stage": 5,
        "description": "After passing the trees the route continues as a grassy track, with views over Loch Carron ahead. Further down, the route passes through two gates and continues to reach Croft Road. Take the footpath almost opposite which cuts right down to the main road in Lochcarron."
      },
      {
        "stage": 6,
        "description": "The village shop is just to the right, but our route turns left along Lochcarron's seafront. When the lochside pavement ends there's a pavement on the opposite side, but eventually you need to continue along the grass verge to return to Kirkton and the start, passing the original Kirkton burial ground."
      }
    ],
    "scraped_at": 1756310871.153177
  },
  {
    "title": "Torridon village walk, Torridon",
    "summary": "This route combines two walks from the edge of Torridon village. The first heads past a deer farm to reach a hide and a beautiful stretch close by the shore of Loch Torridon, visiting the site of an open air church. It then joins the road at Fasag (shop/cafe) from where the second walk takes a path keeping above the road and loch to visit the site of a ruined township. The return is back along the minor road through the village.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/torridon-village.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 6.1,
    "estimated_hours": 2.0,
    "ascent_m": 32,
    "start_grid_ref": "NG905557",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Begin from the National Trust for Scotland's Torridon Countryside centre, which is on the left immediately after turning in towards Torridon village from the A896 road. The centre gives information about the Torridon Estate, regarded by many as amongst the most beautiful parts of the Highlands. Begin the walk by heading along the tarred track from the centre, ignoring another track which forks off left."
      },
      {
        "stage": 2,
        "description": "The track passes through a gate and, after 500m, reaches a fine whitewashed house. Part of this houses the Deer Museum, where you can learn about Scotland's red deer. The paddock on the left is part of a deer farm and you can usually see both stags and hinds at close quarters through the fence."
      },
      {
        "stage": 3,
        "description": "At the far corner of the paddock there is a detour path turning left along the line of the fence to reach a wildlife hide. This overlooks a marshy area at the head of the loch and is a good spot to watch for oystercatches, ringed plovers, sandpipers and other birds. After visiting the hide retrace your steps to the paddock corner."
      },
      {
        "stage": 4,
        "description": "Turn left to rejoin the original track, continuing to the left of the white buidling and house. From the parking area bear right to pick up a path between two fences. This now runs between the paddocks below Torridon village on the right, and the loch shore on the left. Eventually it passes through a gate and then continues as a grassy path just above the shore. This is a beautiful spot."
      },
      {
        "stage": 5,
        "description": "The path continues by the shore, eventually crossing a footbridge and passing through a gate. A little further on a signpost indicates the detour to Am Ploc to visit the open air church. Turn left as indicated, then left again at a track, then left once more onto a path, passing a ruin. The path leads to the Am Ploc open air church, with stone seats and a rock pulpit. The church was used after the Free Church broke from the main Church of Scotland during the Great Disruption of 1843, giving the church control over the selection of ministers. With no buildings, the Free Church initially operated from sites such as this. Occasional services were still held here as recently as the 1980s."
      },
      {
        "stage": 6,
        "description": "Retrace your steps back to the track, then turn right to follow it to reach the main road at Fasag (the shop almost opposite also has a cafe). From here you could turn right to walk back along the road through the village to the start. To include instead the rougher path that visits the old township, turn left along the road instead. Continue until the jetty, and then almost opposite it take a signed path off to the right, beginning by the national speed limit sign - once on the path it is very clear to follow. It runs parallel to but at a higher level than the road. Look out for the tumbledown ruins of the old houses some distance along."
      },
      {
        "stage": 7,
        "description": "Eventually the path becomes a little rougher and heads into birchwoods. At a junction (with only a minor path ahead) turn left to descend some rough stone steps, soon heading down to the road. Turn left at this point to head all the way back - through Torridon village - to return to the start. The road is usually quiet but still take care with traffic. It passes the cafe, school, village hall and youth hostel before eventually reaching the NTS Countryside Centre."
      }
    ],
    "scraped_at": 1756310873.7421699
  },
  {
    "title": "Coral Beaches, near Culduie",
    "summary": "Driving south from Applecross to Toscaig, there is parking at the junction with the minor road which turns to the right for Àrd-Dhubh. Walk along the Àrd-Dhubh road for a short distance until a footpath sign on the left. Follow the wide, well made footpath across the moor. It passes through some attractive birchwoods as it rounds a stream.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Coralbeach.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 6.3,
    "estimated_hours": 2.0,
    "ascent_m": 210,
    "start_grid_ref": "NG713398",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Driving south from Applecross to Toscaig, there is parking at the junction with the minor road which turns to the right for Àrd-Dhubh. Walk along the Àrd-Dhubh road for a short distance until a footpath sign on the left. Follow the wide, well made footpath across the moor. It passes through some attractive birchwoods as it rounds a stream."
      },
      {
        "stage": 2,
        "description": "Beyond, the path reaches a signposted junction; each branch leads to a different coral beach. Take the right hand branch first, signed for 'Àrd Ban'. This path soon reaches a picturesque section where it is built up alongside the Poll Domhain bay."
      },
      {
        "stage": 3,
        "description": "Further on it bends left to reach Àrd Ban, a collection of three old cottages by a coral beach. The white 'coral' sand is not true coral; it is in fact maerl or calcified seaweed; nonetheless it is fascinating to examine, and this is a beautiful spot."
      },
      {
        "stage": 4,
        "description": "Return to the signpost. Reaching the other beach is a little muddy, so you could just return from here; otherwise, turn right."
      },
      {
        "stage": 5,
        "description": "The path passes through another birchwood and approaches some isolated houses. A couple of shortcut paths head off right but it's best to continue until almost at the houses before turning right at a sign ('Coral beach') to follow a faint boggy path to the beach, which is covered at high tide but when the tide is out is even more attractive than Àrd Ban. Back on the path, you can also explore the bay around some abandoned and some renovated cottages, before returning back to the start."
      }
    ],
    "scraped_at": 1756310876.3332055
  },
  {
    "title": "Sand River circuit, Big Sand",
    "summary": "The seemingly bleak moorlands north of the Sand River, like many in the Highlands, harbour the remains of centuries of human activities. This constructed circular trail heads through these empty moors.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/sand-river.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 6.5,
    "estimated_hours": 1.5,
    "ascent_m": 125,
    "start_grid_ref": "NG761790",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "This newly constructed walk replaces the earlier archaeological trail which started further north. Park on the grass verge at the start of the track on the right marked \"Sand Farm Hill Access\"; take care not to cause an obstruction. The walk begins by heading through the gate and following the track to a levelled area. Here turn left onto a clearly constructed footpath."
      },
      {
        "stage": 2,
        "description": "The path cuts across the moorland, soon coming parallel to but remaining above the Sand River. Eventually it descends and crosses the river via a bridge. The ruin visable over to the left was the schoolmaster's barn, dating from around 1876; the schoolmaster lived in a cottage on the other side of the road."
      },
      {
        "stage": 3,
        "description": "The route now climbs a little before contouring the slope to the north of the Sand River. The scattered stone ruins seen include old dykes and, more clearly, hut circles and a field system on this side of the river."
      },
      {
        "stage": 4,
        "description": "The trail leads across another bridge over one of the tributaries, and passes through a gate. The area is grazed by both cattle and sheep, so ensure to keep any dogs under very tight control. After another bridge the route passes over the almost imperceptable hillock of Druim Liath, and then meets a wider track."
      },
      {
        "stage": 5,
        "description": "Turn right along this track for the return walk back to the start. One the final descent are views over Longa Island to the distant Trotternish Ridge on the Isle of Skye. The track eventually leads back to the road at the start point."
      }
    ],
    "scraped_at": 1756310878.9301872
  },
  {
    "title": "Sand to Applecross Bay",
    "summary": "An easy linear walk between the beautiful sandy bays at Sand to the more pebbly Applecross Bay with great views over to Raasay, Skye and Rona. The walk can be done in either direction or as a return walk - the time and distance given are for one way.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Sandapplecross.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 7.0,
    "estimated_hours": 2.0,
    "ascent_m": 183,
    "start_grid_ref": "NG684493",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the car park at Sand on the road that leads to the Ministry of Defence submarine testing station. From the car park it is well worth visiting Sand Beach before starting the walk proper. To do so follow the track until a path heading off to the left, and follow this down to the beach. At the far right edge of the bay is a stone building that was used by Monty Halls in his beachcomber series on TV."
      },
      {
        "stage": 2,
        "description": "Walk back to the main road and cross the road to take a clear path opposite signed for Cruarg. The path leads south uphill on a gentle gradient. There are fine views out over the beach and the Inner Sound to the islands of Raasay and Skye beyond."
      },
      {
        "stage": 3,
        "description": "Continue along the wide path, crossing a small stream on a wooden footbridge, and then becoming less steep as the path contours around the hillside. The road below is lost from sight and you can imagine this part of Applecross before the road was built in the 1960s when this path and the sea would have been the only communication routes."
      },
      {
        "stage": 4,
        "description": "The path crosses a pretty stone and wood bridge and levels off before rounding the bend to approach Applecross Bay. There are remains of hut circles and sheilings on this part of the hillside but little is visible today from the path. The route passes through the remains of a metal kissing gate, the surrounding fence long gone. On a clear day the Cuillin mountains on Skye are visible and the dramatic conical peak of Glamaig to the right of them."
      },
      {
        "stage": 5,
        "description": "Soon the houses of Applecross come into view on the opposite side of the bay. Continue on the path as it narrows and begins the descent to the road. This is the steepest section of the walk but is still well graded. When a signpost is reached a path downhill to the right shortcuts the walk down to a car park at Cruarg. Otherwise continue on the upgraded path ahead."
      },
      {
        "stage": 6,
        "description": "The path comes close to the road before diverging again. Eventually another path junction is reached - turn right here to follow the path down to the Applecross Heritage Centre, which is well worth a visit. To reach the car park at the end of the walk turn right along the nearside of the Heritage Centre."
      }
    ],
    "scraped_at": 1756310881.5581129
  },
  {
    "title": "Gynack Mill Trail, Kingussie",
    "summary": "This short, easy walk follows the Gynack Burn to explore the history of Kingussie. It can be linked to the Creag Bheag and Tom Baraidh route to make a much longer walk.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/gynack-mill.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.3,
    "estimated_hours": 1.0,
    "ascent_m": 50,
    "start_grid_ref": "NH755007",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a large free car park just behind the Duke of Gordon Hotel in the centre of Kingussie, off Gynack Road, where there are also toilets and information about the local path network. From here return to the road and turn left to head uphill following the sign for the Gynack Mill Trail. Soon another green sign is reached, follow the steps down to the right to reach the Gynack Burn. This burn was at the heart of the Fourth Duke of Gordon's plans to build a new town at Kingussie. The water did power a number of mills producing flax, flour and wool, however Kingussie did not develop into the industrial powerhouse the Duke had envisaged, becoming instead, a popular tourist town once the railway arrived in 1863."
      },
      {
        "stage": 2,
        "description": "Across the burn you can see one of the mills, now converted to housing. Continue to cross the footbridge. There is an interpretation board with more information about the history of Kingussie. Pass this, keeping on the main path ahead. Pass a viewing platform on the left where the remains of one of several dams built to control the water flow can be seen. The writer, Robert Louis Stevenson, author of Treasure Island and many more popular books, spent his holidays in Kingussie in the 1880's and he loved to sail paper boats on the burn. Keep on the path and head uphill through the trees."
      },
      {
        "stage": 3,
        "description": "When the path forks, keep on the main path heading straight ahead.  At a T junction turn left and follow the path upstream, a little way from the burn now. The path soon bends to the right between wire fences, with newly built houses on the left. When the road is reached turn left. After the last house on the left turn left at a green signpost, passing a stone cairn and heading down steps to the river."
      },
      {
        "stage": 4,
        "description": "Cross the bridge and bear left on the other side, passing an information board and then turning left onto the road to head downhill. The road passes the St Vincent Hospital on the right and soon reaches the green signed path heading down to the river on the left. Take this path for the second time and cross the bridge. Here keep straight ahead following a smaller path alongside the fence to go up a flight of steps. At the top turn right through the gate onto a track, Boa Vista Road, to pass a number of lovely houses overlooking Kingussie. When a road junction is reached turn right to head downhill towards the town. Further down there are good views over the cemetery to Creag Bheag."
      },
      {
        "stage": 5,
        "description": "When you see a clock tower on the left, head towards it for a few paces then visit the information board on the right showing an old map of the town from the viewpoint. Return to the main road and continue down to reach the High Street. Go straight across at the traffic lights and follow King Street until the T junction where you turn right along Spey Street. Here the old Post Office building can be seen on the left."
      },
      {
        "stage": 6,
        "description": "Cross the bridge over the Gynack Burn and then turn right into the park. Walk through the formal gardens, passing the war memorial, with the imposing Duke of Gordon Hotel ahead. Once out of the park cross the road and head up Gynack Road to return to the car park at the start of the walk."
      }
    ],
    "scraped_at": 1756310884.151846
  },
  {
    "title": "Riverside Walk, Kincraig",
    "summary": "A beautiful out-and-back walk along a high bank above the River Spey with good views of the Cairngorms and passing through lovely woodland.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/kincraig.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.7,
    "estimated_hours": 1.0,
    "ascent_m": 20,
    "start_grid_ref": "NH833056",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a small parking area just down from The Old Post Office Cafe in the centre of Kincraig, next to the phone box. From here head back up the road past the stores and turn right along Speybank Walk. After passing some fine houses the route becomes a track up through the woods. When the track bends left keep straight ahead onto a narrow path through the trees, signed Speybank Walk."
      },
      {
        "stage": 2,
        "description": "The route runs parallel to a winding new surfaced section of the Speyside Way path which is set back further from the high bank above the river; the two routes meet at several points. Keep straight on when a path joins from the right, and keep right when a fainter path forks off to the left. The Speyside Way path is joined for a section of boardwalk; beyond this leave it again by climbing up a steep bank to reach the top of the ridge overlooking the river."
      },
      {
        "stage": 3,
        "description": "The Spey is wide here and there are good views down to it at times as well as across the strath to the Cairngorm mountains. Continue along the path, passing a bench (link path to the Speyside Way goes off left here) and a gate, and a mixture of birch and oak trees with a thick carpet of heather and blaeberries underneath. The riverbank can be very steep in places so care is needed with young children."
      },
      {
        "stage": 4,
        "description": "After a short section of fencing, an old marker stone with a cross carved on it is passed. Keep following the path until eventually a small clearing with a wooden bench is reached. This is a good viewpoint and a lovely spot for a break."
      },
      {
        "stage": 5,
        "description": "Beyond the bench the path rejoins the Speyside Way. Either turn round to begin the walk back by the same outward path, or instead turn left to follow the Speyside Way back. Once back at Kincraig it is worth exploring the long bridge over the River Spey at the north end of Loch Insh. The bridge was built in 1874 before which a ferry boat ran across the same stretch of water, which lead to the original name of the village which was Boat of Insh."
      }
    ],
    "scraped_at": 1756310886.739751
  },
  {
    "title": "Nethy Bridge riverside and Dell woods",
    "summary": "This is a walk of two halves, the first alongside the burbling River Nethy and then through beautiful Dell Woods (a National Nature Reserve) to return to Nethy Bridge. An easy short walk on good, waymarked paths, with plenty of variety and the option to extend the walk.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/nethybridge.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 30,
    "start_grid_ref": "NJ001205",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start at Nethy Bridge Community Centre (just up from the shop) where there is parking and toilets. Start the walk by taking the riverside path opposite the community centre. The path drops down to the river and follows it upstream. In the past, timber has, and still does to some extent, play a major part in the local economy. This river was used to transport felled trees to the River Spey and on to the sea at Spey Bay. Dams and sluices further up allowed water to build up which when released would float hundreds of tree trunks downstream.  After a short while the all-abilities path turns right but our route continues straight ahead following the river bank."
      },
      {
        "stage": 2,
        "description": "Near a house the path joins a minor road. Turn left and continue until the pretty, green bridge is reached. Don't cross the bridge but continue along the road. Follow the road as it turns sharp right and passes between houses. At the junction cross the road and follow the path straight ahead through the two sets of beech hedging."
      },
      {
        "stage": 3,
        "description": "The two large Wellingtonia (giant redwoods) trees and the beech hedges mark the entrance to what used to be the tree nursery established in 1855 to raise pine seedlings for replanting the forest. Today natural regeneration techniques are favoured and the nursery closed in 1984. Continue straight ahead at a small crossroads of paths and keep ahead at the end of the hedges following the blue and green arrows. Turn right at the next junction through a lovely area of mixed pine wood."
      },
      {
        "stage": 4,
        "description": "As the path nears the corner of a large white house turn left following the arrowed signs and continue through the pine forest. Eventually the path runs near the back of a number of houses. Ignore the path right towards the houses here instead bear left further into the wood. After winding through the trees, a field is seen on the right and a path junction with a picnic table reached. Our route continues onto the wider track ahead but you can extend the walk by a couple of miles by following the loop of the green waymarked 'Puggy line trail' which follows the line of an old railway on the left. Otherwise continue ahead until the track emerges from the wood onto a road. Turn right and follow the road, keeping straight on past houses back to the centre of Nethy Bridge. At the road junction turn left to return to the community centre."
      }
    ],
    "scraped_at": 1756310889.3219929
  },
  {
    "title": "River Spey & old railway, by Grantown-on-Spey",
    "summary": "This short walk follows the Speyside Way along the old railway line near Grantown on Spey before returning on a rougher path right beside the Spey. Views of woodland, farmland, distant hills and the beautiful River Spey.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/river-spey-grantown.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 45.0,
    "ascent_m": 23,
    "start_grid_ref": "NJ035262",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the informal parking layby opposite the old smokehouse building on the right just after the turn off for Nethy Bridge (B970) from the A95 south of Grantown on Spey; do not obstruct access for farm vehicles to the field. If full you can usually find more parking on nearby Achnagonalin industrial estate (home to an excellent cafe/bakery and pizzeria). If walking from Grantown either take A939 (or the old military road through the woods) and cross the Spey Bridge and take the 2nd right off the A95. Start by crossing the B970 and taking the Speyside Way path on the left hand side of the entrance to the industrial building ahead. This heads round the back of the building, through a gate and up a ramp onto the old railway line."
      },
      {
        "stage": 2,
        "description": "The Speyside Line railway ran closed in 1968 and became part of the Speyside Way long distance walk in 1981. The route now runs from Buckie on the Moray coast to Newtownmore mainly following the River Spey. Follow the path under a bridge and through a set of double gates and continue ahead passing through sparse birch trees."
      },
      {
        "stage": 3,
        "description": "Continue on the Speyside Way until just after a farm gate with pedestrian gate alongside and look out for a small stile on the right. Climb this and head straight down through the grass to the trees and river ahead. Bear right near the river to cross a stile and pick up the riverside path soon passing a small fishing hut. Continue ahead on the riverside path."
      },
      {
        "stage": 4,
        "description": "This section of the river is particularly popular for fly fishing, soon the path passes a large wooden seat and grill made from old horseshoes used by the fishermen. Watch out for salmon and trout leaping in the river as the path continues downstream. On the far side of the river the old cemetery at Inverallan can be seen. Pass another small fishing hut."
      },
      {
        "stage": 5,
        "description": "Continue through a wooden kissing gate as Spey Bridge comes into view. Dating from 1931 this bridge replaced a much older bridge built by General Wade in 1754 which can still be crossed on foot further downstream. Pass a third fishing hut. Don't go under the bridge but climb the tall flight of steps on the right to reach the road. Turn right at the top and follow the pavement, crossing the road entrance to Achnagonalin industrial estate and taking the next right to return to the start."
      }
    ],
    "scraped_at": 1756310891.9204524
  },
  {
    "title": "Linn of Dee circuit, Linn of Dee, near Braemar",
    "summary": "This short waymarked walk begins with a visit to the beautiful Linn of Dee, where the river cascades through a narrow chasm, topped by an old stone bridge. It then heads up the lower reaches of Glen Luibeg, passing more waterfalls and through beautiful old pinewoods.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/linn-of-dee.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 42,
    "start_grid_ref": "NO062898",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the large National Trust car park at the Linn of Dee; there is a charge. Return to the road and take the footpath - waymarked in blue and yellow - off the opposite side. This soon descends gently down steps towards the River Dee. Our blue route turns left at this path junction, but first turn right with the yellow markers to take a closer look at the Linn of Dee. Here the river thunders through a rocky chasm, spanned by the old stone road bridge."
      },
      {
        "stage": 2,
        "description": "It's worth heading up to the road bridge and crossing the road to a path on the far side to view the river just above the falls. After viewing, return to the path junction and now take the blue waymarked path that continues downriver."
      },
      {
        "stage": 3,
        "description": "The path continues downstream by the river, through the stately pinewoods. After around 350m follow the main path as it bears left and ascends a series of steps to climb up to the road. Go straight across this onto the path on the far side, which then bears right parallel to the road."
      },
      {
        "stage": 4,
        "description": "The path emerges on a track beside the River Luibeg. Turn left up the track; after 250m a blue marker indicates where to fork right onto a path that keeps the river in close view. The natural pinewoods here are simply stunning, and regenerating strongly since the National Trust for Scotland has tried to bring deer numbers down towards natural levels. The River Luibeg has some attractive cascades, and the remains of an old salmon ladder are visible at one point."
      },
      {
        "stage": 5,
        "description": "Eventually the path swings left, and there are distant views up the glen towards the cone-shaped summit of Derry Cairngorm. When the path meets a large track, turn left along it. After another 450m a signpost indicates where to turn right onto a path through the woods back to the car park. This crosses a boardwalk in an open area and climbs a few steps before reaching a fork. The left option is the shortest route back to the start."
      }
    ],
    "scraped_at": 1756310894.5085578
  },
  {
    "title": "Loch Vaa, near Aviemore",
    "summary": "Hidden away in the pinewoods just off the A95 between Aviemore and Boat of Garten, Loch Vaa is a secluded gem. This short walk makes a straightforward circuit around the loch.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/loch-vaa.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.0,
    "ascent_m": 28,
    "start_grid_ref": "NH910174",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from next to Laggantrygown Cemetery, which is just off the main A95 between Aviemore and Boat of Garten. The parking for Loch Vaa is on the left with the locked cemetery car park to the right - there is further parking in a layby towards Aviemore. Begin the walk on the clear path outside the left edge of the cemetery. This soon swings left and climbs up a wooded ridge; known as an esker, this was formed by glacial action. The path then forks; keep ahead on the main path which curves left downhill to the shores of Loch Vaa."
      },
      {
        "stage": 2,
        "description": "The loch is a beautiful and secluded place set amidst stunning pine and birchwoods, although it is only a stones throw from the busy road. Continue along the shores (depending on the water levels) to the left towards the very attractive boathouse."
      },
      {
        "stage": 3,
        "description": "Head into the woods to the left of the boathouse. Further on a track leads through the forest. Stay on the main track, ignoring a path off to the right. Eventually a (locked) gate is reached; pass to the right of this, turning right along the track beyond."
      },
      {
        "stage": 4,
        "description": "Keep along this track. Ignore a path off right, then a fainter track after 500m. After 1km from the gate, look out for another track off right that has two branch points, the second with a small boulder amidst smaller rocks at the turning. Follow this track, which leads back towards Loch Vaa."
      },
      {
        "stage": 5,
        "description": "It eventually becomes a path (with a view through the trees to the loch down to the right) - ignore the path heading steeply down to the loch, instead continuing ahead to cross a stile over a fence. Beyond this the path climbs a low wooded hill with good views over the loch."
      },
      {
        "stage": 6,
        "description": "When the narrow path forks again take the right branch which descends steeply. The path then undulates, with a final steeper climb where a fence comes alongside on your right (and the loch beyond). Continue along the fence path until a stile. Cross this and follow a path along the top of a esker until it reaches the outward route near the start. Turn left here to head back to the cemetery and car park."
      }
    ],
    "scraped_at": 1756310897.0974462
  },
  {
    "title": "Cambus o' May Pinewood trail",
    "summary": "This is the longest of three circular waymarked trails through the pinewoods at Cambus o' May. The walk offers views up Deeside, passes two attractive forest lochans and offers the chance to spot woodland wildlife.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/pinewood-trail.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.25,
    "estimated_hours": 2.0,
    "ascent_m": 50,
    "start_grid_ref": "NO403980",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is an information board in the car park giving a map of the three waymarked trails here; this route follows the longest, the Pine Trail. The route is waymarked by yellow-banded posts. All three trails begin up the path which climbs up into the trees between the posts. This first stretch of path runs along a low, birch-clad ridge and gives some views up Deeside to the left."
      },
      {
        "stage": 2,
        "description": "Down to the right is an attractive tree-fringed lochan. Ignore a path turning off to the right, instead keeping straight ahead (yellow and red markers). Further on the path reaches a track - go straight across here."
      },
      {
        "stage": 3,
        "description": "The path now runs along beneath a line of pylons before plunging back into the pinewoods. After crossing a small footbridge with a stone bridge beside it, keep straight ahead (ignoring the red route turning off to the right). Eventually the path emerges onto a track; turn right along this. Follow the track, keeping ahead at a junction where another track goes off left. When a yellow marker post is reached turn right onto a path once more."
      },
      {
        "stage": 4,
        "description": "At another junction the red route joins back in from the right; keep ahead. Bear left at another junction, crossing a wooden footbridge. Soon the route passes another attractive lochan - seen on the right. After crossing a tiny stone bridge there is a picnic table overlooking the water. Continuing the walk, turn left at the next junction and then left again onto a track. Keep ahead along the track until it approaches a barrier - turn right here onto the waymarked path which leads back to the car park."
      }
    ],
    "scraped_at": 1756310910.3434272
  },
  {
    "title": "Druim an Aird, near Laggan",
    "summary": "This walk begins by passing above the lower Pattack gorge and its waterfalls. It then follows forest tracks to reach the lonely ruins of the deserted village of Druim an Aird. It was once possible to make a circuit using the Right of Way from Dalwhinnie, but this path has been lost following forest works so the return is back the same way.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/pattack.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 97,
    "start_grid_ref": "NN567903",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "From the car park take the path heading south-east signed Forest Walks and Waterfall. Ignore the first path going off on the right and walk uphill for a short while until you reach a path junction. The viewing area for the waterfalls (not to be confused with the nearby more impressive Falls of Pattack) is just over the right here; the cascading river in its impressive gorge has been used as a location in TV's Monarch of the Glen. From the falls walk uphill along the main path (ignoring the faint path on the right next to the river)."
      },
      {
        "stage": 2,
        "description": "The path winds uphill to a waymarked junction; you can turn left here to follow a loop path through the attractive pinewoods but it can be overgrown; both routes rejoin a little further on. Follow the path as it continues down to a t-junction with a forestry track where you turn right."
      },
      {
        "stage": 3,
        "description": "Follow the wide track. When a junction is reached, turn left. There are good distant views ahead towards the Creag Meagaidh range."
      },
      {
        "stage": 4,
        "description": "At another rather industrial looking junction, turn left again. Continue along the track. Soon the remains of Druim an Aird can be seen on the right in a fenced enclosure next to an interpretation sign. It is not known for certain why the village was deserted but one local story is that the villagers left after all the menfolk died in a snowstorm returning from wedding celebrations near by."
      },
      {
        "stage": 5,
        "description": "It used to be possible to make a different return using the old right of way from Dalwhinnie, but this was not reinstated after felling work and is now very difficult to follow with brash and bog. Instead, it's best to return the way you came."
      }
    ],
    "scraped_at": 1756310912.939376
  },
  {
    "title": "Falls of Pattack",
    "summary": "The true Falls of Pattack are somewhat hidden away, but are much more impressive than the better known lower falls near the main road at Feagour. This easy out-and-back walk follows a good track until a final short path leads to the best viewpoint looking over the falls.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/falls-of-pattack.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 98,
    "start_grid_ref": "NN555899",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins up the track signed for Gallovie Farm from the A86, but there is no parking here - instead park around 70m to the east in the layby on the opposite side of the road. Return to the junction and follow the track, soon crossing a bridge over the River Pattack."
      },
      {
        "stage": 2,
        "description": "At a junction turn right to keep on the main track. The track leads past a vehicle barrier, then reaches is another junction of tracks - this time turn left, signed again for Gallovie Farm. The track winds uphill through the trees, soon passing the farmhouse and a couple of cottages. Eventually it leads on through a gate; there are blue waymarker arrows."
      },
      {
        "stage": 3,
        "description": "Look out for a pedestrian gate and sign on the left side, and leave the track to head through the gate. A path leads through dense forestry. Ignore a path off left at a junction and continue ahead. Soon the path curves left and approachs the rim of the gorge carved by the River Pattack, with a view down over the dramatic falls. Take care as the edge is unprotected."
      },
      {
        "stage": 4,
        "description": "Return to the path junction. You can detour along the branch path to the right for a different persepective on the falls looking up the gorge. To return to the start of the walk, though, it's best to head back the same way."
      }
    ],
    "scraped_at": 1756310915.5283558
  },
  {
    "title": "Insh Marshes - Invertromie Trail",
    "summary": "A lovely walk exploring the edge of the Insh Marshes RSPB nature reserve with good views and varied countryside. Bring binoculars for the three bird hides.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/inshmarshes.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 2.0,
    "ascent_m": 89,
    "start_grid_ref": "NN774998",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Start at the Insh Marshes RSPB reserve car park and walk away from the B970 to the rear of the parking area. At the start there is the option to detour 250m to the Gordonhall hide. This hide and others on the route overlook the floodplain and depending on the time of year it is possible to see ducks, geese, swans, lapwings, curlews, redshanks, buzzards and osprey from here to name but a few. To start the walk head uphill from the parking area. At a fork the route takes the 'Invertromie Trail' to the right, but first go left visit the luxurious, circular Lookout hide which boasts a rooftop terrace, and information in the hide beneath."
      },
      {
        "stage": 2,
        "description": "Now take the Invertromie Trail, soon forking left onto a smaller path at a wooden barrier. There are good views over the marshes and woodland. The Insh Marshes are important for wildlife as they are the largest area of floodplain in Britain that has not been improved or drained meaning it supports a vast array of different species. It also means that as the marshes flood naturally several times a year the views are often different on each visit. Follow the trail as it passes next to a fence with the woodland on the left. Cross a small wooden bridge. Just afterwards there is a chance to detour 180m down steps to the Invertromie Hide which overlooks the wetland."
      },
      {
        "stage": 3,
        "description": "Continuing on the trail, climb gently across grassland towards the woods. Pass through a small gate and bear slightly right on the narrow but clear path as it enters the woodland. Roe deer can often be seen in this area and in the autumn there are many types of fungi. Soon a t-junction with a sign is reached. To the left here is another possible detour to a view point and picnic area; the main route turns right."
      },
      {
        "stage": 4,
        "description": "Keep following the white arrow markers and continue on the path to a gate where you cross a track to pick up the path on the other side. The path follows a ridge with good views from a seat, and lots of purple heather in late summer/autumn. Pass through another gate and into a lovely area of birch woodland. The trail then curves round to the left heading downhill and then turns right at a signed junction (path left leads to an old churchyard)."
      },
      {
        "stage": 5,
        "description": "At the bottom of a slope the path turns right, follows a wall and passes through a gate and then slopes downhill to emerge into Tromiebridge meadow, through another gate. Here the path follows the banks of the River Tromie, where Tromie Mills can be seen on the far side. 150 different plant species have been identified in this meadow which is particular good for orchids and butterflies. Follow the riverbank path which then heads away from the river into the meadow. Here the path splits, follow the grassy track to the left to a gate and the B970. Do not head out onto the road, instead turning right onto a broad constructed path - part of the Speyside Way."
      },
      {
        "stage": 6,
        "description": "Keep following the path through some fine birch woodland.When it emerges at a track, go left and then immediately right to continue on the path parallel to the road. After another 400m it returns to the start."
      }
    ],
    "scraped_at": 1756310918.122658
  },
  {
    "title": "Frank Bruce Sculpture Trail & Lower Feshie",
    "summary": "A lovely varied walk, taking in the wood and stone sculptures of Frank Bruce as well as the banks of the Feshie and a forestry section with good views of the surrounding mountains. The sculptures are naturally decaying in the environment, as was the intention of the late artist.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/lower-feshie.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 2.0,
    "ascent_m": 122,
    "start_grid_ref": "NH849046",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "West of Feshiebridge off the B970 there is a Forestry & Land Scotland car park. Start the walk by following the waymarked trail that climbs up to the higher track first and turning right and then following the footpath at the rear of the disabled parking area. Each of the large wooden and stone sculptures is accompanied by a title or explanation. The late Frank Bruce started sculpting in 1965 and used natural materials and the landscape and politics as inspiration."
      },
      {
        "stage": 2,
        "description": "Follow the path as it meanders through the native woodland, passing a number of impressive and large wooden sculptures. Soon the path comes alongside the wall of what used to be the walled garden for Invereshie House. Enter the walled area and follow the path round the sculptures and picnic tables."
      },
      {
        "stage": 3,
        "description": "A curving path - take the left branch - leads round the sculptures, mostly carved in wood but some of stone; small interpretative panels help to understand their symbolic or political significance. There are good views of the surrounding countryside from here. Leave the walled garden area at the side gate towards the far end, and turn left."
      },
      {
        "stage": 4,
        "description": "Follow the path alongside the wall until a path leads down to the riverside on the right hand side. There is an orange marker post near the top. Here there are lovely views over the wide section of the River Feshie. Turn right at the bottom and follow the path as it runs along a bank above the river and then goes right to cross a small wooden bridge at one point. Pass the river gauging station and climb the path back to the car park. Turn left and follow the yellow marker post to take a path that climbs next to a telegraph pole."
      },
      {
        "stage": 5,
        "description": "This path follows the line of the river and after passing a picnic table reaches a lovely stone bridge over the River Feshie where the water pours through a narrow section. Go up to the road and cross over and follow the track alongside four houses before reaching an open area with forestry and mountain views. Continue on the track leading up the glen."
      },
      {
        "stage": 6,
        "description": "After some distance a signpost indicates where to turn right, leaving the track and following a path uphill beside a stone wall; there are great views back across the glen. Follow the markers which indicate where the path veers off to the right into the forest plantations. Soon it emerges onto a forest road; follow for a short distance and then take a marked path downhill to the right. Watch out for mountain bikers. When you reach the tarmac road follow the path directly across to the track leading down into the car park."
      }
    ],
    "scraped_at": 1756310920.7096667
  },
  {
    "title": "Ellan Wood and the river, Carrbridge",
    "summary": "Ellan Wood is a fine pine wood on the fringes of the village of Carrbridge. Partly owned by the Woodland Trust, it offers several short waymarked trails, which can be combined to give the walk described here. The route finishes with a riverside section to the much-photographed packhorse bridge.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/ellan-woods.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 53,
    "start_grid_ref": "NH903227",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The car park is accessed via Station Road in Carrbridge. Look out for a turning on the left signed for Ellan Wood; there is parking and a picnic area just short of the cemetery. Begin the walk on the path which starts just to the left of the information board, signed Main Street via Ellan Wood. Initially the route follows the yellow markers. Turn left at the first junction, and then keep straight on when a short loop of path goes off right. There is a bench up to the right at the next junction, where you should keep left again (sign Main Street). At the next path junction a route comes in from Carrbridge on the left (this is an alternative start, heading between a church and the village hall); turn right here, signed 'Boat of Garten via Carr Plantation Trail' and waymarked in both red."
      },
      {
        "stage": 2,
        "description": "Keep straight on at a crosspaths, and then straight ahead again at a three way fork, signed 'Railway Wood walk' and marked in red. Continue ahead again across the access track for the overflow parking for the Landmark Forest park. The route now passes the Lookout Tower, an impressive structure and the highest wooden tower in Britain; it is part of Landmark and so cannot be accessed. The path continues through the woods; this part is a dense plantation of Scots pine."
      },
      {
        "stage": 3,
        "description": "The path eventually reaches the main railway line, where you should turn right, signed Railway Wood walk. The path continues beside the railway before eventually bearing right back into the woods; ignore a minor path off left. Red squirrels are plentiful around here; if you are here in the Autumn then the fungi can be quite spectacular."
      },
      {
        "stage": 4,
        "description": "Turn left when the path reaches a t-junction. Continuing the walk, a 'Glencharnoch Wood' sign indicates when you enter the part of the forest that is owned by the Woodland Trust. The path descends a flight of wooden steps at one point and then turns sharp right."
      },
      {
        "stage": 5,
        "description": "When a finely sculpted wooden bench is reached, turn left (passing another bench). The path continues to wind through a beautiful section of pinewood. At the next junction take a right turn, and then at the one after that turn left, then right - signed for Station Road."
      },
      {
        "stage": 6,
        "description": "When the road is reached go diagonally across (veering left) to meet a path leading off on the far side, signed for Village Centre via Riverside walk. A track leads round to the back of some houses; follow it round to the left as it forks. As the track approaches a bungalow, a low footpath sign indicates a turn to the right. Take this turning and continue to a suspension footbridge over the River Dulnain. On the far side, turn right downstream."
      },
      {
        "stage": 7,
        "description": "Eventually the path leads to the main road beside the remarkable old packhorse bridge, built in 1717 and still missing its parapets after the terrible floods of 1829 - known as the 'Muckle Spate' and probably the worst ever experienced in Scotland. Turn right to cross the modern road bridge alongside, and then right again to head along Station Road. Eventually the entrance to Ellan Woods is reached on the left and the car park at the start of the walk."
      }
    ],
    "scraped_at": 1756310923.2990685
  },
  {
    "title": "Queen's Drive and River Clunie, Braemar",
    "summary": "This beautiful circular walk leaves Braemar along the River Clunie before picking up the Queen's Drive - a carriage drive once favoured by Queen Victoria. This gently gains height and gives excellent views before a steeper descent through the woods leads back to Braemar.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/queens-drive.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 86,
    "start_grid_ref": "NO151913",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk starts from the centre of Braemar; there is a carpark (with toilets) just on the left off the A93 which runs through the village towards the Linn of Dee (there's another carpark just over the bridge opposite the Fife Arms)if full. Head back to the street leading into the village from the car park, turn left to cross the bridge over the River Clunie, giving views over a low waterfall. On the far side turn left onto a minor road signed for the golf course. Note the 'engine' preserved as a memorial to servicemen who lost their lives in an aircrash over the hills in 1945."
      },
      {
        "stage": 2,
        "description": "Continue along the quiet road out of the village until a signpost for 'Queen's Drive' and a footbridge on the left. Cross the bridge over the Clunie then turn right to cross a second footbridge over a tributary. A grassy path now keeps to the right of the fence, with views over the river and Morrone Birkwood beyond."
      },
      {
        "stage": 3,
        "description": "After passing through a gate the path climbs gently and then swings away from the river, overlooking the golf course, to eventually meet the main A93 road. Cross this and pick up the path over the far side, turning right to head further from the village (a left turn here heads straight back to Braemar). The path begins to climb, goes through a gate and widens."
      },
      {
        "stage": 4,
        "description": "This is the Queen's Drive, and it rises gently through scattered birchwoods, giving some grand views to Braemar and beyond."
      },
      {
        "stage": 5,
        "description": "Eventually a green footpath signpost is reached. The piles of stones on the left here are all that remains of a cottage, Dubh Chlais (meaning black hollow) which was the home of Mr and Mrs Thompson. They were relatives of John Brown, Queen Victoria's famous servant, and the Queen often came here with him to bring tobacco and tea to the Thompsons. To extend the walk, you could continue ahead from the sign to make the Lion's Face circuit; otherwise turn left as signed for 'Village Centre'."
      },
      {
        "stage": 6,
        "description": "The path now descends through the woods, running alongside a wall and then turning left through a gap in it. When it meets a bench keep left, then continue ahead at further junctions as the route continues to descend, passing a wigwam wildlife hide. At the bottom of the woods a signpost is met where the route from the Lion's Face and Cromlins walk and the ascent route to Creag Choinnich come in from the right. Keep ahead here to leave the woods through a gate and reach the village. At the lane keep straight on to head past the church and back down to the main road. Cross and head down the ramp opposite to return to the car park."
      }
    ],
    "scraped_at": 1756310925.8866568
  },
  {
    "title": "The Colonel's Bed, Inverey",
    "summary": "This short walk heads into the lower reaches of lonely Glen Ey. Its objective is the Colonel's Bed, where the river flows through a narrow rocky chasm. The rockwalls of the gorge here are loose and have partially collapsed - do not attempt to descend into the gorge and view from above with great care.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/colonels-bed.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.9,
    "estimated_hours": 1.5,
    "ascent_m": 130,
    "start_grid_ref": "NO089892",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a car park in Meikle Inverey, which is the part of Inverey on the east side of the River Ey; the part on the other side is known as Little Inverey. Begin the walk by following the track which slants uphill and is marked with a wooden signpost for Glen Ey. There are great views over to the right to Ben Macdui and Derry Cairngorm. Continue up the track through the grounds of Inverey House."
      },
      {
        "stage": 2,
        "description": "The track leaves the grounds of the house through a gate and heads into the glen. Further on it crosses a wooden bridge over the River Ey; note that the bridge shown on some maps heading across to the track on the west side of the Ey no longer exists. Beyond the bridge the track climbs fairly steeply, with great views looking back over Inverey towards the high Cairngorms. Shortly after the track bends to the right you can short cut the zig-zag by following a path up on the left, rejoining the track a short distance uphill."
      },
      {
        "stage": 3,
        "description": "Continue on the landrover track up the glen for almost a kilometre. Just after it bends to the right, a small cairn marks the point to leave the track. Turn left here on a narrow path  in the heather that almost doubles back on the track; this is the line of the original stalkers path which was the main route up the glen before the current track was bulldozed. When back round the corner, a small wooden sign indicates the path off to the right that slopes down to the Colonel's Bed."
      },
      {
        "stage": 4,
        "description": "The path is narrow and a little rough; as you near the river take great care. The river here flows through a vertically-sided rocky gorge, and great care is needed near the edge; the ground is slippery and some of the rocks are loose - clearly any slip would be fatal.  In the 17th Century a colonel, outlawed for the murder of a Laird, made this his refuge, and was brought food each day by his lover. Today part of the wall of the gorge has collapsed and buried the bed itself - do not attempt to descend into the gorge as it is very dangerous and doesn't lead anywhere."
      },
      {
        "stage": 5,
        "description": "After enjoying the gorge from above, return to Inverey the same way."
      }
    ],
    "scraped_at": 1756310928.466755
  },
  {
    "title": "Fairy Pool and Riverside walk, Glen Tanar",
    "summary": "This delightful walk on the Glen Tanar estate combines forestry and farmland with a long, pretty riverside section. The walk is waymarked (combining the Fairy Lochan and Riverside paths), the visitor centre has information on the wildlife to be found on the estate. Toilets near the start and parking charge.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/glen-tanar-riverside.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.9,
    "estimated_hours": 2.0,
    "ascent_m": 30,
    "start_grid_ref": "NO479965",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Take the minor road up Glen Tanar, parking in the Braeloine car park (charge) on the right hand side part way up the glen. Begin the walk by crossing the very beautiful old steeply-arched Bridge of Tanar. On the far side, the building over to the left is an information centre giving details of the estate and the wildlife to be found here; there are also toilets. The walk described here mainly follows white waymarkers although it combines the Fairy Lochan and Riverside paths to make a longer circuit. Start by following the track upstream waymarked in white and green."
      },
      {
        "stage": 2,
        "description": "After a short while the attractive stone-built Chapel of St Lesmo - built in 1872 - is passed on the right and then a junction reached. Turn left here to follow the clear track."
      },
      {
        "stage": 3,
        "description": "Keep on the main track when another track joins from the right and soon the reed-covered Fairy Lochan is reached. Marginal plants have been encouraged at the edges of the water and the lochan is breeding ground for many dragonflies in summer. Continue past the water on the track which rises slightly uphill and passes pine and birch trees."
      },
      {
        "stage": 4,
        "description": "This section is a good area to spot fungi especially in late summer and autumn. After a short while ignore the Fairy Lochan path which leaves to the left (a possible shortcut) - instead continuing for around 500m to the next junction and then turning left here (Riverside Path marker post). The narrow path follows a ridge which was formed by terminal moraine, the wall of boulders and gravel left behind by a glacier and where a loch would have formed behind it. Follow the ridge down past a bench and towards the riverside."
      },
      {
        "stage": 5,
        "description": "The path turns to the left and heads back upstream following the river. The path is narrow as it plunges through silver birches and then emerges into more open ground. A number of slow moving pools are passed and a bench and some faster sections of river."
      },
      {
        "stage": 6,
        "description": "Cross a wooden bridge and then a smaller bridge and follow the path as it leads away from the river bank for a short section before returning and continuing upsteam. Eventually the back of the visitor centre can be seen on the left and the path emerges next to the arched stone bridge at the start of the walk. Cross the bridge and the road to return to the car park."
      }
    ],
    "scraped_at": 1756310931.8657439
  },
  {
    "title": "Falls of Falloch",
    "summary": "A very short leg-stretcher to this popular waterfall and picnic spot, where the River Falloch falls in a single 10m leap, particularly impressive when in spate.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/falls-of-falloch.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 0.6,
    "estimated_hours": 20.0,
    "ascent_m": 10,
    "start_grid_ref": "NN334207",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The Falls of Falloch is a popular beauty spot with benches for picnics. While requiring only a very short walk to view the falls, this can make a useful stopping point or brief leg-stretcher if travelling on the A82. From the car park follow the path through the trees with glimpses of the River Falloch below. At a junction turn right down some steps to an area where you can explore the edge of the river which can be impressive after wet weather."
      },
      {
        "stage": 2,
        "description": "Keep left following the bend in the river following the path over a small boardwalk bridge to the point where the Falls can be viewed."
      },
      {
        "stage": 3,
        "description": "When in spate the falls - and the massive pool beneath them - are very impressive, even more so if you are lucky enough to see an expert kayaker attempting the descent."
      },
      {
        "stage": 4,
        "description": "A recent addition is the 'Woven Sound' installation which provides a different viewpoint for the falls. Constructed from steel rods by John Kennedy; the installation features an entry from Dorothy Wordsworth's diary that recalls the thoughts of those who visited the falls during the days of the Grand Tour. From the sculpture turn left to follow the main path back, crossing a wooden bridge and passing another bench before the straight path back to the car park."
      }
    ],
    "scraped_at": 1756310934.9773445
  },
  {
    "title": "Flanders Moss National Nature Reserve, near Kippen",
    "summary": "A short exploration of this fascinating peat bog, complete with viewing tower to climb, good hill views as backdrop to the cotton grass, birches and heather of the reserve.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/flanders-moss.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 0.9,
    "estimated_hours": 30.0,
    "ascent_m": 1,
    "start_grid_ref": "NS647977",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Flanders Moss is reached along a signed track from the B822 Kippen to Thornhill road, 3km south of Thornhill. Dogs should be kept on a lead as there are adders on the reserve and visitors are asked to keep to the paths as the bog can be very deep in places. There is a parking area and interpretation boards. The nature reserve is just a small part of a vast expanse of peat bog known as Flanders Moss. Its a raised bog which means the mounds of peat are built up over the surrounding watery landscape. The bulk of the peat is made up from spagnum moss which adds new layers to the peat continuously. From the car park walk along the path to the viewing tower which can be climbed to appreciate the reserve and the views to the hills beyond."
      },
      {
        "stage": 2,
        "description": "From the viewing tower head round the boardwalk pathway in a clockwise direction. Birches, the pioneer tree, are growing in this part of the bog and will gradually dry it out if left so the reserve managers are keeping the trees in check to ensure the rare bog habitat survives. If you are a frequent hill walker in Scotland you may be surprised to hear bog being referred to as rare as it is often encountered underfoot, but the raised bog here is different to most boggy moorland and provides a habitat for rare species."
      },
      {
        "stage": 3,
        "description": "A short detour on stones leads to a couple of seats in the bog. Hen harriers and kestrels sometimes hunt in the reserve. On the ground you are likely to see sundew plants, yellowy green in colour, they trap insects in sticky hairs which cover the leaves."
      },
      {
        "stage": 4,
        "description": "Keep heading round the circular path, crossing a bridge. In sunny weather keep an eye out for adders which may bask in gaps between the heather. As the boardwalk nears the trees another short detour leads to the left. Soon you are back at the viewing tower and the start."
      }
    ],
    "scraped_at": 1756310937.5653121
  },
  {
    "title": "Loch Lomond Shores walk, Balloch",
    "summary": "This short stroll from the Loch Lomond Shores shopping complex makes a good leg stretch or family walk and is suitable for baby buggies and some wheelchairs.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/lomond-shores.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.0,
    "estimated_hours": 30.0,
    "ascent_m": 10,
    "start_grid_ref": "NS383821",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start next to the Tree Zone building to the left of the main shopping complex as you look out towards Loch Lomond. The large building to the right used to be a visitor centre but is now closed. Go up the path between this building and Tree Zone, turning right to head along the far side of the building. Take the second path on the left to cross a small stream on a boardwalk path; the Tree Zone assault course can be seen overhead."
      },
      {
        "stage": 2,
        "description": "After crossing the bridge continue to the next junction and then turn right, following the boardwalk through the trees. The next turning right is a short detour to a slipway with a view over part of the loch.  Follow the path as it bears to the left. The path now comes close to the loch and an artwork installation in the form of a quartzite curving wall that divides the land from the water of the loch."
      },
      {
        "stage": 3,
        "description": "Continue on the main path around the edge of Loch Lomond.  Follow the path past another beach to reach an open grassy glade. There is a path junction here; you can either short-cut the walk by turning left or continue on the path ahead passing the picnic tables. The path then swings left to head back towards a multi-coloured metal and plastic sculpture that contrasts strangely with the rural surroundings."
      },
      {
        "stage": 4,
        "description": "The path then plunges back into the trees and rejoins the outward route. Turn right here but ignore the turning back over the bridge to the visitor centre - keeping ahead. Another sculpture can be seen on the left - a black tower with blue and white squares of light. Continue ahead through the trees - the path forks and continues around a loop before doubling back.  Exit by heading back past the Tree Zone bulding to the car park."
      }
    ],
    "scraped_at": 1756310940.18727
  },
  {
    "title": "Duncryne hill, by Gartocharn",
    "summary": "Duncryne, known locally as the Dumpling, is a tiny hill of only 465 feet above sea level. However the very short ascent gives a reward out of all proportion to the effort, revealing a fantastic view of Loch Lomond, dotted with its many islands and backed by the great mountains of the Southern Highlands.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/duncryne.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.25,
    "estimated_hours": 40.0,
    "ascent_m": 88,
    "start_grid_ref": "NS432856",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Take the minor road that leaves Gartocharn by the inn and heads southeast towards Duncryne, which is well seen across the fields to the left. You can either park in the layby alongside the woods where the path begins, or walk here from Gartocharn village if the layby is full - but do not block any farmers gates. The path is signposted and heads through a gate on the left into the trees."
      },
      {
        "stage": 2,
        "description": "A kissing gate leads out of the first section of woods; go through a further gate to cross the fields on a grassy lane between two fences.  Another kissing gate leads into the final section of woodland on the hill itself. Pass through it and follow the path which heads round to the right. It then climbs up the bracken slope onto the bald summit of the hill, marked by a triangulation point."
      },
      {
        "stage": 3,
        "description": "It is for the view that Duncryne is renowned. Loch Lomond with its many wooded islands looks supremely beautiful, whilst beyond it is a grand sweep of the Highland mountains, including favourite summits such as The Cobbler, Ben Vorlich and, dominating the view, Ben Lomond. The legendary hill-goer Tom Weir, who presented a TV program on Scotland's landscape for decades, used to live at Gartocharn; he reckoned Dumcryne has the best view of any small hill in the country - and on a fine day here it is hard to disagree. The return is made the same way."
      }
    ],
    "scraped_at": 1756310942.9104772
  },
  {
    "title": "Mountain lookout trail, Crianlarich",
    "summary": "This short walk from Crianlarich is ideal as an early evening leg stretcher. It heads up through the native community woodlands with to a viewpoint overlooking the surrounding mountains. At the end of the loop there is a chance to visit the banks of the River Fillan.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/crianlarich.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 34,
    "start_grid_ref": "NN386253",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the centre of Crianlarich; there is a good sized car park opposite the school (which is next to the Rod and Reel pub). Begin the walk by carefully crossing the main road and then heading up the minor road that runs past the Londis supermarket. Keep left when it forks (signed 'Mountain Lookout') to reach another small parking area. Here a marked footpath crosses a footbridge and climbs uphill through the woods."
      },
      {
        "stage": 2,
        "description": "The path passes a bench and then heads through a gate into a more open area. Follow the path uphill passing young rowan, birch, willow and alder trees. This area is part of Crianlarich Community Woodland, where local children have planted native species of trees.  At a marked junction keep straight ahead (the Inverardan Forest branch on the left is the return route). Soon the path turns left into a constructed viewing area with seating and an indicator giving the names of the surrounding mountains."
      },
      {
        "stage": 3,
        "description": "Continue on the path that heads through the viewing area and swings right. Soon it climbs up to a small rocky knobble which gives excellent views back over Crianlarich."
      },
      {
        "stage": 4,
        "description": "Continuing along the path there are good views ahead to Ben More, the highest local Munro at 1174 metres. Turn just past a bench (blue marker) and then left when a t-junction is reached with another path. This leads to a wooden boardwalk across a wet area; cross this and then turn right along a landrover track beyond."
      },
      {
        "stage": 5,
        "description": "When this reaches the edge of commercial forest plantations turn right (blue waymarker) onto a footpath. This soon passes through a gate and then returns to the junction mentioned at . From this point turn left and retrace your steps back to the car park."
      },
      {
        "stage": 2,
        "description": "When this reaches the edge of commercial forest plantations turn right (blue waymarker) onto a footpath. This soon passes through a gate and then returns to the junction mentioned at . From this point turn left and retrace your steps back to the car park."
      },
      {
        "stage": 6,
        "description": "Before leaving the car park, it is worth following the 'River and Rail Trail' path from the far side. This swings left past a bench to run along what was once part of the Oban and Callander railway line, which closed in 1965. Follow it until it leads beneath the Glenbruar Viaduct which carries the West Highland Line high above - this is still in use. Do not pass underneath, instead following the track to the right to reach the banks of the River Fillan - an attractive spot. Return to the car park the same way."
      }
    ],
    "scraped_at": 1756310945.5016901
  },
  {
    "title": "Tarbet Isle Walk, near Tarbet",
    "summary": "An easy circuit which climbs gently through pine woods and then oak woodland with good views over Loch Lomond and Tarbet Isle below.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/tarbet-isle.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 55,
    "start_grid_ref": "NN326053",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The car park is signed from both directions of the A82 and is just north of Tarbet on the inland side of the road up a steep drive. From the parking area take the path marked with a yellow marker post heading uphill towards some Scots Pines. The path climbs steadily before easing off and looping to the right and then descending for a short section."
      },
      {
        "stage": 2,
        "description": "As the path goes through mixed conifer and broadleaved woodland the remains of Caulfield's Military Road which ran from Tarbet to Crianlarich can be seen on the other side of the drystane dyke to the left of the path. Keep following the path as it goes through a gap in the dyke and eventually comes within sight of the Bonnie Braes tea room at Blairannich. It is possible to divert over the small wooden bridge to visit the tea room, otherwise continue on the main path as it bears right to head back towards Tarbet Isle."
      },
      {
        "stage": 3,
        "description": "The woodland is now mainly oak and glimpses of the water of Loch Lomond can be seen through the trees. Tarbet Isle, a small island only 80 metres long and 10 metres at its highest point, can be viewed from here. The island takes its name from nearby Tarbet which itself means the portage place. This name comes from folklore that the 13th century King Haakon sailed his Viking fleet up and down Loch Lomond causing havoc and panic having dragged his boats overland to Tarbet across the narrowest part of the land. The path soon returns to the car park where there are also good views of the water."
      }
    ],
    "scraped_at": 1756310948.082881
  },
  {
    "title": "Balmaha Millennium Forest path",
    "summary": "This very short walk explores the village of Balmaha. It climbs up to Craigie Fort before returning via a path cut out of the rock on the very edge of Loch Lomond.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/balmaha.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 55,
    "start_grid_ref": "NS421909",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the huge car park in the centre of Balmaha, which also has an information centre. The path leaves from the very back of the car park close to an information board. It immediately divides at a t-junction; turn left here to follow the path through the trees close behind the car park. The invasive rhododendrons in this part of the wood are being cut back to give native plants a chance to thrive. Look out for woodland birds such as siskin and goldcrest."
      },
      {
        "stage": 2,
        "description": "Soon the path reaches the main road; head straight across to follow a path running parallel on the far side, heading to the right. The path gives views of the many boats moored in the bay. When the main road swings away to the right continue onto the minor road along the loch shore. Turn right onto a steep path marked by a West Highland Way thistle marker post."
      },
      {
        "stage": 3,
        "description": "The path climbs up onto the wooded promontory of Craigie Fort. Keep right at the junction to reach the summit, which offers superb views of Loch Lomond. Continue to follow the West Highland Way as it descends down the other side."
      },
      {
        "stage": 4,
        "description": "The path continues down to the shores of Loch Lomond. Here the West Highland Way continues to the north along the loch shores, but to return to Balmaha, turn left. The path heads round the bottom of the promontory, crossing first an attractive bridge and then following a path cut from the rock right on the edge of the water. The impressive island just offshore is Inchcailloch. The path leads to a small jetty; turn left along the lane to return to the main road in Balmaha. Turn right along the road to head back to the car park."
      }
    ],
    "scraped_at": 1756310950.6723723
  },
  {
    "title": "Arrochar - Tarbet link path",
    "summary": "This walk links Tarbet to Arrochar and makes a nice one way walk - or an out and back route. There are good views from the elevated path which has some steep sections.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/arrochar-tarbet.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.25,
    "estimated_hours": 1.0,
    "ascent_m": 95,
    "start_grid_ref": "NN298048",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the car park on the shore at Arrochar (charge payable) and follow the short path along the shore to the main road and turn right to pass the shop/post office and chippy. At this point cross the road and climb the few steps opposite to reach an information board with a map of the route. Follow the path uphill following the yellow waymarkers. At the junction turn right and keep following the path."
      },
      {
        "stage": 2,
        "description": "In the 13th century the Vikings took advantage of the low and short piece of ground between Arrochar and Tarbet (which in Gaelic means place of portage) to carry their longboats overland and carry out raids on the settlements on Loch Lomond. It must have been truly terrifying to see one of King Haakon's longboats appearing out of the mist filled with armed Viking raiders. Now the 2.5km stretch houses the busy A83 linking Glasgow and the east to most of Argyll. As the path climbs there are good views back over Arrochar and across to the Cobbler and Beinn Narnain beyond. You can also see the remains of the second world war torpedo testing station on the far side of Loch Long where there is still a large jetty and some derelict buildings."
      },
      {
        "stage": 3,
        "description": "The path passes a bench with a good view and continues straight ahead. Stay on the main path, ignoring a rough path  to the right through the rhododendrons. At a fine Scots pine, the route passes a wooden barrier and continues to climb uphill. It then winds through beech, birch and oak trees. Ignore a small path joining from the right."
      },
      {
        "stage": 4,
        "description": "With pine forest on the left side pass a group of carved heads and soon a junction is reached. Turn right here to descend to Tarbet Station. If continuing to Tarbet itself, follow the path under the railway line. There is some parking here."
      }
    ],
    "scraped_at": 1756310953.2565715
  },
  {
    "title": "Luss Heritage Trail",
    "summary": "This easy walking trail takes in the model village of Luss, with its pretty stone cottages and pier on Loch Lomond as well as riverside and woodland sections.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/luss.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.0,
    "ascent_m": 18,
    "start_grid_ref": "NS359930",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the main car park in Luss (charge). Luss was orginally known as Clachan Dhu, the dark village, due to its position in the shadow of the hills. However approximately 1,500 years ago St Kessog brought Christianity to the area; he was martyred and his body embalmed in sweet herbs. Local legend suggests that the herbs grew and covered his grave and gave the village its new name derived from the Gaelic word lus meaning herb. Head away from the lochside to follow the road towards the village from the car park. Almost immediately turn right towards the tiny primary school (old road sign for Glen Road), following the pathway up the slope and then up steps to head across the footbridge over the A82. The pathway emerges next to a large house, keep straight on through a gate onto a path signed for the Quarry Walk."
      },
      {
        "stage": 2,
        "description": "Cross the minor road and go through the gate to follow a path through the woodland. Keep on the main path when smaller paths head off to the right and soon you start descending steps to a wooden bridge. Here the spoil heaps from the slate quarry can be seen. Many of the villagers worked in the slate quarry and would have been too poor to clad their turf-thatched cottages in slate, much of which was sold for the roofs of the Glasgow tenements. However in 1850 the laird who was also the local clan chief replaced the hovels with the new model village that can be seen today. Cross the bridge and turn left to walk downstream passing the small weir. Keep following the path which passes under the busy A82 and then alongside grazing land before crossing a small wooden bridge and heading up to the village road."
      },
      {
        "stage": 3,
        "description": "Climb the steps up to the road and cross over. Turn left and follow the pavement very briefly before turning right down steps and onto a path signed River Path. Turn right on the path and follow it as follows the river downstream, eventually reaching some benches at a sharp bend in the water. The path passes a water treatment works before it reaches the first houses of Luss. Here there is the option to turn right over the wooden bridge to visit the Glebe where there is a celtic-cross sculpture and a circular path."
      },
      {
        "stage": 4,
        "description": "If not exploring the Glebe keep straight on to pass the church which was built in 1875. The graveyard is much older with some of the earliest stones dating from the 7th and 8th century. It is worth exploring the graveyard to find the 11th century Viking hogback grave. Bear round to the right through the gate past the church to reach the shores of Loch Lomond. Follow the lochside to the left, soon reaching Luss pier where boat trips run on the Loch in the summer months. There are stunning views across the loch to Ben Lomond."
      },
      {
        "stage": 5,
        "description": "From the pier head straight up the main street, where the neat cottages of the model village can be admired. The laird built the village to provide housing for the workers who worked in his slate quarry and mills which included a cotton mill, saw mill and corn mill. Turn right alongside a whitewashed cottage onto a one-way lane, then go right again to return to the car park."
      }
    ],
    "scraped_at": 1756310955.8550882
  },
  {
    "title": "Inversnaid RSPB nature trail",
    "summary": "This short but steep little nature trail explores the stunningly beautiful oakwoods on the east side of Loch Lomond. Inversnaid was celebrated in poetry by Gerard Manley Hopkins.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/inversnaid.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.0,
    "ascent_m": 145,
    "start_grid_ref": "NN336088",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins at the large hotel at Inversnaid on the east side of Loch Lomond. It can be reached either via as the end of a long road from Aberfoyle in the Trossachs, or alternatively via a boat from Inveruglas on the west side of the Loch during the summer months. Inversnaid was part of the grand tour during the nineteenth century; tourists would approach by boat before being taken from Inversnaid by horse and coach to Stronachlachar on Loch Katrine, from where they would sail down the loch. Today the hotel here is the base for coach holidays but it still enjoys a peaceful and very beautiful spot."
      },
      {
        "stage": 2,
        "description": "The walk begins by following the West Highland Way north from the large car park. A sign soon indicates the beginning of the Inversnaid Nature Reserve, owned and maintained by the RSPB. Beautiful oakwoods sweep down from the hills to the shores of the loch; a truly natural landscape, these woods contain birch, rowan, hazel and holly as well as oaks. Continue along the West Highland Way, reaching and passing behind an old corrugated iron boat house on the loch shores. The prominent pipelines and building on the shores opposite are the hydro-electric power station at Inveruglas."
      },
      {
        "stage": 3,
        "description": "Just after a little wooden bridge a sign indicates the start of the nature trail, turning off to the right uphill into the woods. The climb is steep but very enjoyable, with old ruins beneath the canopy of trees being all that remains of the old settlement of Cladachbeag. Eventually the path reaches a grassy clearing with a fine view back down Loch Lomond. Opposite, towering behind Tarbet, are the mountains of the Arrochar Alps."
      },
      {
        "stage": 4,
        "description": "From the clearing the path bears right slightly to descend back towards and into the woods, crossing a wooden footbridge over a stream. Once back down to the loch shores the West Highland Way is reached once more. A glance at the map shows a tempting detour to the right to visit Rob Roy's cave; however this old hideout of the noble rogue really only consists of a cleft amongst broken rocks and isn't really worth the effort. Instead turn left to return to Inversnaid along the beautiful shores of Loch Lomond."
      },
      {
        "stage": 5,
        "description": "The poet Gerard Manley Hopkins stayed at Inversnaid and wrote a poem of the same name. It is often quoted by conservationists and nature enthusiasts:What would the world be, once bereftOf wet and wildness? Let them be leftOh let them be left, wildness and wetLong live the weeds and wilderness yet."
      }
    ],
    "scraped_at": 1756310958.4416332
  },
  {
    "title": "Creag an Tuirc, Balquhidder",
    "summary": "Many people come to the beautiful hamlet of Balquhidder to visit Rob Roy's Grave, but few know that just above the village is a viewpoint which must rank amongst the finest in the country when compared to the minimal effort involved in reaching it. Creag an Tuirc, a grassy knoll atop a crag was the ancient rallying place of Clan MacLaren. It gives superb views over both the village and along Loch Voil.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/creag-an-tuirc.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.0,
    "ascent_m": 125,
    "start_grid_ref": "NN536209",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "There is limited parking near the churchyard in Balquhidder, which is well-signed as the site of Rob Roy's Grave. If full, there is alternative space with a voluntary charge at the community hall a short distance further along the road. Rob Roy's Grave is immediately in front of the ruins of the old church, between that of his wife and his sons. The words 'MacGregor despite them' refers to government efforts to suppress the clan which included the banning of the MacGregor name. The graveyard is very old and well repays exploration, whilst the church contains the tombstone of St Angus. Begin the walk by heading back down out the churchyard and then turning sharp left to head up the track that runs uphill beside it."
      },
      {
        "stage": 2,
        "description": "When the path reaches a junction, bear right past the forestry sign for Kirkton Glen. A short distance further on the track swings left, and continues uphill for another 400m, reaching a hydro building. Immediately beyond this turn right onto a good path that leads very gently uphill through the forest. At the end is a gate; pass through and a small path continues up to a wooded knoll."
      },
      {
        "stage": 3,
        "description": "The summit of Creag an Tuirc (which means the crag of the boar) is marked with a large cairn and a bench. This was the ancient gathering place of Clan MacLaren in times of trouble. Runners would alert clan members to arm themselves and assemble here, and 'Creag an Tuirc' is the clan's rallying cry. For many of today's visitors it is the views for which the ascent is worthwhile. Looking south there is an aerial view of the village, Glen Buckie beyond and a backdrop of Benvane."
      },
      {
        "stage": 4,
        "description": "To the right is the most picturesque part of the view, looking up the length of Loch Voil. From the summit return a few paces the same way, heading back down to the hydro building. You could extend the walk from here for several miles by following the Kirkton Glen circular off right; otherwise turn left, continuing to retrace your steps."
      },
      {
        "stage": 5,
        "description": "Follow the track back down to the Kirkton Glen Forestry sign near the start. Rather than returning down the lane beside the graveyard, it is worth taking the right fork to vary the route to the village. At the next junction turn right to reach and cross a footbridge with a view of an attractive waterfall. The path now swings left and returns to the houses of Balquhidder; bear left to cross the old stone hump-back bridge. The road is reached just beyond; turn left to return to the start."
      }
    ],
    "scraped_at": 1756310961.0355499
  },
  {
    "title": "Inchcailloch island",
    "summary": "Inchcailloch may not be the largest, but it is the most accessible and probably the most beautiful, of Loch Lomond's islands. Part of a National Nature Reserve, the island has wonderful woodlands and offers fabulous views out across the loch.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/inchcailloch.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.5,
    "ascent_m": 94,
    "start_grid_ref": "NS413906",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Inchcailloch is a stunning wooded island on Loch Lomond, just a short distance off-shore from Balmaha. Balmaha boat-yard operate a ferry service to the island on-demand, available throughout the year, weather permitting. The walk begins from the north pier, where most boats land. Head up the short flight on steps to begin your exploration of the island. The path heads to the right through the woods, soon turning inland. An information board with a map of the island is soon reached; the largest path continues ahead, but to make an ascent to the highest point of the island, turn left here onto a slightly rougher path."
      },
      {
        "stage": 2,
        "description": "The path crosses a wooden boardwalk across a wet area; alder trees thrive in these damp conditions. Once nearer to the south side of the island the path begins to ascend, with some steps, making a wide zig-zag. The rocks above the path are puddingstone - a conglomerate that gets its name from its resemblance to fruit pudding. At the top of the climb a bench looks out to the flat and wide southern stretches of the loch."
      },
      {
        "stage": 3,
        "description": "The path now swings left to another bench, this time on the summit of the island, and looking north. The panorama is truly stunning, with the first hills and mountains of the Highlands arranged around the head of the loch. Ben Lomond rises particularly proudly as the centrepiece of the scene. After enjoying this, continue along the path, with a brief view along several other islands all in a perfect line - like Inchcailloch, these islands are all on the Highland Boundary Fault that separates Highlands and Lowlands."
      },
      {
        "stage": 4,
        "description": "The path descends to reach a junction with the main path once more; unless you need to hurry back to the boat, turn left through the woods, which are spectacularly decorated with a carpet of bluebells in May. The path leads to Port Bawn, a picnic area at the western edge of the island, with a pebbly beach and its own jetty."
      },
      {
        "stage": 5,
        "description": "Turn right from the picnic area to follow a wooden walkway, passing the island's public toilets and then bearing right before the walkway reaches the jetty to head onto the 'Low path' that heads northeast fairly close to the coast. The path heads very pleasantly through the woods, soon reaching a low ruin. This is a reminder that until the end of the 18th century the island was farmed, with its residents growing oats and barley. As landowners switched their holdings from tenants to sheep, the owner of Inchcailloch was asked to plant trees and the era of farming the island was at an end."
      },
      {
        "stage": 6,
        "description": "The path now heads to the right across wooden duckboards and then ascends a slope to reach a  junction. The walk continues by heading sharply right here, but first, detour ahead to visit the ancient graveyard. According to legend Saint Kentigerna, an Irish princess and the mother of St Fillan, set up a nunnery here 1,300 years ago. Although the modern meaning of Inchcailloch is the island of the old woman, an old meaning of cailloch is a cowled woman - a nun. Centuries later a church was built here and dedicated to her but it fell into ruin when farming ended, though the cemetery continued to be used. Return to the path junction and turn left at the junctions to head back to the jetty - hopefully in time for your boat."
      }
    ],
    "scraped_at": 1756310972.973915
  },
  {
    "title": "Ardess History Trail",
    "summary": "The National Trust for Scotland own this part of Loch Lomond and have established a short history trail to explore the archaeology found beneath the heather, bracken and oak trees and to use it to explain how this part of the countryside used to be lived and worked in. An easy circular walk with good views.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/ardess.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 175,
    "start_grid_ref": "NS359986",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the car park at Rowardennan where there is an information centre and toilets. Follow the shoreside path as it heads north away from the car park and jetty. It soon passes the circular sculpture in tribute to those who have fought for Britain's armed forces and to whom the area is dedicated. Turn left when the main track is reached and keep right where the entrance to the Youth Hostel turns off. At the next fork keep left. Soon the driveway to Ardess Ranger Centre is reached. Turn right up the drive and pass to the left of the building. There is a leaflet which can picked up from the wooden box here. After the building head right and pass through a gate and then climb gently uphill bearing right. From here the stone built kennels can be seen below - these were built when the Youth Hostel was a 19th century hunting lodge."
      },
      {
        "stage": 2,
        "description": "At a bend in the track turn right through a gate and follow the path through the oak woods, crossing a stream. The original woodland was planted in the 18th century to produce wood for charcoal and fuel and also bark which was used for tanning leather. The area is now fenced from grazing sheep and deer and other native species such as holly, rowan and hazel have been regenerating. Pass through another gate and when a track is reached turn right. After another gate follow the track until an area of ridged ground can be seen on the other side of the fence. This is the remains of the ridge and furrow method of farming, where soil was mounded up with other nutrients to grow crops and the furrows provided drainage. Each family would be allotted a certain number of different ridges to farm each year to ensure everyone had a fair chance of getting good ground."
      },
      {
        "stage": 3,
        "description": "Soon afterwards bear left uphill heading for a tree and a seat. Follow the old remains of the stone dyke which would have been used to keep livestock and cultivation areas separate. Head across the open ground passing the remains of sheilings, or summer homes where cheese and butter would have been made in the summer months before the family moved back to their permanent homes lower down. Bear left at the remains to head downhill following the red marker arrows. The route soon goes through a gate to re-enter the wood."
      },
      {
        "stage": 4,
        "description": "Follow the path as it meanders through the wood, passing the ruins of a house before crossing another area of more open ground. Just before the next gate the remains of a turf house can be seen on the left. Little is known about the use of this type of building, constructed using only turf and no stones. Pass through the gate."
      },
      {
        "stage": 5,
        "description": "Cross a bridge over the Ardess Burn and very soon head to the right to look at the remains of two stone houses. Go through the wooden gate and follow the path past the remains of a long house, probably one used by a family at one end and their animals at the other. The path soon emerges onto the Ptarmigan path which is used as a way up or down Ben Lomond. Turn left onto this path and follow it downhill. Soon it comes close to the burn and there is a good viewpoint for a waterfall. When the path reaches the main track turn left and follow the track all the way back to the information building and the car park at the start of the walk."
      }
    ],
    "scraped_at": 1756310975.5654857
  },
  {
    "title": "Strathyre circuit",
    "summary": "This circular walk around Strathyre and the nearby hillside combines a section of the Rob Roy Way with a waymarked forestry walk. Part way up the hillside it crosses the Tighanes Burn and higher up there are good views. A good walk for spotting wildlife, especially deer and red squirrels and forest birds.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/strathyre.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 140,
    "start_grid_ref": "NN560168",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the forestry car park at the south end of Strathyre, beyond the Broch cafe. This route combines parts of the Rob Roy Way and the waymarked route. Start by climbing up the ramp from the car park onto the pathway. Turn right and cross a small bridge before passing along the back of a row of houses. After the small play park turn right at the road junction and walk to the main road opposite the former hotel. Cross the main road and go straight ahead to a metal gateway. Go through this and bear right to climb up behind the metal railings, passing behind the converted church to reach the memorial cairn for local victims of the world wars."
      },
      {
        "stage": 2,
        "description": "From the cairn continue along the path which bears left and leads down to the corner of the tennis court in the recreation ground. Turn right here, following the Rob Roy Way to pass a covered shelter and cross a wooden bridge. Follow the meandering path through the woods until a fork. Keep right here passing a picnic table before heading up through the trees and over another bridge. Beyond this the path climbs up through the pinewoods. This is a good area to look out for red squirrels."
      },
      {
        "stage": 3,
        "description": "Keep following the path which climbs gently. Looking across the valley, the small crag of An Sìdhean is visible - this south summit of Beinn an t-Sìdhean is a popular walk with good views of the nearby lochs and mountains. When the path emerges onto a forest track turn right and follow the track. In this area it is common to see deer, particularly in the early morning. Birds of prey can sometimes be seen overhead and jays can be heard shrieking as they move through the trees."
      },
      {
        "stage": 4,
        "description": "At a junction turn left to follow the yellow marker posts uphill through an area of forestry. When the track levels off, a sign is reached for the Coille MacCaskill path, named after Don MacCaskill who worked as a forester for 40 years and was a keen naturalist and introduced many changes to forestry to manage woodlands in a more environmentally sustainable way. You could extend the walk here by continuing up the track before turning right to cross the Tighanes Burn and follow a path back down the far side. Otherwise, turn right down the MacCaskill path which meanders through the open forest near to the Tighanes Burn on the left."
      },
      {
        "stage": 5,
        "description": "Just before the path reaches a track you can detour to the left to visit the standing stones erected by Don MacCaskill's family and friends as a memorial to him. The cup marked stone is similar to those found at Dalriada in Argyll, the area where Don MacCaskill grew up. At the track turn left."
      },
      {
        "stage": 6,
        "description": "Cross the Tighanes Burn on a bridge and take the path to the right immediately after. The path follows the burn through the trees until it bears left. Just before a building is reached, and within sight of the main road, turn right down a marked path to join a track where you turn right for a short while before reaching the main road. Cross the road and follow the driveway on the opposite side back to car park. Here there is a reconstructed cross-section of an iron-age broch, a fortified house which would have sheltered people and livestock when under threat from raiders."
      }
    ],
    "scraped_at": 1756310978.1575181
  },
  {
    "title": "Ardmore Point, near Helensburgh",
    "summary": "A short, easy walk around a small peninsula in the Firth of Clyde. Excellent views with seal and bird watching opportunities.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/ardmore-point.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.25,
    "estimated_hours": 45.0,
    "ascent_m": 2,
    "start_grid_ref": "NS324786",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Ardmore Point is reached by turning off the A814 south east of Helensburgh at Lyleston Cottage and following the minor road over the level crossing to a small parking area at the shore. From here there is a fabulous view across the Clyde estuary with many wading birds here at low tide. Start the walk by heading towards the cottage and very soon turning right onto a grassy path between fenced fields."
      },
      {
        "stage": 2,
        "description": "At the shore turn left to follow the path around the edge of the headland. From here the view is directly across to Helensburgh with the old stone fish trap visible across the small bay at low tide. Further away there are views of the Arrochar Alps and the mountains on the east side of Loch Lomond in the distance."
      },
      {
        "stage": 3,
        "description": "The path keeps near the shore with gorse bushes and muddy conditions sometimes making the path hard going. In spring and summer the combination of bright yellow gorse flowers, red sandstone and bluebells make a colourful display. As the headland is rounded there are views across the Clyde to Greenock."
      },
      {
        "stage": 4,
        "description": "Grey seals can often be seen basking on rocks just off the shore on this section. These rocks were formed 375 million years ago when the area was an arid desert. Since then the rocks have folded and been eroded leaving rocks from different eras exposed in stripes on the foreshore. The hillock behind in the centre of the peninsula is actually a cliff from when the sea level was much higher so the area you are walking on is an ancient raised beach."
      },
      {
        "stage": 5,
        "description": "The white castellated front of Ardmore House can be seen up on the left as the path continues along a short section of sea wall passing the lodge house to return to the start. The area of mudflats is known for oystercatchers, curlews, sandpipers, redshank and other waders and seabirds."
      }
    ],
    "scraped_at": 1756310980.7524505
  },
  {
    "title": "Glasdrum Wood, Loch Creran",
    "summary": "A short, but steep, walk up through part of the Glasdrum Wood National Nature Reserve, renowned for its rich variety of plants, birds and butterflies. The walk has good views over the head of Loch Creran.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/glasdrum.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.0,
    "estimated_hours": 1.0,
    "ascent_m": 113,
    "start_grid_ref": "NN011451",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The marked trail starts at the left side of the car park and is marked with an information board. Scottish Natural Heritage, which manages the site, have provided leaflets on the trail which are often available from the wooden box. There is also a picnic table and a superb view across Loch Creran to the great Munro of Beinn Sgulaird. The path climbs gently to begin with, and soon reaches a fork. Take the left hand path."
      },
      {
        "stage": 2,
        "description": "The marker post signs this cleared area, under powerlines, as a natural powerpoint. This relates to the fact that the butterflies and other insects that thrive in this wildwood can use the cleared area to store up solar energy, warming themselves to prepare for flight. Glasdrum is one of the few places in Britain which is home to the rare chequered skipper butterfly. The trail continues to climb through the mixed woodland, where evidence of coppicing can be seen. The path crosses a wooden bridge and comes to a fork where a short detour is marked, 'Getting a Glasdrum tan'. The detour path takes you uphill to the spot where charcoal burners, two centuries or more ago, used to light slow burning fires covered with earth to create charcoal. Return to the main path and turn left uphill continuing on the trail."
      },
      {
        "stage": 3,
        "description": "The path passes through the woodland with views over the surrounding countryside and crosses a second bridge. A little further along the path levels off and a bench is reached. The path now starts to head downhill and soon reaches a bench with a good view over the head of Loch Creran."
      },
      {
        "stage": 4,
        "description": "A marker posts says, Looking to Europe. This refers to the marine worms called serpulids that live in the waters of Loch Creran. These amazing creatures form hard tubes around their bodies and in Loch Creran these have formed colonies making a reef that in turn supports a huge number of other species. This has lead Loch Creran to be designated as a Special Conservation Area by the European Union."
      },
      {
        "stage": 5,
        "description": "Continue steeply downhill. The path crosses more open ground and then runs alongside a small stream. There are good views across to Druimavuic House across the valley. The trail crosses another bridge before rejoining the outward path at the 'natural powerpoint' marker post. Turn left here and head downhill to reach the car park."
      }
    ],
    "scraped_at": 1756310983.3377295
  },
  {
    "title": "Moine Mhòr and Dunadd",
    "summary": "This is really two separate very short walks on the edge of the Moine Mhor, the Great Moss - one of Britain's finest boglands and a National Nature Reserve. The second part of the walk ascends the miniature hill of Dunadd, a remarkable historic site that is tied in with the very beginnings of the Kingdom of Scotland.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/moine-mhor.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.2,
    "estimated_hours": 45.0,
    "ascent_m": 58,
    "start_grid_ref": "NR824958",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The first of these two short walks is the Moine Mhòr Tileworks Trail, a short all-abilities path on the edge of this great National Nature Reserve. The parking is signed on the B8025. The trail is best done clockwise; a local tileworks used to take clay from the bog to make tiles and bricks, hence the name. The trail begins by heading through the woodland of birch, alder, sycamore and oak, heavily draped with lichen - a sign of clean air."
      },
      {
        "stage": 2,
        "description": "The path soon emerges on the edge of the great bog itself, with a seat by the path. The Moine Mhòr has become deeper over its 5000 year development as the decaying plant material builds up; from some viewpoints the gentle dome-shape can be well seen as the centre of the bog slowly rises. Across the marsh can be seen the rocky hill of Dunadd - well worth a visit as described later. The path heads to the right, back amongst the trees, soon reaching a junction. Turn left here to visit a raised wooden walkway that extends out across the bog and allows a close inspection of this fabulous habitat."
      },
      {
        "stage": 3,
        "description": "Return to the junction, this time bearing left. The path soon heads back through the trees to return to the start. The woods have been cleared of invasive alien rhododendrons to permit the growth of more native trees, mosses, ferns and flowering plants. Look out for the lungwort on an old rowan tree. Back at the car park, the farming landscape across the road shows what the Moine Mhòr would have been like if it had not been protected and preserved."
      },
      {
        "stage": 4,
        "description": "Before leaving the area it is well worth driving to Dunadd to visit this remarkable historic site; the walk to the top is no longer but much rougher and steeper than the Moine Mhòr trail. Take the minor road across to the A816. Head south and the road that gives access to Dunadd is off on the right hand side - leading to a parking area. From here a path (signed initially) climbs up the hill; it is mostly grassy but boggy and steep in some places."
      },
      {
        "stage": 5,
        "description": "The summit has wonderful views across the Moine Mhòr and has a special place in the history. There are a number of carvings around the rock including a footprint near the top, said to have been used in the crowning ceremonies of the Kings of Dalriada, the Kingdom of Argyll and an antecedent of the creation of Scotland. Return back down the hill the same way."
      }
    ],
    "scraped_at": 1756310986.181019
  },
  {
    "title": "Achnabreac Cup and Ring carvings, Cairnbaan",
    "summary": "This short forest walk visits the most extensive prehistoric rock carvings in the UK: the Achnabreac Cup and Ring rocks. The easy circular also gives good views over Lochgilphead towards the Isle of Arran.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/achnabreck.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.75,
    "estimated_hours": 45.0,
    "ascent_m": 65,
    "start_grid_ref": "NR851908",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The car park for Achnabreac (charge) can be found by taking a signed turn off the A816 to the north of Cairnbaan. Continue along the track for nearly a kilometre until the car park is found off to the right hand side. There are picnic tables and mountain bike trails leaving from here as well as two short walks - this one, and another that leads to a dragonfly pond."
      },
      {
        "stage": 2,
        "description": "The footpath begins over the little footbridge. Turn left at a junction, then right onto the direct path from the car park. The small but steep and rocky hill on the right - hidden amongst the conifers - is Dùn na Marag, the site of an ancient fort. Continue straight ahead on the path at a cross-roads - the route crossing here is part of the mountain bike trail. The path continues to climb very slightly. Soon the celebrated Achnabreac rocks are reached, enclosed by a fence to prevent damage; the route keeps to the walkway alongside. The rocks were formerly known by their anglicised name of Achnabreck."
      },
      {
        "stage": 3,
        "description": "The cup-and-ring markings - of which there are many, sometimes overlaid in layers, are 5,000 years old. There are no representation carvings and the designs are completely abstract, with the rings sometimes enclosing the cup markings and sometimes running along them. Despite study by experts no-one is really sure of the purpose of meanings of the carvings."
      },
      {
        "stage": 4,
        "description": "The path soon forks right though there are more carvings on the rocks by the fence - which can be hard to see from below. When you've finished looking at these remarkable remains, continue on the main path. It soon reaches a second, smaller fenced area with another series of less well-preserved markings. The path now climbs gently via zig-zags, with seats from which you can admire the fine views over Lochgilphead towards the Isle of Arran, with Goat Fell visible on a clear day."
      },
      {
        "stage": 5,
        "description": "The path now swings left and climbs past a bench through the forest until it reaches a wide forest track. Turn left along the track, keeping on the main left-hand track at a junction, to return to the entrance to the car park. Turn left once more to head into the car park and return to the start."
      }
    ],
    "scraped_at": 1756310988.765854
  },
  {
    "title": "River Lochy Falls & Strone Woods, Glen Lochy",
    "summary": "Strone Hill woods are a very beautiful remnant of ancient oakwood almost hidden by the surrounding forestry of Glen Lochy. There is a short waymarked trail - a delightful and very easy walk - that also visits the falls on the river.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/strone-woods.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 60,
    "start_grid_ref": "NN209271",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "There is a signposted forestry car park off the A85 marked for Strone Hill. The waymarked trail begins from the information board. Take the left hand trail first; the walk is waymarked in yellow. The trail soon leaves any conifers behind and passes through some beautiful mature oakwoods."
      },
      {
        "stage": 2,
        "description": "The trail soon bends round to the right. When a junction is reached, turn left to make the short detour to view the waterfalls - where the River Lochy plunges over some steep slabs. Return to the main path and continue along it."
      },
      {
        "stage": 3,
        "description": "Soon another junction is reached. The path aheead leads straight straight back to the car park. To continue the walk, turn left. Continue along this path; at the next fork an unmarked path goes off to the left. This is a short detour that leads to a picnic table in a beautiful location by a pool in the river. Back on the main route, continue along the path."
      },
      {
        "stage": 4,
        "description": "Further on the path forks again. The waymarked route makes a loop from here and returns to the same point, so it doesn't really matter which way you go. The oaks are mixed with birches in this part of the wood and the many nestboxes help ensure a rich birdlife. The river is close by but usually well hidden by the trees, whilst a bench provides a chance for a rest. Once the loop is complete, return along the trail back to the junction. Turn left here to return to the car park."
      }
    ],
    "scraped_at": 1756310991.349959
  },
  {
    "title": "Kilchurn Castle, Loch Awe",
    "summary": "Kilchurn Castle is a marvellously evocative ruin with a stunning setting on Loch Awe. Unsigned from road this short walk is a delight and ideal for a picnic on a fine summer's day.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/kilchurn-castle.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 40.0,
    "ascent_m": 10,
    "start_grid_ref": "NN139279",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Turn off the A85 onto a track on the south side between the turning for Inveraray and the bridge over the River Orchy. There is plenty of room for parking near the start of the track. Begin the walk along the track which immediately forks; take the signed path to the right, passing through a gate, to head to the river and cross under the railway bridge beside it."
      },
      {
        "stage": 2,
        "description": "Follow the surfaced path which rejoins the old route which came over a level crossing. Bear right towards the ruined castle which is now in clear view ahead; continue on the excellent path to reach it."
      },
      {
        "stage": 3,
        "description": "The castle is entered through a doorway marked 1693. An initial vaulted room leads through into the open courtyard. The main keep - a tower house - was actually built between 1440 and 1460 by Colin Campbell, 1st of Glen Orchy - a branch of the main Campbell clan based in Inveraray."
      },
      {
        "stage": 4,
        "description": "The remains are hugely impressive. You can ascend one of the turrets on the Loch Awe side, but the best views are to be had from the top of the keep. To climb this, go to the right through the courtyard and follow a series of modern wooden staircases to get to the top. The views are magnificent - both down Loch Awe and looking up the loch towards mighty Ben Lui."
      },
      {
        "stage": 5,
        "description": "The castle is usually pretty quiet. It is well worth walking out round to the left of the castle by the shores of the loch. Beyond it grassy ground slopes down into Loch Awe."
      },
      {
        "stage": 6,
        "description": "After you've explored the ruins, return to the start the same way."
      }
    ],
    "scraped_at": 1756310993.9358077
  },
  {
    "title": "Arichonan Clearance Village",
    "summary": "This short walk visits the haunting ruins of Arichonan, a township which was the scene of a riot during the Highland Clearances. The site has fine views down Caol Scotnish.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/arichonan.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 110,
    "start_grid_ref": "NR777910",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the Glean a' Gealbhan (the Glen of Burning) forestry car park off the B8025. Start by heading back up to the road and look out for a yellow marker post on the far side indicating the beginning of the path. This heads through the trees to the right, keeping just above, but parallel, to the road at first. Further on the path curves left uphill. There are great views looking back over Caol Scotnish. Further on the path slopes downhill before bearing right once more."
      },
      {
        "stage": 2,
        "description": "The path crosses a small burn before reaching the start of the abandoned village. In 1848 the landowner terminated the leases of four of the tenant families but when police came to enforce the evictions the villagers, supported by others from surrounding townships, rioted. Eventually several were jailed. The haunting remains of the houses enjoy a beautiful site, with fine views along the narrow channel of Caol Scotnish."
      },
      {
        "stage": 3,
        "description": "It is worth wandering up to the top end of the village, passing above two houses with more substantial remains; note the triangular windows on the upper house. After pondering the past and enjoying the present, return to the steps mentioned earlier, and this time head up them. They climb through the forest and soon reach a vehicle track."
      }
    ],
    "scraped_at": 1756310996.5269518
  },
  {
    "title": "Big Tree walk, Black Gates",
    "summary": "This short forest walk beside the Benmore Botanic Garden climbs between Californian Redwoods, Western Hemlock and Douglas Fir trees for good views across Strath Eachaig and to the hills beyond.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/big-trees.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 120,
    "start_grid_ref": "NS143854",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "This walk starts from the Benmore Botanic Gardens car park where there is a cafe and toilets as well as the famous gardens. From the car park cross the main road to reach the Black Gates forestry sign and an information board giving details on this and several other walks. You could easily link this route with Puck's Glen or the River Eachaig circuit. The route as described here is the shortest, blue waymarked route."
      },
      {
        "stage": 2,
        "description": "Begin by taking the path that begins climbing beside the information board. Almost immediately it reaches a fork; go right here. The path climbs up between the mighty conifers, at one point contouring to the right beneath a high crag. Further on is a huge fallen Silver Fir tree that was brought down in the Boxing Day gales of 1998. It weighs over 10 tonnes and was over a hundred feet tall - containing enough timber to build two wooden chalet houses or 60 garden sheds. The path crosses the trunk on a wooden stairway."
      },
      {
        "stage": 3,
        "description": "Continue along the path, passing a seat and turning left at a fork. There are good views up the glen towards Beinn Ruadh. When the path emerges on a forestry track, turn right. This track passes the starts of several different waymarked paths which head downhill to the right and rejoin the route of the old road which can be followed back to the start, including the celebrated Puck's Glen route; eventually the track links to Kilmun Arboretum. For our route, however, take the next right hand turn, signposted for the Big Tree walk."
      },
      {
        "stage": 4,
        "description": "When the path forks during the descent, keep left. The path eventually leads down to the old road, now a track, in Strath Eachaig. A left turn here would lead to the foot of Puck's Glen and its car park, but to return to the Benmore Garden car park turn right. The track soon leads back to Black Gates and the mighty trees at start of the walk."
      }
    ],
    "scraped_at": 1756310999.1132245
  },
  {
    "title": "Easdale explorer, Isle of Easdale",
    "summary": "Wander around the pretty cottages and old slate quarries then climb to the highest point on the tiny but fascinating car-free island of Easdale. Leave plenty of time to soak up the atmosphere, watch for wildlife or visit the museum or cafe.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/easdale.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.25,
    "estimated_hours": 1.0,
    "ascent_m": 35,
    "start_grid_ref": "NM739170",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "A regular passenger ferry runs between Ellenabeich on the Isle of Seil to Easdale (every half hour except lunch hour - timetable at the harbour). From the slipway on Easdale walk up past the waiting room and then past the community hall and cafe/pub on your left (note all the wheelbarrows which residents use to move items from the boat to the houses)."
      },
      {
        "stage": 2,
        "description": "After the cafe turn left to cross the square of grass towards the museum. Once the centre of the Scottish slate industry in the 19th century with over 500 men working in 7 quarries until storm flooding and a decline in the price of slate caused quarry closures. Slate production ceased in the 1950s and by 1960 there were only 4 people living on the island. That figure is now around 60 with Easdale often cited as an example of island regeneration. The folk museum, situated in the detached white and blue house just beyond the square, holds a wealth of information about life on Easdale."
      },
      {
        "stage": 3,
        "description": "Continue past the museum on a grassy path (wooden railing to the left) onto a rocky promontory overlooking a deep quarry. Head down to the rocky area between 2 quarries (the one on the right being the venue for the annual world stone skimming championship held in September) and then bear right to clamber up a faint path on the natural rock wall between the quarry and the sea - this rocky section can be avoided by short cutting across the green square at the centre of the village."
      },
      {
        "stage": 4,
        "description": "Continue towards an unusual house with a square tower, (all the buildings are made of slate) keeping to the seaward side of the slate garden wall before turning right to pass the far side of the square tower and head back towards the main cottages. At a main slate path turn left and follow it between slate walls bearing right at the next junction to rejoin the main path coming from the jetty and cafe and then immediately left to pass in front of a row of cottages looking out to sea."
      },
      {
        "stage": 5,
        "description": "Keep on the path as it passes a row of cottages with a tree outside and a boat anchorage on your right. Keep right on the slate path as it heads away from the buildings towards the quarries overlooking Easdale Sound. The walking is now on great spoil heaps of slate - bear left on a clear path keeping fairly near the sea to overlook a deep quarry before slightly doubling back to a dip; turn right in the dip on a path that aims for the right hand side (north) of the rocky hill."
      },
      {
        "stage": 6,
        "description": "Cross a dramatic path between two quarries and follow it up steps and round the far side of the hill. Stay on the main path and continue until just beyond a ruined building where a clear path heads away from the sea and soon up a series of steps uphill."
      },
      {
        "stage": 7,
        "description": "Follow the path to the highest point where a view indicator points out the various peaks and islands visible from this wonderful viewpoint. Below the cottages of Easdale and the quarries look peaceful and it is hard to imagine the noise and dust the industry must once have generated."
      },
      {
        "stage": 8,
        "description": "Return back down the hill by the outward route and turn left to continue on the path around the island. This passes through thick undergrowth and a stone wall before passing a cottage and turning left after this to pass between two slate walls and down steps to reach the main village path. Turn right here to return past the cafe and village hall to the ferry jetty."
      }
    ],
    "scraped_at": 1756311001.7013128
  },
  {
    "title": "Port Appin circuit",
    "summary": "An easy-going coastal walk taking in the headland beyond Port Appin with fine views over Lismore and out towards Mull.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/portappin.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.5,
    "ascent_m": 71,
    "start_grid_ref": "NM028538",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start the walk from the ferry car park at the back of the Pierhouse Hotel near Port Appin jetty. Follow the sign for Public Footpath to Clach Thoull around the right hand side of a house and along a track. Pass through a farm gate and continue on the wide track between the high cliffs and the coast."
      },
      {
        "stage": 2,
        "description": "The track curves slightly to the left and passes a bench with a fine view over Lismore, a fertile, green island who's name translates as 'big garden'. As you start to turn the corner of the track, a large arch comes into view - this was formed as a coastal arch before the sea level fell and formed the raised beach below. Just before you reach this, a path bears right through the bracken to the end of the headland. This is a very worthwhile detour with good views over the Lynn of Lorn and the possibility of seeing seals. When you reach the shore at the headland turn left and after a very short while the path heads back left inland and returns to the track just beyond the arch."
      },
      {
        "stage": 3,
        "description": "Having passed the arch, continue on the track as it curves around the headland. The track passes another cave on the left and then another arch which can be easily walked through. The track heads inland following the side of Airds Bay which is a good bird watching spot at low tide. There is also a good view of Airds House across the bay."
      },
      {
        "stage": 4,
        "description": "The end of the track is reached at a house. A sign for Port Appin shows the way around the far side of the house and along a path between woodland and a fenced field. Continue along this path until it goes through a metal kissing gate and emerges onto a minor road. Turn left along the road and left again at the next junction."
      },
      {
        "stage": 5,
        "description": "The road passes Port Appin village hall with its interesting display in the old lighthouse lantern adjacent to it. The display has information about Port Appin's history and industry and a great photograph of the lighthouse painted pink and yellow with a sad face as part of the campaign to stop it being replaced by a modern solar powered lighthouse. Continue along the road passing two shops including one offering cake and teas, until the ferry jetty is reached at the start of the walk."
      }
    ],
    "scraped_at": 1756311004.296508
  },
  {
    "title": "Barnluasgan Oakwood, Beaver trial site",
    "summary": "This very attractive walk climbs to a low ridge, richly forested with ancient oaks and birches, looking out over the scattered lochs and great forests of Knapdale. The route lies within the Scottish Beaver reintroduction trial area.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/barnluasgan.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.5,
    "ascent_m": 125,
    "start_grid_ref": "NR790909",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a well-signed Forestry and Land Scotland car park (charge) at Barnluasgan (not the Wildlife Information Centre signed with a beaver sign earlier from the road). Before beginning the walk it is worth visiting the log cabin which has information about the beavers and the forests of the area. This route follows the green waymarked trail at first before finishing on the blue trail on the far side of Loch Barnluasgan. Begin on the clear path which heads to the right hand side of the loch. After a short distance a faint path heads off into the trees on the right - ignore this, and pass the small boat mooring point."
      },
      {
        "stage": 2,
        "description": "Slightly further on a (waymarked) flight of steps leads up to the right. Turn up these steps, which give a steep, winding climb with good views back over Loch Barnluasgan. The birch trees soon give way to old oaks; at the top of the climb the path begins to run along a fine wooded ridge, with glimpses of Loch Linne down through the fine trees on the right."
      },
      {
        "stage": 3,
        "description": "Continue along the undulating ridge, eventually climbing slightly to reach a wooden bench with particularly fine views. From here the path heads left and begins the descent. This is marginally less steep than the way up, but still involves several flights of wooden steps. Soon the path passes through a gate in a deer fence and a grand view of Loch Barluasgan opens up ahead. Pass through a second gate as the steps lead back down to the all-abilities path close to the loch shore."
      },
      {
        "stage": 4,
        "description": "The quickest way back is to turn left but the walk can be slightly extended by turning right and passing round the far side of the loch. Almost immediately there is a wildlife hide overlooking the loch just to the left. Keep on the surfaced path that leads round the loch to return to the car park."
      }
    ],
    "scraped_at": 1756311006.8795164
  },
  {
    "title": "Puck's Glen",
    "summary": "Deservedly the most popular short walk in the region, Puck's Glen is a dark and atmospheric defile. A tumbling burn, criss-crossed by bridges, is enclosed by rocky walls heavily hung with mosses and overshadowed by dense trees.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/pucks-glen.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.5,
    "ascent_m": 126,
    "start_grid_ref": "NS146839",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Begin from Puck's Glen car park. There is an information board giving details of various waymarked routes; this description follows the Red route. It is also possible to link the walk with several others from different car parks, including the Big Tree walk and River Eachaig circuit from the Benmore Garden car park, and the Kilmun arboretum walk from near Kilmun. Begin the walk by following the old road to the north (to your left with the main road behind you), now a wide forestry path, passing behind a large complex of wooden chalets. After just under half a kilometre turn right onto the start of the path up Puck's Glen beside an old mile marker post. The path up Puck's Glen was built by the Youngers brewing family but fell into disrepair before being restored in 1986. This path starts up the right side of the burn at first but crosses it many times on footbridges."
      },
      {
        "stage": 2,
        "description": "The burn is broken by many small waterfalls, and the path edge above them is often unprotected so care is needed with children. The route climbs several short flights of stone steps whilst the steep and rocky sides of the gorge are heavily draped with mosses and ferns, as well as being shadowed by the dense forest."
      },
      {
        "stage": 3,
        "description": "There are handrails on the steepest sections of the path which has been expertly constructed to wind its way upstream. Eventually a junction is reached, with a sign indicating the 'Lower Glen' just visited, and the 'Upper Glen' ahead, whilst a path off to the right short-cuts the walk by heading back to the car park. Continue into the Upper Glen, descending briefly before crossing yet more bridges. There was once an ornate hut known as Puck's Hut built in the glen to heighten the drama, but it has now been moved to the Benmore Botanic Garden where you could visit it after finishing the walk."
      },
      {
        "stage": 4,
        "description": "There are several more waterfalls; this section of the path involves less climbing than the lower part of the glen."
      },
      {
        "stage": 5,
        "description": "Continue ahead to eventually emerge into daylight at a forestry track at a junction. Straight ahead is the Upper Puck's Loop. A left turn eventually enables a link with the Big Trees walk; several other waymarked paths leads off to the left from this track enabling routes of various length before returning to the car park along the old road. A right turn enables a link with the walk at Kilmun Arboreturm. For our route, turn right along the track at first. The waymarked return route soon forks off to the right (the rightmost of two paths going off to the right at the same point)."
      },
      {
        "stage": 6,
        "description": "This broad path gives some good views of the wide strath to the left at first before heading into the tall pines. After some descent a path junction is reached by a seat; the short-cut path from half-way up Puck's Glen comes in from the right here. Turn left to continue the descent, eventually crossing a hump-backed wooden footbridge and returning to the car park."
      }
    ],
    "scraped_at": 1756311009.47962
  },
  {
    "title": "Torinturk and Dùn a'Choin Dhuibh",
    "summary": "This short forestry circuit visits some fascinating archaeological remains including a hill-top Dun or iron-age fort with stunning views.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/torinturk.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 4,
    "distance_km": 2.5,
    "estimated_hours": 1.0,
    "ascent_m": 120,
    "start_grid_ref": "NR808640",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the Torinturk Forestry car park which is up a rather rough and rutted lane from Torinturk village - be careful not to ground your car! Start the walk along the waymarked left hand track from the car park. This runs across the densely forested hillside."
      },
      {
        "stage": 2,
        "description": "The track (really no more than a broad grassy path) ends at a turning area, and the walk continues uphill to the right on a much smaller path. This soon climbs to reach the Achaglachgach Cairns. The larger of these two ancient burials is neolithic, thought to date back as far as 4000 - 2000 BC. The smaller cairn, which is known locally as Diarmid's Grave after a Celtic hero, is bronze age - 2500 - 600 BC, and is marked by a distinctive triangular upright stone. The grassy path continues to the right of the cairns."
      },
      {
        "stage": 3,
        "description": "The path climbs up past a bench and bears right once more level ground is reached; not much further on, it starts to descend. Soon a marker indicates the start of a path off left signed for Dùn a' Choin Duibh. Take care to stay on the path as it winds up through the trees, then bears right. It meets the original path up to the Dùn at a t-junction; turn left up a very steep grassy path to reach the top. Here a bare, heathery hilltop is crowned with the impressive remains of the stone fort. Along the wall to the left is a small doorway which may have led to a small chamber. Local legend has it that this housed a black wolfhound bitch which guarded the Dùn and gave it its name, which means the Fort of the Black Dog."
      },
      {
        "stage": 4,
        "description": "Pass around the wall to the right to reach the inner part of the Dun, with views over West Loch Tarbert to the mountains of Arran. The only descent route from the Dun itself is back the way you came, taking care on the steep grass; you can continue down to the track on the original old path which is clearer than the waymarked one. Once back on the track turn left to continue the walk. Turn right when a larger track is reached and follow this back to the car park at the start."
      }
    ],
    "scraped_at": 1756311012.0613987
  },
  {
    "title": "Sutherland's Grove forest walks, Barcaldine",
    "summary": "This walk follows a waymarked trail through the forest, leading up through a fine gorge. The return route follows tracks and paths to complete a circuit through the forest.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/glen-dubh.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.7,
    "estimated_hours": 1.0,
    "ascent_m": 60,
    "start_grid_ref": "NM965421",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the Sutherland's Grove forestry walks car park (parking charge); this route is waymarked in blue as the Troll Trail - there are also a couple of shorter waymarked walks. Do not cross the stone bridge at the far end of the parking area, instead beginning the walk by turning left onto the footpath (waymarked in all colours) that begins next to the bridge, following the burn uphill. The path runs through some picturesque woodland with giant Douglas Firs as well as oak, birch, beech and rowan, and there are some pretty waterfalls in the stream alongside."
      },
      {
        "stage": 2,
        "description": "Soon the stream issues from a small gorge and the fairly rough path runs along the edge giving good views of the tumbling water. A path junction is reached; turn right, following the blue route, to descend steps and cross the bridge over the gorge; it gives great views of the rocky stream bed."
      },
      {
        "stage": 3,
        "description": "Continue following the path which now climbs gently through the trees. Ignore a path off to the right, instead curving left and eventually reaching a forestry track. Turn left along this."
      },
      {
        "stage": 4,
        "description": "At the next junction keep left again, following the track downhill. Keep straight ahead to cross a bridge over the burn, then keep ahead again at each of three junctions where tracks lead off to the right."
      },
      {
        "stage": 5,
        "description": "Shortly before the track emerges at a road turn left on a surfaced path. Look out for a blue waymarker indicating where to leave this and take a narrower path through the trees. Keep straight ahead when this crosses a cycle path, and again across the entrance track to Sutherland's Grove. The path now leads to the riverbank and then heads left along it to return to the start, passing some magnificent fir trees planted in the 1870s."
      }
    ],
    "scraped_at": 1756311014.645088
  },
  {
    "title": "Gleneck Viewpoints walk, Glenbranter",
    "summary": "This waymarked trail climbs high above Glenbranter through native forest, giving superb aerial views over the glen and away to the head of Loch Eck.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/gleneck.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.75,
    "estimated_hours": 2.0,
    "ascent_m": 180,
    "start_grid_ref": "NS110977",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins at the Forest & Land Scotland car park in Glenbranter. Several circular routes are waymarked from here; this trail is marked throughout in green. Start the walk up the path from the posts by the visitor centre. The path heads up some steps; go left (marked in all colours at a junction), then right (waymarked in green only) to pass a picnic bench. A turning area is reached; follow the track ahead, ignoring a track coming in from the left, which is used on the return, and instead continue for a couple of hundred metres to where a made path on the left is waymarked with a green marker post. Head up this path."
      },
      {
        "stage": 2,
        "description": "The path climbs steeply, swinging left and right in a series of zig-zags and giving improving views back over Glenbranter. A bench provides an opportunity for a rest part way up, whilst further on the path rises again up a flight of wooden steps. Looking back the view now stretches as far as the head of Loch Eck. The going levels off slightly as the path rounds an area of much sparser trees. The memorial in view on the right commemorates Queen Victoria's Diamond Jubilee."
      },
      {
        "stage": 3,
        "description": "The path now curves round to the left below the steep crags of Creag Bhaogh. There is another seat with grand views down through the native trees towards Loch Eck."
      },
      {
        "stage": 4,
        "description": "The path climbs steeply once more - with good views back - before becoming a track and beginning to descend gradually. After some distance a junction is reached; turn sharp left down the track here to continue the descent."
      },
      {
        "stage": 5,
        "description": "At the next marked junction a path waymarked in yellow, red and blue goes off to the right - this leads eventually to the Allt Robuic Waterfalls walk visiting a gorge which is well worth doing if you have the time. Otherwise, continue ahead down the track, ignoring another path off to the right, to eventually return to the access track for Glenbranter car park. Turn right here to return to the car."
      }
    ],
    "scraped_at": 1756311017.243601
  },
  {
    "title": "Stonefield Castle and Barmore Island",
    "summary": "Stonefield Castle dates back to 1837 and is now a hotel. The walk descends through the gardens to make an idyllic round of Barmore Island.",
    "source_url": "https://www.walkhighlands.co.uk/argyll/stonefield-castle.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 12,
    "distance_km": 2.75,
    "estimated_hours": 1.0,
    "ascent_m": 60,
    "start_grid_ref": "NR653490",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the very impressive Stonefield Castle Hotel, where tea and coffee is served as well as lunches and accommodation; parking is courtesy of the hotel. Begin the walk by heading down the steps to the right of the hotel, leading into the gardens. Almost immediately the path reaches a junction; head to the left first (signed for the harbour and jetty)."
      },
      {
        "stage": 2,
        "description": "The path heads through a fabulous collection of rhododendrons before it soon crosses a track. The route eventually heads to the right along this but first continue on the path straight ahead to visit the jetty or harbour. There is a bench here which provides the perfect spot to enjoy the lovely views of Barmore Island and across to Kintyre."
      },
      {
        "stage": 3,
        "description": "After enjoying this lovely spot, return to the track just crossed and turn left. Another left turn leads down to the shore once more at a second stunning spot for a break, again with a bench. Otherwise, turn left at the following junction, following a track across a bridge and heading out onto the grassy neck of land that connects the so-called Barmore island with the mainland. Join a track coming in from the right, and head out to Barmore."
      },
      {
        "stage": 4,
        "description": "Once on the 'island' turn right onto an idyllic footpath along the near shore. After a short distance through this heads down to and then runs along a rocky shore - which may be water-covered at high tide. At the far end of this the path climbs up steeply to the left to cross over to the far side of Barmore."
      },
      {
        "stage": 5,
        "description": "Follow the path down on the seaward side of the island and then follow it as it runs around the shore to the left. This is a very peaceful spot, with views across to the Cowal peninsula. Continue round the northernmost part of the island and past two monkey puzzle trees on the way back to the grassy isthmus, with Stonefield Castle looking impressive ahead."
      },
      {
        "stage": 6,
        "description": "Head back across the isthmus, bearing right, and then following the sign which cuts more directly up through the rhododendron gardens to return to the hotel."
      }
    ],
    "scraped_at": 1756311019.9087927
  },
  {
    "title": "Rhue Lighthouse, near Ullapool",
    "summary": "A short and easy walk to Rhue lighthouse with good views down Loch Broom and out to sea including to the Summer Isles. Can be combined with a walk up the road and track to the mast on Meall Mòr to make a longer walk.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/rhue.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.2,
    "estimated_hours": 20.0,
    "ascent_m": 32,
    "start_grid_ref": "NH097973",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "From the car park at the end of the public road in Rhue take the path heading down towards the coast. Go through a wooden kissing gate and follow the grassy path, which can be boggy in places."
      },
      {
        "stage": 2,
        "description": "The path skirts the coast, passing above a nice pebbly beach on Loch Broom. The path crosses a small stream and undulates as it heads towards the lighthouse visible against the sea behind. The lighthouse provides a good vantage point looking up Loch Broom towards Ullapool or seawards towards the Summer Isles. The shapely mountain of Beinn Ghobhlach is directly across Loch Broom whilst Ben More Coigach forms an impressive wall to the north. It is possible to walk a short distance north west along the coast for some different views."
      },
      {
        "stage": 3,
        "description": "The return route is by the same outward path. A longer walk can be made by walking (or driving) back along the Rhue road to the point where the track descends from the mast at the top of Meall Mòr . The walk up to the mast takes approximately 40 minutes and provides a fine viewpoint on a good day."
      }
    ],
    "scraped_at": 1756311022.4918826
  },
  {
    "title": "Lael Forest Garden and forest walk",
    "summary": "An easy and pleasant walk taking in the Lael Forest Garden with its 200 different tree species together with a longer plantation section with waterfalls.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/lael.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.75,
    "estimated_hours": 1.0,
    "ascent_m": 60,
    "start_grid_ref": "NH196810",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There are 2 car parks for Lael Forest, this walk starts from the north one, opposite the sign for the Woodturner. From the car park and picnic site it is worth first heading up the steps at the back of the car park and along the path to view a lovely waterfall. Return to the car park and go over the bridge and through the gate on the left hand side (as you face the road) to enter the Lael Forest Garden. Before Forestry & Land Scotland took it over in 1929 the land belonged to tree enthusiasts who had collected species from all over the world. Now over 200 species are represented and sign boards identify the different trees including giant redwoods and cricket bat willows."
      },
      {
        "stage": 2,
        "description": "Turn left almost immediately to head uphill through the woods passing a Tulip tree from the USA on your right. At the next junction turn left again, continuing to gain height. The route passes through Lawson cypress which is the predecessor to the most commonly planted garden conifer today. Continue as the path meanders through the trees and turns downhill to reach a gate at the far end of the forest garden."
      },
      {
        "stage": 3,
        "description": "Go through the gate into the other car park and picnic area. From the car park take the path on the left, with a green and red marker post, to enter the forest. Keep heading uphill at a junction. At the right time of year many species of fungi can be found in this section of woodland."
      },
      {
        "stage": 4,
        "description": "Eventually the path reaches a forest track. Turn left along this, continuing gently uphill until the track crosses a bridge over a gorge. On the far side turn left down steps onto a path - waymarked red - downhill. This gives glimpses into the gorge on the descent back to the car park."
      }
    ],
    "scraped_at": 1756311035.0772405
  },
  {
    "title": "Knockan Crag trail",
    "summary": "This interpretative trail brings the geology of the Moine Thrust to life as the path climbs past the exposed rocks and up onto the top of the Knockan Crag. From here there are spectacular views over Assynt. The trail includes sculptures and poetry as well as places to sit and a treasure hunt for younger children.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/knockancrag.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 1.0,
    "ascent_m": 185,
    "start_grid_ref": "NC188091",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "From the car park walk up to the hexagonal visitor centre with its turfed roof. Here there is an explanation of the Moine Thrust, why one type of rock 500 million years older ended up being thrust upwards to lie above another band of rock. From the centre follow the path and at a junction keep to the lower path, marked Trails."
      },
      {
        "stage": 2,
        "description": "The trail passes a pipe rock display explaining that the white tubes seen in the rock here are fossils of pipe worms. The path continues upwards, turning left at a junction and climbing to pass Jo Smith's impressive Globe sculpture on the right."
      },
      {
        "stage": 3,
        "description": "Soon the path crosses a small wooden bridge, continue upwards following a sign for Moine Thrust. Eventually you reach an area where the two rock bands are exposed."
      },
      {
        "stage": 4,
        "description": "Continue on the path as it climbs up the crag on well made stone steps. From this section there are lovely views back over the Inverpolly area."
      },
      {
        "stage": 5,
        "description": "A short diversion to the left takes you to a viewpoint at the northern end of the trail. From here you can see out over Assynt, with Suilven and Canisp both prominent. Backtrack to the main path and follow it along the top of the crag. Part way along there are particularly good views of Lochan an Ais below and wee Stac Pollaidh in the distance between Cul Mòr and Cul Beag."
      },
      {
        "stage": 6,
        "description": "The path passes another short diversion to the left to the Eagle Stone viewpoint and then descends in a series of zig zags back to the car park."
      }
    ],
    "scraped_at": 1756311037.6628993
  },
  {
    "title": "Nigg Church and the Bishops' walk",
    "summary": "Nigg Church is well worth a visit to see the stunning Pictish carved cross-slab inside. The walk is a short one, looping down from the church to the shores of Nigg Bay along an ancient route by the burn. The Bishop of Ross is said to have sailed from his seat in the Black Isle to his summer holiday home at Nigg, coming ashore at Nigg Bay and using the path now known as the Bishops Walk.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/nigg-bishops.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 25,
    "start_grid_ref": "NH847239",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at Nigg old church. The walk begins through the gate into the graveyard. There has been a church here since the thirteenth century, and the present building dates back to 1626. It is well worth wandering around the graveyard to see some fine medieval graveslabs, dating back to the 1300s."
      },
      {
        "stage": 2,
        "description": "The church is open from 10am - 5pm April to October. Do not miss the chance to explore inside, as in the far room is the amazing 8th century Pictish cross-slab. Standing two metres high and a metre across, the slab once stood in the graveyard but has been moved inside to protect it. The rich and intricate carvings include what is one of the earliest depictions in Britain of the Eucharist or Mass."
      },
      {
        "stage": 3,
        "description": "Go through the gate to the right of the church to reach the rear graveyard. A path leaves through a gate in the far right corner. Pass alongside a wall and then keep left. The path swings left and then back right through the trees. At a fork, ignoring a path rising to the left (used on the return) and keep along the path through the bottom of the wooded dell. The path can be a little wet - and overgrown in late summer."
      },
      {
        "stage": 4,
        "description": "Eventually it crosses a wooden footbridge over the burn, and then further on crosses back. Turn right here to follow the path down to a gate where it emerges on the road by the shore of Nigg Bay. There are extensive views across the Bay and the Cromarty Firth, with the distant mountains often rising behind the oil rigs which are serviced and maintained here. There is an RSPB hide around 1.5km along the road to the east."
      },
      {
        "stage": 5,
        "description": "Retrace your steps to the last footbridge, but this time continue up the right side of the burn. The route follows a high bank above the river which may be part of an old causeway. Eventually the path descends to rejoin the outward route. At the fork near the church bear left to head down to a footbridge, crossing this and reaching the road just beyond some picnic tables. The church and the start of the walk are just to the right."
      }
    ],
    "scraped_at": 1756311040.314358
  },
  {
    "title": "Tain Hill and Pulpit Rock",
    "summary": "A short and easy walk to the top of Tain Hill which has good views over the Cromarty and Dornoch Firths.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/tain-hill.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 40.0,
    "ascent_m": 78,
    "start_grid_ref": "NH752812",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk can be done from Tain (adding 3km each way) by turning uphill near the Tolbooth and heading up Craighill Terrace passed the primary school, then crossing the A9 and continuing up Jubilee Road to the car park. From the car park follow the path uphill marked by a red marker post.  The path soon passes a picnic table."
      },
      {
        "stage": 2,
        "description": "The path climbs between a fence and a dyke, through mixed pine woodland with some open views in places. As the trees thin out, the woodland is mainly old Scots Pine. The path skirts round the remains of a long disused quarry which provided the stone for many of Tain's buildings - including the Tolbooth - and was considered when searching for suitable stone for the Houses of Parliament. The path passes through a more open area with good views of the surrounding countryside and sea."
      },
      {
        "stage": 3,
        "description": "Climb steadily to reach the Pulpit Rock and a wooden picnic bench, an excellent viewpoint over Tarbat Ness and the Dornoch Firth. The large rock - thought to be a glacial erratic - is an impressive landmark with concrete steps leading to its flat top."
      },
      {
        "stage": 4,
        "description": "From here retrace a couple of steps and turn right to head downhill following the red marker posts. The path passes along the edge of a cleared area and then swings left (ignoring muddy tracks off) into the woodland. When the path emerges at a track turn left and follow this until a gate marks the return to the car park."
      }
    ],
    "scraped_at": 1756311042.89816
  },
  {
    "title": "Clashnessie Bay and Falls",
    "summary": "Clashnessie Bay has a very fine sandy beach, one of few in Assynt to face north. Its name comes from the Gaelic Clais an Easaidh - the Channel of the Waterfall - and the falls which give the name make for a short if boggy hike. The Clashnessie Falls are 15m high and are most impressive when in spate.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/clashnessie-beach.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.25,
    "estimated_hours": 45.0,
    "ascent_m": 45,
    "start_grid_ref": "NC057308",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the layby by Clashnessie beach on the B869. The beach here receives fewer visitors than the better known Clachtoll or Achmelvich further south, and is a truly stunning spot for relaxing, though the sea is usually bitingly cold."
      },
      {
        "stage": 2,
        "description": "Begin the walk by heading west along the road. Soon it crosses the bridge over the burn - the Clais an Eas. Note the ruined mill down on the right, where grain would once have been brought for processing. Continue along the road as it climbs uphill, passing a phone box."
      },
      {
        "stage": 3,
        "description": "Eventually a wooden signpost indicates the route 'To the falls' - cutting a grassy corner to meet a track. Head left along the track, and when it forks take the left branch."
      },
      {
        "stage": 4,
        "description": "The track ends at a whiteashed cottage by the burn. Just before reaching it, turn left to cross the burn via rough stepping stones, then turn right along the far bank. There is a path, but it is often wet underfoot; it quickly leads to the foot of the waterfall which has been in view for some distance. With a single drop of around 15m, the falls are very impressive when in spate (pictured here in dry summer conditions). The return walk is the same way, but if you wish you can cross the burn and take a path up through the bracken to reach the top of the falls, before heading back."
      }
    ],
    "scraped_at": 1756311045.5031466
  },
  {
    "title": "Leitir Easaidh all-abilities path, Little Assynt",
    "summary": "There are few walks in the northwest set-up for wheelchairs (and those who don't want to get wet boots!) so Leitir Easaidh is all the more welcome. This trail visits two lochs with picturesque shelters and toilets, and has stunning views across this wild landscape to the surrounding mountains.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/leitir-easaidh.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 45.0,
    "ascent_m": 25,
    "start_grid_ref": null,
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the Leitir Easaidh car park which is signed on the A837. The walk has been developed by the Culag Community Woodlands Trust who own both the Little Assynt estate and the Culag Woods in Lochinver. The walk begins along the surfaced path, passing an interpretative board and a map of the trail before passing through a gate. As it nears the two small buildings it forks, with the right fork giving access to the buildings and the loch of Leitir Easaidh. The thatched hut with a wind-turbine and solar panel is an eco-friendly composting toilet, whilst just beyond is a shelter and a pier giving access to boats available for fishing on the loch (permit required). There are grand views to the great mountain wall of Quinag."
      },
      {
        "stage": 2,
        "description": "Further on the trail forks. The first fork on the right leads down to the lochside, whereas a second fork on the right further on crosses a bridge and passes a picnic area to reach a further lochside spot - worth the detour. Otherwise keep left at both forks to follow the main trail."
      },
      {
        "stage": 3,
        "description": "The trail leads to the shores of the second loch, Loch na h-Innse Fraoich, which also has a shelter, jetty and toilet. The path forks here - both ways lead to the same viewpoint so this part of the walk is a loop. Keep to the right branch for the outward walk."
      },
      {
        "stage": 4,
        "description": "The path climbs up a little from the loch to reach another fork. Go right here at first, then left (this second right is a link path to the Little Assynt route further along the road). The path now ends at a viewpoint. Quinag looks impressive, but the viewpoint also looks south towards the strange ridge of Suilven across Loch Torr an Lochain. On the way back keep right at both junctions to follow the alternative route back to the second toilet. From there retrace your steps back to the start."
      }
    ],
    "scraped_at": 1756311048.1044333
  },
  {
    "title": "Culag Woods, Lochinver",
    "summary": "Culag Woods on the edge of Lochinver are owned and managed by a local community trust and have been made into an excellent facility for short family walks. There are some lovely views.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/culag-woods.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 120,
    "start_grid_ref": "NC092222",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Lochinver is a busy working port as the large warehouse buildings around the harbour testify. Culag Woods offer an easy escape from this hive of activity. The walk is described from in front of the Culag Hotel on the harbour in Lochinver; there are dedicated car parks for the woods on the road towards Inverkirkaig. From the Culag hotel, continue along the road further through the harbour area. After passing the lifeboat station, look out for a wooden signpost for 'Culag Woods' and 'Billy's Path' going off to the left - it is set back slightly from the road and could be easily missed."
      },
      {
        "stage": 2,
        "description": "Billy's Path climbs up through the woods, curving round to the left, and gives a view back over Lochinver - slowly becoming blocked by trees. The path bends right and then reaches a junction by a wishing tree; take the left path (ignoring the one signed as Anna's Path). The rough path now continues through the lovely mixed woodland, going up a flight of stone steps at one point and crossing a wooden boardwalk at another."
      },
      {
        "stage": 3,
        "description": "Ignore the 'higgledy-piggledy' path off to the left and the path off right, and instead continue ahead up some rough wooden steps. Eventually the path reaches a signed junction with a larger path; you'll return to this point, but first turn right to visit the White Shore. Continue along the path until it reaches this pebble beach, and then return to the junction."
      },
      {
        "stage": 4,
        "description": "This time keep ahead. When another path is reached go left, then turn right at a signed junction for the 'Viewpoint' - with a teepee visible over to the left. The path reaches a boardwalk off to the right that gives access to a viewing area out on the forest bog - a great spot for looking for dragonflies. Return to the path and continue to another junction, this time turning left (signed for the viewpoint again)."
      },
      {
        "stage": 5,
        "description": "The path to the viewpoint can be muddy in places and ascends to and fro before reaching the top of the little hill. There's a seat with a view over Lochinver; continue through the trees to reach another seat, this time with a view of Suilven's improbable dome dominating the scene. Return back down the path, turning right to return to the teepee junction. This time turn right past the teepee to continue the walk."
      },
      {
        "stage": 6,
        "description": "The path leads through the attractive woodland. Ignore the 'higgledy piggledy' path off to the left and continue, joining a track and bearing right uphill on this. Pass some gas storage tanks and then fork left at the junction. The track now leads downhill passing workshops and the bunkhouse and cafe before arriving back at Lochinver harbour."
      }
    ],
    "scraped_at": 1756311050.6932871
  },
  {
    "title": "Clachtoll Beach and the Broch",
    "summary": "This lovely short walk includes a visit to beautiful Clachtoll beach with its perfect sand and the crumbling iron-age broch of An Dùn.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/clachtoll-beach.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.5,
    "ascent_m": 40,
    "start_grid_ref": "NC039273",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a car park for Clachtoll beach. Before beginning the walk you could visit the small Rangers' hut to find out more about what you can see along the way. Start by heading past the toilet block; when you reach a track continue straight ahead onto a wooden boardwalk. This leads down to Clachtoll beach, a truly stunning spot, famed for the split rock beyond the far end of the bay. After enjoying the sands, return to the path and head through a gate to reach the former salmon bothy."
      },
      {
        "stage": 2,
        "description": "The poles outside were erected for drying the drag-nets used to catch the fish. If it isn't locked, the bothy has interpretative displays inside to help you find out more. There are great views back over the beach, with Stac Pollaidh and other peaks visible beyond. Continue the walk by heading to the left of the gate decorated with pieces of driftwood. Continue by the wall until there's a small gate provided for walkers on the right."
      },
      {
        "stage": 3,
        "description": "Cross the track to another walkers gate, then keep left alongside the stone wall (with Clachtoll Cottage over to your left) to reach another small gate; again go through this and then follow the path that slopes uphill to the left to reach open grassland. Continue round the coast, keeping above the rocks that shelve down into the water - there are some huge slabs."
      },
      {
        "stage": 4,
        "description": "On the next section you may notice the grassland is formed into little ridges. These are the remains of lazybeds, once worked for crops and fertilised with seaweed. There are great views looking back along the coastline to the beach and mountains. Continue ahead towards what looks at first like a massive mound of stones."
      },
      {
        "stage": 5,
        "description": "The stones are the remains of Clachtoll broch, an iron-age defensive tower. Pass to the right of the broch and then detour left to head up to the entrance, still roofed with giant lintel stones. The interoir has been cleared in recent years and you can see the passageways and staircases within the double walls."
      },
      {
        "stage": 6,
        "description": "From the broch you can either return the way you came, or alternatively continue along the coast next to the fence which is rough going across boulders with the Bay of Stoer ahead. Though pebbly at high tide, there are extensive sands here when the sea is out. Continue until a tiny burn and then turn right along the near side of this, crossing two stiles, to reach the road. Turn right again on this; further along a sign indicates the turning back to the car park at Clachtoll beach."
      }
    ],
    "scraped_at": 1756311053.2821863
  },
  {
    "title": "Tobar na Slainte, Shandwick",
    "summary": "Park at any of the beach car parks in Shandwick; the one at the west end is the most convenient for this route. This is reached by turning down a very narrow lane (signed 'Beach') from the main street. Begin the walk by turning right from the car park (facing the sea) and following a path along the grass above the beach. The beach itself is a magnificent stretch of sand, bounded at its western end by Ballintore harbour.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/tobar-na-slainte.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 70,
    "start_grid_ref": "NH859750",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at any of the beach car parks in Shandwick; the one at the west end is the most convenient for this route. This is reached by turning down a very narrow lane (signed 'Beach') from the main street. Begin the walk by turning right from the car park (facing the sea) and following a path along the grass above the beach. The beach itself is a magnificent stretch of sand, bounded at its western end by Ballintore harbour."
      },
      {
        "stage": 2,
        "description": "Continue along the grassy path for some distance. The grass becomes tall marram grass, and you may prefer to walk on the sands alongside. Be careful to keep glancing to the fence on the right, as you could easily miss the crucial stile at a corner in the fence. Cross the style and turn left on the grassy path on the far side, keeping left when the path forks. At the end of the field the path crosses another stile."
      },
      {
        "stage": 3,
        "description": "Beyond the stile is a wooden bench, complete with comic 'bus stop' sign. The route on from here is very rough at first; the path ascends diagonally beyond the seat to continue at a slightly higher level. A little further on the path is protected by a rope and mesh fence. The path surface is badly worn in places and care is needed."
      },
      {
        "stage": 4,
        "description": "The path now descends to reach a flat area, with more rustic seating. Steps lead down to the beach here, and a very short distance to the right is the Tobar na Slainte or the Well of Health. This consists of a small stone-trough built on a spring, but damaged by high tides. According to local folklore water from the well, if 'silvered' by the addition of a silver coin to a ladel-full, could cure one who had been cursed by the 'Evil Eye' or ill-luck. The cure only worked if the person who brought them the water made the journey to and from the well without speaking to another soul - so if you've met anyone who didn't return your greeting, they may have an excuse."
      },
      {
        "stage": 5,
        "description": "Whilst the well is unspectacular, it has a beautiful situation on its own secluded sandy beach, well hidden from houses and roads. The sea however can only be reached across rocks. To return to Shandwick, go back the same way. When leaving the village, be sure to stop and visit the remarkable Pictish scultped stones nearby. One is close by the road climbing from the west end. It is easy to spot as it has had a glass enclosure built round it to protect it from erosion; the stone dates from 780AD and the carvings are exquisite. There is another fine stone just east of Shandwick at Hilton of Cadboll."
      }
    ],
    "scraped_at": 1756311055.8692229
  },
  {
    "title": "Aldie Burn, near Tain",
    "summary": "This easy forestry walk is popular with local dog-walkers. The surface has been improved to make it suitable for many prams and wheelchairs.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/aldie-burn.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 45,
    "start_grid_ref": "NH756791",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "From the forestry car park start the walk along the clear path marked by blue and red marker posts. The start of the walk is through plantation pines which have been cleared next to the path. Cross straight over a track, keeping an eye out for cyclists as the track is part of a mountain bike route. When you come to a fork keep left following the blue marker posts. The other way is a much shorter route."
      },
      {
        "stage": 2,
        "description": "The path now crosses any area of older pines. A second fork is reached, this time keep right and soon you reach a cleared area with remains of a croft house visible. This was Mineral Bank, and a family tried to make a living on the land here as late as the 1920s - but it simply proved too difficult. Keep on the main path which heads slightly downhill."
      },
      {
        "stage": 3,
        "description": "Soon the Aldie Burn is reached and crossed on a wooden bridge. Immediately after the bridge turn right and follow the burn back into the woods, passing a seat. Amongst the pines, the path has been marked with large stones. Keep right at two forks. The path then zig-zags down to the stream and passes a picnic table."
      },
      {
        "stage": 4,
        "description": "Follow the Aldie Burn downstream until you reach a bridge. This crosses to a picnic area and small wildlife pond. Keep on the left side of the stream and follow the path through the trees. Eventually it emerges onto a forestry track. Turn right here and follow the track watching out for bikes. Turn right at the next junction to return to the outward path. Turn left onto the original path and return to the car park."
      }
    ],
    "scraped_at": 1756311058.4561677
  },
  {
    "title": "Lochanan nan Tunag, Kildary",
    "summary": "A visit to the site of some old gravel quarries behind doesn't sound very promising; nature has now taken over the old ground however, and the loch itself is very beautiful, particularly in the autumn months.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/kildary.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.25,
    "estimated_hours": 1.0,
    "ascent_m": 18,
    "start_grid_ref": "NH767750",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at Kildary near Ken's Garage; there is plenty of space along the road to the right in front of the houses. The walk begins by following the lane that begins right next to the garage. It curves round to the right and has a sign for 'Public Path to Logie Hill'. Continue to the end of the lane where the path (now signed 'Kildary Loch') continues ahead through the trees. After a short distance the route reaches an overgrown gate where a path heads left; our route goes straight ahead, but you can bypass the gate on the left side before rejoining the line of the original path. It now continues through young native trees and scrub."
      },
      {
        "stage": 2,
        "description": "After nearly a kilometre the path reaches a gravelly track. Continue straight ahead across this, soon crossing a metal footbridge. Beyond the path leads up a flight of steps to reach the side of Lochanan nan Tunag (also known as Kildary Loch) beside a boatshed. The loch is owned by a local angling club who have created a circular trail around the shores. It is attractively fringed with pines and is a good place for spotting wildfowl. Turn left and follow the lochside path which undulates through the trees."
      },
      {
        "stage": 3,
        "description": "The path passes various (private) fishing spots named by boards on the trees; at the furthest end it reaches 'Poacher's Corner' and swings round to return via the northern shores. Complete the circuit to the boatshed and descend the steps to return to the gravel track mentioned earlier."
      },
      {
        "stage": 4,
        "description": "Go straight across the track to retrace your steps back on the path through the scrubby young woodland to Kildary."
      }
    ],
    "scraped_at": 1756311061.041688
  },
  {
    "title": "Corrieshalloch Gorge, Braemore Junction",
    "summary": "Test your head for heights on the dramatic bridge and viewing platform suspended over this dramatic gorge, while the water surges many metres below your feet. The surrounding walk has spectacular views of waterfalls and the open countryside towards Loch Broom.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/corrieshalloch.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 45.0,
    "ascent_m": 87,
    "start_grid_ref": "NH208776",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the National Trust for Scotland's Corrieshalloch Gorge gateway centre and car park, a short distance W from Braemore junction; there is a parking charge, toilets and a kiosk / cafe. Note that the car park is closed outside the cafe opening hours; there is a small layby just W, or an overflow car park just under 1km further west (with access to the walk at ). From the gateway centre, take the path that soon runs beside the burn, the Abhainn Droma. It flows over rocky slabs through the pinewoods, with little hint of the drama to come."
      },
      {
        "stage": 5,
        "description": "The walk begins from the National Trust for Scotland's Corrieshalloch Gorge gateway centre and car park, a short distance W from Braemore junction; there is a parking charge, toilets and a kiosk / cafe. Note that the car park is closed outside the cafe opening hours; there is a small layby just W, or an overflow car park just under 1km further west (with access to the walk at ). From the gateway centre, take the path that soon runs beside the burn, the Abhainn Droma. It flows over rocky slabs through the pinewoods, with little hint of the drama to come."
      },
      {
        "stage": 2,
        "description": "There are a couple of forks to choose between fords or footbridges, but both times the two options quickly rejoin. Eventually the path arrives at a junction, with the bridge over the narrowest point of the gorge on the right. The bridge is limited to only six people at a time; peer down from the middle to see the Falls of Measach where the water plunges down to a much lower level in the gorge - it's quite a sensational drop."
      },
      {
        "stage": 3,
        "description": "Cross the bridge and turn left and follow the path to where a metal viewing platform juts out over the gorge giving vertigo-inducing views the gorge - and back up to the bridge."
      },
      {
        "stage": 4,
        "description": "Return to the bridge and cross to the other side. Turn right and follow the path as it skirts the edge of the gorge. Take great care to stay on the path here as the gorge sides are unstable."
      },
      {
        "stage": 5,
        "description": "Through the trees you can see the viewing platform on the opposite side. The path passes through pines and then heads downhill on some steps to an information area and then a further viewing area for the gorge."
      },
      {
        "stage": 6,
        "description": "Keep following the path as it turns uphill and into open countryside. There are great views down towards Loch Broom to the right. At the top of the uphill section there is a seat beautifully crafted from a tree trunk. Follow the level path to emerge at the overflow car park. From here go left again through the gate to follow a path that descends back to the footbridge over the gorge via zig-zags. Do not cross, instead turn right to retrace your steps back to the start."
      }
    ],
    "scraped_at": 1756311063.637046
  },
  {
    "title": "Tain links circuit",
    "summary": "This straightforward short walk explores the environs of Tain, the oldest Royal Burgh in Scotland. It takes in a range of historic buildings as well as taking in a stretch along the shores of the Dornoch Firth.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/tain-links.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.0,
    "ascent_m": 38,
    "start_grid_ref": "NH779821",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins in the High Street (for those arriving by car, there is on-street parking nearby or in the car park on Queen Street). Tain has some fine sandstone buildings; at the west end of the High Street is the grand Royal Hotel, whilst to its right is the Tolbooth. This was originally a jail and court offices and dates in part from 1630. Continue past the Royal Hotel, where the road dog-legs right and then left."
      },
      {
        "stage": 2,
        "description": "Look to the right to see the entrance to the Tain Museum and the Collegiate Church. The church was built between 1370 and 1430 to house the shrine of St Duthac, an early medieval saint who was born in the town. It replaced an earlier chapel which was burnt down (see next paragraph). St Duthac's relics made Tain an important centre of pilgrimage in the Middle Ages. After exploring the church and museum, take the next right turn - after the bank - down a street signed 'Dangerous for Motorist and Cyclist'. Turn right at the bottom of this short street."
      },
      {
        "stage": 3,
        "description": "Turn left at the next junction (towards both the station and golf club) and then keep right at the next fork (signed for the golf club). The road crosses a bridge over the railway, and then bends to the right alongside it. Continue along the road until the wall of the cemetery on your left - the route turns left on the path alongside this, but before going this way continue for a short distance to reach the entrance to a large graveyard containing the remains of the original chapel of St Duthac. This was burnt down when an outlaw tried to test out the theory that a church provides sanctuary. After looking at the graves, return to the path along the outside of the cemetery wall and follow the path down to the seafront."
      },
      {
        "stage": 4,
        "description": "Cross the metal suspension bridge over the river and then follow the main path on the far side (green marker post). A short distance along the route bears right at a marker post to head through broom."
      },
      {
        "stage": 5,
        "description": "Further on, a wooden signpost indicates a turn to the right (signed 'Plaids circuit').  The route now follows the tarmac road past the house and over a bridge. Tain golf course stretches out on both sides of the road; this was designed in 1890 by Old Tom Morris. Pass under the railway."
      },
      {
        "stage": 6,
        "description": "The road doglegs through a farmyard and then reaches a junction; turn right here. A short distance further on, turn left just before a modern house. The path soon leads to a series of steps to re-enter the town of Tain. Turn right along the attractive street of stone buildings; further on it becomes the High Street."
      }
    ],
    "scraped_at": 1756311066.219581
  },
  {
    "title": "Uamh an Tartair, Knockan, Elphin",
    "summary": "Uamh an Tartair - the Cave of the Roaring - is a spectacular pot hole with a cave below, into which pour the waters of the Abhainn a' Chnocain above Knockan. The cave should not be confused with another of the same name above Inchnadamph.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/uamh-an-tartair.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.75,
    "estimated_hours": 1.5,
    "ascent_m": 78,
    "start_grid_ref": "NC211105",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the parking layby with an information board on the west side of the A835 in Elphin. Head briefly south along the main road verge (with care), then turn left onto the Knockan loop road. Follow this until the sharp corner where the road turns left. Turn right here, between the two houses, passing through a gate and along a grassy track, to the left of the telegraph pole. Almost immediately it reaches another track at a bend; take the right branch."
      },
      {
        "stage": 2,
        "description": "The track climbs gently through pastures. Ignore a branch heading left, continuing on the right track uphill. Note a mossy pothole on the right, and further on a fenced depression on the left."
      },
      {
        "stage": 3,
        "description": "Eventually the main track bends left, and a fainter ATV track leads across the moor ahead. Leave the main track here and follow the very boggy ATV track up the moorland, aiming from occassional old marker post to marker post. Eventually the boggy route turns left and heads past a wide, grassy sinkhole."
      },
      {
        "stage": 4,
        "description": "Climb round the left side of the sinkhole, passing a makeshift seat and then continuing down to a final battered signpost reading 'Uamh an Tartair'. Immediately behind the signpost is a unfenced, evil-looking pothole - care is needed; you can hear but not see the water rushing through it below. Descend to the left to see the slit-like cave opening where the main burn flows into the pothole, disappearing underground. This is Uamh an Tartair - the Cave of the Roaring - not to be confused with a similar cave opening in the Tralgill cave system near Inchnadamph. Entering the cave is reserved for expert cavers."
      },
      {
        "stage": 5,
        "description": "After admiring the entrance, retrace your steps back to the start."
      }
    ],
    "scraped_at": 1756311068.8049293
  },
  {
    "title": "Weem Forest Trail, Weem by Aberfeldy",
    "summary": "This short circular waymarked trail climbs through Weem Wood to St David's Well which has a good view over Aberfeldy and Strathtay and then descends past crags and through native woods.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/weem-wood.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.7,
    "estimated_hours": 1.0,
    "ascent_m": 74,
    "start_grid_ref": "NN839497",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Turn onto the entrance for Castle Menzies from the Weem Road, then fork right before reaching the castle to head to Weem Wood car park. Start the walk by taking the path to the right following red waymarkers. The path climbs gently behind the houses of Weem and then turn left to climb more steeply through Weem woods. These woods contain many specimen trees planted by the Menzies family to provide a pleasant backdrop to the nearby castle. At this time, in the early 19th century, plant collecting from abroad was just beginning to be popular in this area and there was renewed interest in Scottish forestry. Keep on the main path as it zig-zags uphill, ignoring paths to right and left."
      },
      {
        "stage": 2,
        "description": "The path weaves up between large boulders amongst the trees before eventually reaching a very short detour to the left onto level ground on top of a crag, where there is a good view out over Strathtay and modern 'cup and ring' carvings on the rocks."
      },
      {
        "stage": 3,
        "description": "Return to the path and follow the path until a large crag, riddled with caves and St David's Well is reached. It is marked with a modern carved celtic cross. This was a hermit's retreat, used by St Cuthbert in the early days of Christianity. It is named after David Menzies, the laird's son from Castle Menzies who occupied it when he took on an austere religious life in the fifteenth century."
      },
      {
        "stage": 4,
        "description": "Continue past the high crag and soon the path descends a flight of steps with a wooden handrail. At the bottom of the slope turn right at a T junction opposite a red waymarker."
      },
      {
        "stage": 5,
        "description": "The path undulates as it returns towards the car park at a lower level. Ignore a path directly downhill to the left which leads to the centre of Weem, instead climb slightly and pass behind the backs of more Weem houses."
      },
      {
        "stage": 6,
        "description": "A break in the trees provides a good view over Strathtay. Continue on the path, keeping right at a path junction to climb slightly again before turning left when the outward path is rejoined to head downhill and back to the start."
      }
    ],
    "scraped_at": 1756311071.3909402
  },
  {
    "title": "Edramucky Trail, Ben Lawers",
    "summary": "This short (though steep) nature trail begins at the Ben Lawers car park, giving easy access to the mid-level slopes of the mountain, a National Nature Reserve which is renowned for its remarkable arctic-alpine flora.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/lawers-nature-trail.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.2,
    "estimated_hours": 45.0,
    "ascent_m": 220,
    "start_grid_ref": "NN608377",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Start at the Ben Lawers car park on the west side of the road (parking charge). The area is designated as a National Nature Reserve and is owned by the National Trust for Scotland. Begin the walk by heading through the walled intepretation area and on the surfaced path to a gap in a fence."
      },
      {
        "stage": 2,
        "description": "Go through this and cross the road to continue on the path, with views to Beinn Ghlas ahead. The path then approaches an area of regenerating native woodland."
      },
      {
        "stage": 3,
        "description": "At a signpost by the trees, turn right, leaving the main path (which is the usual ascent route to Ben Lawers) and following the Edramucky Trail path, crossing a footbridge over the burn. The path heads up the far side of the Edramucky Burn. In spring, look out for many species of wild flowers - some of them rare such as varieties of saxifrage."
      },
      {
        "stage": 4,
        "description": "The bouldery bed of the burn is attractive too; the path crosses back to the left side for a while before crossing once more back to the right on stepping stones. It then climbs slightly to give a view of Loch Tay. The views to the mountains are impressive too. Meall Corranaich is uphill to the left with the peak of Beinn Ghlas to its right; Beinn Ghlas hides Ben Lawers when seen from this area and is often mistaken for it. Looking back, the rocky slopes of Meall nan Tarmachan can be seen."
      },
      {
        "stage": 5,
        "description": "Further up the main path to Ben Lawers is reached once more, often busy with walkers. Turn left down this path, crossing over the burn once more. The well maintained path gives excellent going as it descends back towards the start. The outward route is rejoined just before leaving the trees. Continue back down to the road and the car park beyond."
      }
    ],
    "scraped_at": 1756311073.97655
  },
  {
    "title": "The Falls of Bruar, near Blair Atholl",
    "summary": "A beautiful short but surprisingly strenuous walk with good views of the gorge and falls from two stone bridges and a picnic area.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/falls-of-bruar.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.5,
    "ascent_m": 150,
    "start_grid_ref": "NN821660",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the House of Bruar car park where you can also make use of the poshest toilets in the Highlands. Walk around the front of the building and then head left uphill just before the bridge following the signs for the Falls of Bruar. The walk passes under the railway line (trespass on the lines is strictly prohibited) and follows the Bruar Water upstream where clear pools can be seen below. Care should be taken with young children near the steep sides of the gorge. The path passes through pine trees and later birch, rowan, aspen and willow. When visitors first came here in the eighteenth century there were no trees. Robert Burns, after visiting the popular beauty spot in 1787, petitioned the Duke of Atholl and asked for the falls to be surrounded with \"lofty firs and ashes cool\". The first pine plantations were laid out in 1796 and mostly felled to provide wood during the second world war and replanted afterwards."
      },
      {
        "stage": 2,
        "description": "The walk continues to climb, reaching a carved wooden bench where a flight of steps go up to the right. These lead to a viewing platform for the first of the falls where a rock arch projects low across the river. Continue on the main path to reach the lower bridge just beyond. The arched remains of a Victorian viewing house can be seen just on the left side of the bridge. This was designed to give a sudden and surprising view of the waterfalls beyond and was thought to heighten the effect."
      },
      {
        "stage": 3,
        "description": "Do not cross the lower bridge but continue on the uphill path for the higher bridge. Continue heading uphill ignoring a path to the left which climbs away from the river. Eventually you reach the pretty stone upper bridge which offers views down into the gorge."
      },
      {
        "stage": 4,
        "description": "Continue up the path on the other side of the bridge - recently trees have been felled to try and stop the spread of a disease affecting larch. After a short distance there is a picnic area off to the left with good views of the Bruar Water from the seats. The walk continues on the main path though Scots pine and begins to descend. There are views to the higher upper falls from a seat."
      },
      {
        "stage": 5,
        "description": "When you reach the lower bridge cross it and continue back down the outward path to the start of the walk."
      }
    ],
    "scraped_at": 1756311076.559011
  },
  {
    "title": "The Birks of Aberfeldy, Aberfeldy",
    "summary": "This beautiful short walk is deservedly popular. Celebrated in a poem by Robert Burns, the fine walk up the steep gorge of the Moness burn reveals several waterfalls.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/birks-of-aberfeldy.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 2.0,
    "ascent_m": 195,
    "start_grid_ref": "NN855486",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the upper level of the Birks car park; if on foot from Aberfeldy you can follow a path from the main square. Leaflets giving details of some of the plants and birds you might see on the walk are available by the information board. Begin along the obvious trail, bearing left to cross the large bridge over the foaming Moness burn."
      },
      {
        "stage": 2,
        "description": "This lower part of the Birks is in fact mostly a beech wood. The walk continues along the path beside the attractive burn with several small waterfalls. A little further is a bench. The valley narrows and the beginnings of a gorge are reached. From here on most of the path has a handrail; it rises briefly and then descends again."
      },
      {
        "stage": 3,
        "description": "Cross a bridge over a feeder stream with attractive waterfalls on the left. Just beyond is a natural shelf in the rocks known as Burns' Seat. It was here that Robert Burns is said to have  taken a rest when he visited in 1787. His visit inspired his poem 'The Birks of Aberfeldy' - and the little glen has been a popular place to visit ever since."
      },
      {
        "stage": 4,
        "description": "Continue on the path which climbs up several flights of stone steps and zigzags left and right, the effort being repayed by several waterfalls. Once at a higher level a wooden walkway continues the route up the gorge. At the end of this the path forks. The path straight ahead was a detour to reach a viewpoint for the Middle Falls where the Moness burn flows through a ravine - but this path has been closed following a landslide, hopefully it will eventually be repaired. To continue the route, take the path up to the left."
      },
      {
        "stage": 5,
        "description": "You are now high above the river with views of the crags on the opposite side of the ravine. There is a break in the trees that gives a fine view of the impressive Upper Moness Falls, the highest on the walk. Continue on the path which heads for and crosses the footbridge directly above the falls, giving a giddy view down to the river far below. Once over the bridge turn right to begin the walk back down the other side of the gorge."
      },
      {
        "stage": 6,
        "description": "The return walk is higher above the ravine and there are fewer open views of the waterfalls. However the woodland here is mostly the birches - or birks - that have given the glen its name and the scenery is very beautiful. At one point there is a wonderful view down the glen to the verdant Strath Tay, with distant Ben Vrackie visible beyond. Continue down the path to return to the start."
      }
    ],
    "scraped_at": 1756311079.1430633
  },
  {
    "title": "Den of Alyth, Alyth",
    "summary": "Explore this deep-sided wooded valley where the Burn of Alyth tumbles down. Although described here from the first car park on the road out of Alyth, it is possible to start from the centre of Alyth.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/den-of-alyth.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.5,
    "ascent_m": 82,
    "start_grid_ref": "NO235486",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 4,
        "description": "Due to storm damage the furthest loop north of Tully () is currently closed; this can be omitted as the rest of the walk is open."
      },
      {
        "stage": 1,
        "description": "From the car park head downhill on the footpath signed for Alyth. When it reaches the end of the playing field, curve right and then turn right to follow the burn upstream. You can also reach this point from Alyth - to do so take the roadsigned for Den of Alyth, passing to the left of the large church. After the last house, the ornate gates for the Den are reached on the left. Go through these and follow the path past the play area to meet the main path along the Burn."
      },
      {
        "stage": 2,
        "description": "After a short while you can see where the Burn has cut down through the rock over time to create a high cliff of rock known as Old Red Sandstone.  Soon the first bridge comes into view amongst the beech trees. Do not cross but go down to it and then continue on the same side of the Burn on a narrow path. Take care here as there is a steep drop down to the water."
      },
      {
        "stage": 3,
        "description": "Soon the second bridge is reached, again stay on the same side and continue upstream. This area has been continuously wooded for several thousand years, probably protected from tree felling by the steep sides of the Den. Cross a small bridge and take the left hand fork to follow the water's edge as the burn takes in a wide curve."
      },
      {
        "stage": 4,
        "description": "At a stone bridge, cross the road and continue on the path on the same side of the water. At the remains of a stone wall follow the path which heads inland and then uphill. Lookout for a turning only a short way up. Turn right here onto a path which soon heads back down to the outward path. Use this to return to the stone bridge and turn right to cross the bridge and then immediately take the riverside path on the left."
      },
      {
        "stage": 5,
        "description": "Just before a green metal seat take the right hand fork to head uphill (the left fork leads back to the second bridge). The path meanders through mixed woodland with horse chestnut, birch and sycamore trees and smaller shrubs. Soon the first bridge is reached, cross this and take the path that slopes uphill to the right on the far side, which leads back to the start."
      }
    ],
    "scraped_at": 1756311081.729675
  },
  {
    "title": "Kinloch Rannoch Nature Trail",
    "summary": "This short circular walk around the village of Kinloch Rannoch takes in the shores of the loch, the riverside and some fine broad-leaved woodland.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/kinloch-rannoch.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.0,
    "estimated_hours": 1.0,
    "ascent_m": 20,
    "start_grid_ref": "NN661587",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the attractive square at the centre of the village of Kinloch Rannoch. Begin the walk by walking along the road in the direction of Pitlochry."
      },
      {
        "stage": 2,
        "description": "Just after Allt Mor Crescent goes off on the right, take the path on the left, just beyond a fence, signed for Craig Varr. The path passes a cottage to your right then leads through a gate to reach an attractive waterfall cascading down a rocky slab. An information board has a map of the paths around the village."
      },
      {
        "stage": 3,
        "description": "Continue to reach a junction with the modern Allt Mhòr hydro building on your left. The track heading off up the hill is part of the steep ascent of Craig Varr; instead turn left following the path past the modern hydro building, signed for Loch Rannoch. This runs just above the level of the fields behind Kinloch Rannoch village. Further on an old stone well is passed; the path, which is boggy in a couple of places, keeps beside an old drystone dyke before emerging at the tarmac road by some houses. Turn left along a path that runs along the near side of the road, and follow it round the shore of Loch Rannoch."
      },
      {
        "stage": 4,
        "description": "The path joins the road as it leads back through the outskirts of the village - head towards the village. Just after the first cottage on the right, turn right onto a track, immediately taking the left track through a gate. Fork left again by the electricity substation onto a surfaced path. It leads down to the sluice gates at the foot of Loch Rannoch. Part of the Tummel hydro-power scheme, the powerful flow of the river is controlled and can lead to rapid changes in the water level so keep away from the banks.  The great conical peak of Schiehallion is prominent. Follow the path downstream through the woods, passing under the stone road bridge."
      },
      {
        "stage": 5,
        "description": "On the far side of the road bridge is a junction. The village centre and start of the walk are just off to the left here, but our walk continues by the river. Eventually it curves left and reaches a footbridge on the right over a feeder stream. Turn right to cross this, passing to the right of a small housing estate. When the tarmac path curves left, leave it by forking right onto a path through the woods."
      },
      {
        "stage": 6,
        "description": "This soon runs alongside the river; continue on the path to a parking area and pass through this. Just past the parking area the path ends and emerges on the road. Cross the road and go through the gate opposite, signed for the Hillside path."
      },
      {
        "stage": 7,
        "description": "Very soon turn very sharp left onto a path rising through the edge of the woods. This delightful route leads back towards the village through the magnificent trees. Go through a gate and finally fork left onto a path that leads back down to Kinloch Rannoch, emerging on the road by the Hub community centre. Turn right along the road to return to the start."
      }
    ],
    "scraped_at": 1756311084.3141978
  }
]