[
  {
    "title": "Cambus o' May Pinewood trail",
    "summary": "This is the longest of three circular waymarked trails through the pinewoods at Cambus o' May. The walk offers views up Deeside, passes two attractive forest lochans and offers the chance to spot woodland wildlife.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/pinewood-trail.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.25,
    "estimated_hours": 2.0,
    "ascent_m": 50,
    "start_grid_ref": "NO403980",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is an information board in the car park giving a map of the three waymarked trails here; this route follows the longest, the Pine Trail. The route is waymarked by yellow-banded posts. All three trails begin up the path which climbs up into the trees between the posts. This first stretch of path runs along a low, birch-clad ridge and gives some views up Deeside to the left."
      },
      {
        "stage": 2,
        "description": "Down to the right is an attractive tree-fringed lochan. Ignore a path turning off to the right, instead keeping straight ahead (yellow and red markers). Further on the path reaches a track - go straight across here."
      },
      {
        "stage": 3,
        "description": "The path now runs along beneath a line of pylons before plunging back into the pinewoods. After crossing a small footbridge with a stone bridge beside it, keep straight ahead (ignoring the red route turning off to the right). Eventually the path emerges onto a track; turn right along this. Follow the track, keeping ahead at a junction where another track goes off left. When a yellow marker post is reached turn right onto a path once more."
      },
      {
        "stage": 4,
        "description": "At another junction the red route joins back in from the right; keep ahead. Bear left at another junction, crossing a wooden footbridge. Soon the route passes another attractive lochan - seen on the right. After crossing a tiny stone bridge there is a picnic table overlooking the water. Continuing the walk, turn left at the next junction and then left again onto a track. Keep ahead along the track until it approaches a barrier - turn right here onto the waymarked path which leads back to the car park."
      }
    ],
    "scraped_at": 1756310910.3434272
  },
  {
    "title": "Druim an Aird, near Laggan",
    "summary": "This walk begins by passing above the lower Pattack gorge and its waterfalls. It then follows forest tracks to reach the lonely ruins of the deserted village of Druim an Aird. It was once possible to make a circuit using the Right of Way from Dalwhinnie, but this path has been lost following forest works so the return is back the same way.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/pattack.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 97,
    "start_grid_ref": "NN567903",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "From the car park take the path heading south-east signed Forest Walks and Waterfall. Ignore the first path going off on the right and walk uphill for a short while until you reach a path junction. The viewing area for the waterfalls (not to be confused with the nearby more impressive Falls of Pattack) is just over the right here; the cascading river in its impressive gorge has been used as a location in TV's Monarch of the Glen. From the falls walk uphill along the main path (ignoring the faint path on the right next to the river)."
      },
      {
        "stage": 2,
        "description": "The path winds uphill to a waymarked junction; you can turn left here to follow a loop path through the attractive pinewoods but it can be overgrown; both routes rejoin a little further on. Follow the path as it continues down to a t-junction with a forestry track where you turn right."
      },
      {
        "stage": 3,
        "description": "Follow the wide track. When a junction is reached, turn left. There are good distant views ahead towards the Creag Meagaidh range."
      },
      {
        "stage": 4,
        "description": "At another rather industrial looking junction, turn left again. Continue along the track. Soon the remains of Druim an Aird can be seen on the right in a fenced enclosure next to an interpretation sign. It is not known for certain why the village was deserted but one local story is that the villagers left after all the menfolk died in a snowstorm returning from wedding celebrations near by."
      },
      {
        "stage": 5,
        "description": "It used to be possible to make a different return using the old right of way from Dalwhinnie, but this was not reinstated after felling work and is now very difficult to follow with brash and bog. Instead, it's best to return the way you came."
      }
    ],
    "scraped_at": 1756310912.939376
  },
  {
    "title": "Falls of Pattack",
    "summary": "The true Falls of Pattack are somewhat hidden away, but are much more impressive than the better known lower falls near the main road at Feagour. This easy out-and-back walk follows a good track until a final short path leads to the best viewpoint looking over the falls.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/falls-of-pattack.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 98,
    "start_grid_ref": "NN555899",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins up the track signed for Gallovie Farm from the A86, but there is no parking here - instead park around 70m to the east in the layby on the opposite side of the road. Return to the junction and follow the track, soon crossing a bridge over the River Pattack."
      },
      {
        "stage": 2,
        "description": "At a junction turn right to keep on the main track. The track leads past a vehicle barrier, then reaches is another junction of tracks - this time turn left, signed again for Gallovie Farm. The track winds uphill through the trees, soon passing the farmhouse and a couple of cottages. Eventually it leads on through a gate; there are blue waymarker arrows."
      },
      {
        "stage": 3,
        "description": "Look out for a pedestrian gate and sign on the left side, and leave the track to head through the gate. A path leads through dense forestry. Ignore a path off left at a junction and continue ahead. Soon the path curves left and approachs the rim of the gorge carved by the River Pattack, with a view down over the dramatic falls. Take care as the edge is unprotected."
      },
      {
        "stage": 4,
        "description": "Return to the path junction. You can detour along the branch path to the right for a different persepective on the falls looking up the gorge. To return to the start of the walk, though, it's best to head back the same way."
      }
    ],
    "scraped_at": 1756310915.5283558
  },
  {
    "title": "Insh Marshes - Invertromie Trail",
    "summary": "A lovely walk exploring the edge of the Insh Marshes RSPB nature reserve with good views and varied countryside. Bring binoculars for the three bird hides.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/inshmarshes.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 2.0,
    "ascent_m": 89,
    "start_grid_ref": "NN774998",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Start at the Insh Marshes RSPB reserve car park and walk away from the B970 to the rear of the parking area. At the start there is the option to detour 250m to the Gordonhall hide. This hide and others on the route overlook the floodplain and depending on the time of year it is possible to see ducks, geese, swans, lapwings, curlews, redshanks, buzzards and osprey from here to name but a few. To start the walk head uphill from the parking area. At a fork the route takes the 'Invertromie Trail' to the right, but first go left visit the luxurious, circular Lookout hide which boasts a rooftop terrace, and information in the hide beneath."
      },
      {
        "stage": 2,
        "description": "Now take the Invertromie Trail, soon forking left onto a smaller path at a wooden barrier. There are good views over the marshes and woodland. The Insh Marshes are important for wildlife as they are the largest area of floodplain in Britain that has not been improved or drained meaning it supports a vast array of different species. It also means that as the marshes flood naturally several times a year the views are often different on each visit. Follow the trail as it passes next to a fence with the woodland on the left. Cross a small wooden bridge. Just afterwards there is a chance to detour 180m down steps to the Invertromie Hide which overlooks the wetland."
      },
      {
        "stage": 3,
        "description": "Continuing on the trail, climb gently across grassland towards the woods. Pass through a small gate and bear slightly right on the narrow but clear path as it enters the woodland. Roe deer can often be seen in this area and in the autumn there are many types of fungi. Soon a t-junction with a sign is reached. To the left here is another possible detour to a view point and picnic area; the main route turns right."
      },
      {
        "stage": 4,
        "description": "Keep following the white arrow markers and continue on the path to a gate where you cross a track to pick up the path on the other side. The path follows a ridge with good views from a seat, and lots of purple heather in late summer/autumn. Pass through another gate and into a lovely area of birch woodland. The trail then curves round to the left heading downhill and then turns right at a signed junction (path left leads to an old churchyard)."
      },
      {
        "stage": 5,
        "description": "At the bottom of a slope the path turns right, follows a wall and passes through a gate and then slopes downhill to emerge into Tromiebridge meadow, through another gate. Here the path follows the banks of the River Tromie, where Tromie Mills can be seen on the far side. 150 different plant species have been identified in this meadow which is particular good for orchids and butterflies. Follow the riverbank path which then heads away from the river into the meadow. Here the path splits, follow the grassy track to the left to a gate and the B970. Do not head out onto the road, instead turning right onto a broad constructed path - part of the Speyside Way."
      },
      {
        "stage": 6,
        "description": "Keep following the path through some fine birch woodland.When it emerges at a track, go left and then immediately right to continue on the path parallel to the road. After another 400m it returns to the start."
      }
    ],
    "scraped_at": 1756310918.122658
  },
  {
    "title": "Frank Bruce Sculpture Trail & Lower Feshie",
    "summary": "A lovely varied walk, taking in the wood and stone sculptures of Frank Bruce as well as the banks of the Feshie and a forestry section with good views of the surrounding mountains. The sculptures are naturally decaying in the environment, as was the intention of the late artist.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/lower-feshie.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 2.0,
    "ascent_m": 122,
    "start_grid_ref": "NH849046",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "West of Feshiebridge off the B970 there is a Forestry & Land Scotland car park. Start the walk by following the waymarked trail that climbs up to the higher track first and turning right and then following the footpath at the rear of the disabled parking area. Each of the large wooden and stone sculptures is accompanied by a title or explanation. The late Frank Bruce started sculpting in 1965 and used natural materials and the landscape and politics as inspiration."
      },
      {
        "stage": 2,
        "description": "Follow the path as it meanders through the native woodland, passing a number of impressive and large wooden sculptures. Soon the path comes alongside the wall of what used to be the walled garden for Invereshie House. Enter the walled area and follow the path round the sculptures and picnic tables."
      },
      {
        "stage": 3,
        "description": "A curving path - take the left branch - leads round the sculptures, mostly carved in wood but some of stone; small interpretative panels help to understand their symbolic or political significance. There are good views of the surrounding countryside from here. Leave the walled garden area at the side gate towards the far end, and turn left."
      },
      {
        "stage": 4,
        "description": "Follow the path alongside the wall until a path leads down to the riverside on the right hand side. There is an orange marker post near the top. Here there are lovely views over the wide section of the River Feshie. Turn right at the bottom and follow the path as it runs along a bank above the river and then goes right to cross a small wooden bridge at one point. Pass the river gauging station and climb the path back to the car park. Turn left and follow the yellow marker post to take a path that climbs next to a telegraph pole."
      },
      {
        "stage": 5,
        "description": "This path follows the line of the river and after passing a picnic table reaches a lovely stone bridge over the River Feshie where the water pours through a narrow section. Go up to the road and cross over and follow the track alongside four houses before reaching an open area with forestry and mountain views. Continue on the track leading up the glen."
      },
      {
        "stage": 6,
        "description": "After some distance a signpost indicates where to turn right, leaving the track and following a path uphill beside a stone wall; there are great views back across the glen. Follow the markers which indicate where the path veers off to the right into the forest plantations. Soon it emerges onto a forest road; follow for a short distance and then take a marked path downhill to the right. Watch out for mountain bikers. When you reach the tarmac road follow the path directly across to the track leading down into the car park."
      }
    ],
    "scraped_at": 1756310920.7096667
  },
  {
    "title": "Ellan Wood and the river, Carrbridge",
    "summary": "Ellan Wood is a fine pine wood on the fringes of the village of Carrbridge. Partly owned by the Woodland Trust, it offers several short waymarked trails, which can be combined to give the walk described here. The route finishes with a riverside section to the much-photographed packhorse bridge.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/ellan-woods.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 53,
    "start_grid_ref": "NH903227",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The car park is accessed via Station Road in Carrbridge. Look out for a turning on the left signed for Ellan Wood; there is parking and a picnic area just short of the cemetery. Begin the walk on the path which starts just to the left of the information board, signed Main Street via Ellan Wood. Initially the route follows the yellow markers. Turn left at the first junction, and then keep straight on when a short loop of path goes off right. There is a bench up to the right at the next junction, where you should keep left again (sign Main Street). At the next path junction a route comes in from Carrbridge on the left (this is an alternative start, heading between a church and the village hall); turn right here, signed 'Boat of Garten via Carr Plantation Trail' and waymarked in both red."
      },
      {
        "stage": 2,
        "description": "Keep straight on at a crosspaths, and then straight ahead again at a three way fork, signed 'Railway Wood walk' and marked in red. Continue ahead again across the access track for the overflow parking for the Landmark Forest park. The route now passes the Lookout Tower, an impressive structure and the highest wooden tower in Britain; it is part of Landmark and so cannot be accessed. The path continues through the woods; this part is a dense plantation of Scots pine."
      },
      {
        "stage": 3,
        "description": "The path eventually reaches the main railway line, where you should turn right, signed Railway Wood walk. The path continues beside the railway before eventually bearing right back into the woods; ignore a minor path off left. Red squirrels are plentiful around here; if you are here in the Autumn then the fungi can be quite spectacular."
      },
      {
        "stage": 4,
        "description": "Turn left when the path reaches a t-junction. Continuing the walk, a 'Glencharnoch Wood' sign indicates when you enter the part of the forest that is owned by the Woodland Trust. The path descends a flight of wooden steps at one point and then turns sharp right."
      },
      {
        "stage": 5,
        "description": "When a finely sculpted wooden bench is reached, turn left (passing another bench). The path continues to wind through a beautiful section of pinewood. At the next junction take a right turn, and then at the one after that turn left, then right - signed for Station Road."
      },
      {
        "stage": 6,
        "description": "When the road is reached go diagonally across (veering left) to meet a path leading off on the far side, signed for Village Centre via Riverside walk. A track leads round to the back of some houses; follow it round to the left as it forks. As the track approaches a bungalow, a low footpath sign indicates a turn to the right. Take this turning and continue to a suspension footbridge over the River Dulnain. On the far side, turn right downstream."
      },
      {
        "stage": 7,
        "description": "Eventually the path leads to the main road beside the remarkable old packhorse bridge, built in 1717 and still missing its parapets after the terrible floods of 1829 - known as the 'Muckle Spate' and probably the worst ever experienced in Scotland. Turn right to cross the modern road bridge alongside, and then right again to head along Station Road. Eventually the entrance to Ellan Woods is reached on the left and the car park at the start of the walk."
      }
    ],
    "scraped_at": 1756310923.2990685
  },
  {
    "title": "Queen's Drive and River Clunie, Braemar",
    "summary": "This beautiful circular walk leaves Braemar along the River Clunie before picking up the Queen's Drive - a carriage drive once favoured by Queen Victoria. This gently gains height and gives excellent views before a steeper descent through the woods leads back to Braemar.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/queens-drive.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 86,
    "start_grid_ref": "NO151913",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk starts from the centre of Braemar; there is a carpark (with toilets) just on the left off the A93 which runs through the village towards the Linn of Dee (there's another carpark just over the bridge opposite the Fife Arms)if full. Head back to the street leading into the village from the car park, turn left to cross the bridge over the River Clunie, giving views over a low waterfall. On the far side turn left onto a minor road signed for the golf course. Note the 'engine' preserved as a memorial to servicemen who lost their lives in an aircrash over the hills in 1945."
      },
      {
        "stage": 2,
        "description": "Continue along the quiet road out of the village until a signpost for 'Queen's Drive' and a footbridge on the left. Cross the bridge over the Clunie then turn right to cross a second footbridge over a tributary. A grassy path now keeps to the right of the fence, with views over the river and Morrone Birkwood beyond."
      },
      {
        "stage": 3,
        "description": "After passing through a gate the path climbs gently and then swings away from the river, overlooking the golf course, to eventually meet the main A93 road. Cross this and pick up the path over the far side, turning right to head further from the village (a left turn here heads straight back to Braemar). The path begins to climb, goes through a gate and widens."
      },
      {
        "stage": 4,
        "description": "This is the Queen's Drive, and it rises gently through scattered birchwoods, giving some grand views to Braemar and beyond."
      },
      {
        "stage": 5,
        "description": "Eventually a green footpath signpost is reached. The piles of stones on the left here are all that remains of a cottage, Dubh Chlais (meaning black hollow) which was the home of Mr and Mrs Thompson. They were relatives of John Brown, Queen Victoria's famous servant, and the Queen often came here with him to bring tobacco and tea to the Thompsons. To extend the walk, you could continue ahead from the sign to make the Lion's Face circuit; otherwise turn left as signed for 'Village Centre'."
      },
      {
        "stage": 6,
        "description": "The path now descends through the woods, running alongside a wall and then turning left through a gap in it. When it meets a bench keep left, then continue ahead at further junctions as the route continues to descend, passing a wigwam wildlife hide. At the bottom of the woods a signpost is met where the route from the Lion's Face and Cromlins walk and the ascent route to Creag Choinnich come in from the right. Keep ahead here to leave the woods through a gate and reach the village. At the lane keep straight on to head past the church and back down to the main road. Cross and head down the ramp opposite to return to the car park."
      }
    ],
    "scraped_at": 1756310925.8866568
  },
  {
    "title": "The Colonel's Bed, Inverey",
    "summary": "This short walk heads into the lower reaches of lonely Glen Ey. Its objective is the Colonel's Bed, where the river flows through a narrow rocky chasm. The rockwalls of the gorge here are loose and have partially collapsed - do not attempt to descend into the gorge and view from above with great care.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/colonels-bed.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.9,
    "estimated_hours": 1.5,
    "ascent_m": 130,
    "start_grid_ref": "NO089892",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a car park in Meikle Inverey, which is the part of Inverey on the east side of the River Ey; the part on the other side is known as Little Inverey. Begin the walk by following the track which slants uphill and is marked with a wooden signpost for Glen Ey. There are great views over to the right to Ben Macdui and Derry Cairngorm. Continue up the track through the grounds of Inverey House."
      },
      {
        "stage": 2,
        "description": "The track leaves the grounds of the house through a gate and heads into the glen. Further on it crosses a wooden bridge over the River Ey; note that the bridge shown on some maps heading across to the track on the west side of the Ey no longer exists. Beyond the bridge the track climbs fairly steeply, with great views looking back over Inverey towards the high Cairngorms. Shortly after the track bends to the right you can short cut the zig-zag by following a path up on the left, rejoining the track a short distance uphill."
      },
      {
        "stage": 3,
        "description": "Continue on the landrover track up the glen for almost a kilometre. Just after it bends to the right, a small cairn marks the point to leave the track. Turn left here on a narrow path  in the heather that almost doubles back on the track; this is the line of the original stalkers path which was the main route up the glen before the current track was bulldozed. When back round the corner, a small wooden sign indicates the path off to the right that slopes down to the Colonel's Bed."
      },
      {
        "stage": 4,
        "description": "The path is narrow and a little rough; as you near the river take great care. The river here flows through a vertically-sided rocky gorge, and great care is needed near the edge; the ground is slippery and some of the rocks are loose - clearly any slip would be fatal.  In the 17th Century a colonel, outlawed for the murder of a Laird, made this his refuge, and was brought food each day by his lover. Today part of the wall of the gorge has collapsed and buried the bed itself - do not attempt to descend into the gorge as it is very dangerous and doesn't lead anywhere."
      },
      {
        "stage": 5,
        "description": "After enjoying the gorge from above, return to Inverey the same way."
      }
    ],
    "scraped_at": 1756310928.466755
  },
  {
    "title": "Fairy Pool and Riverside walk, Glen Tanar",
    "summary": "This delightful walk on the Glen Tanar estate combines forestry and farmland with a long, pretty riverside section. The walk is waymarked (combining the Fairy Lochan and Riverside paths), the visitor centre has information on the wildlife to be found on the estate. Toilets near the start and parking charge.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/glen-tanar-riverside.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.9,
    "estimated_hours": 2.0,
    "ascent_m": 30,
    "start_grid_ref": "NO479965",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Take the minor road up Glen Tanar, parking in the Braeloine car park (charge) on the right hand side part way up the glen. Begin the walk by crossing the very beautiful old steeply-arched Bridge of Tanar. On the far side, the building over to the left is an information centre giving details of the estate and the wildlife to be found here; there are also toilets. The walk described here mainly follows white waymarkers although it combines the Fairy Lochan and Riverside paths to make a longer circuit. Start by following the track upstream waymarked in white and green."
      },
      {
        "stage": 2,
        "description": "After a short while the attractive stone-built Chapel of St Lesmo - built in 1872 - is passed on the right and then a junction reached. Turn left here to follow the clear track."
      },
      {
        "stage": 3,
        "description": "Keep on the main track when another track joins from the right and soon the reed-covered Fairy Lochan is reached. Marginal plants have been encouraged at the edges of the water and the lochan is breeding ground for many dragonflies in summer. Continue past the water on the track which rises slightly uphill and passes pine and birch trees."
      },
      {
        "stage": 4,
        "description": "This section is a good area to spot fungi especially in late summer and autumn. After a short while ignore the Fairy Lochan path which leaves to the left (a possible shortcut) - instead continuing for around 500m to the next junction and then turning left here (Riverside Path marker post). The narrow path follows a ridge which was formed by terminal moraine, the wall of boulders and gravel left behind by a glacier and where a loch would have formed behind it. Follow the ridge down past a bench and towards the riverside."
      },
      {
        "stage": 5,
        "description": "The path turns to the left and heads back upstream following the river. The path is narrow as it plunges through silver birches and then emerges into more open ground. A number of slow moving pools are passed and a bench and some faster sections of river."
      },
      {
        "stage": 6,
        "description": "Cross a wooden bridge and then a smaller bridge and follow the path as it leads away from the river bank for a short section before returning and continuing upsteam. Eventually the back of the visitor centre can be seen on the left and the path emerges next to the arched stone bridge at the start of the walk. Cross the bridge and the road to return to the car park."
      }
    ],
    "scraped_at": 1756310931.8657439
  },
  {
    "title": "Falls of Falloch",
    "summary": "A very short leg-stretcher to this popular waterfall and picnic spot, where the River Falloch falls in a single 10m leap, particularly impressive when in spate.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/falls-of-falloch.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 0.6,
    "estimated_hours": 20.0,
    "ascent_m": 10,
    "start_grid_ref": "NN334207",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The Falls of Falloch is a popular beauty spot with benches for picnics. While requiring only a very short walk to view the falls, this can make a useful stopping point or brief leg-stretcher if travelling on the A82. From the car park follow the path through the trees with glimpses of the River Falloch below. At a junction turn right down some steps to an area where you can explore the edge of the river which can be impressive after wet weather."
      },
      {
        "stage": 2,
        "description": "Keep left following the bend in the river following the path over a small boardwalk bridge to the point where the Falls can be viewed."
      },
      {
        "stage": 3,
        "description": "When in spate the falls - and the massive pool beneath them - are very impressive, even more so if you are lucky enough to see an expert kayaker attempting the descent."
      },
      {
        "stage": 4,
        "description": "A recent addition is the 'Woven Sound' installation which provides a different viewpoint for the falls. Constructed from steel rods by John Kennedy; the installation features an entry from Dorothy Wordsworth's diary that recalls the thoughts of those who visited the falls during the days of the Grand Tour. From the sculpture turn left to follow the main path back, crossing a wooden bridge and passing another bench before the straight path back to the car park."
      }
    ],
    "scraped_at": 1756310934.9773445
  },
  {
    "title": "Flanders Moss National Nature Reserve, near Kippen",
    "summary": "A short exploration of this fascinating peat bog, complete with viewing tower to climb, good hill views as backdrop to the cotton grass, birches and heather of the reserve.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/flanders-moss.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 0.9,
    "estimated_hours": 30.0,
    "ascent_m": 1,
    "start_grid_ref": "NS647977",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Flanders Moss is reached along a signed track from the B822 Kippen to Thornhill road, 3km south of Thornhill. Dogs should be kept on a lead as there are adders on the reserve and visitors are asked to keep to the paths as the bog can be very deep in places. There is a parking area and interpretation boards. The nature reserve is just a small part of a vast expanse of peat bog known as Flanders Moss. Its a raised bog which means the mounds of peat are built up over the surrounding watery landscape. The bulk of the peat is made up from spagnum moss which adds new layers to the peat continuously. From the car park walk along the path to the viewing tower which can be climbed to appreciate the reserve and the views to the hills beyond."
      },
      {
        "stage": 2,
        "description": "From the viewing tower head round the boardwalk pathway in a clockwise direction. Birches, the pioneer tree, are growing in this part of the bog and will gradually dry it out if left so the reserve managers are keeping the trees in check to ensure the rare bog habitat survives. If you are a frequent hill walker in Scotland you may be surprised to hear bog being referred to as rare as it is often encountered underfoot, but the raised bog here is different to most boggy moorland and provides a habitat for rare species."
      },
      {
        "stage": 3,
        "description": "A short detour on stones leads to a couple of seats in the bog. Hen harriers and kestrels sometimes hunt in the reserve. On the ground you are likely to see sundew plants, yellowy green in colour, they trap insects in sticky hairs which cover the leaves."
      },
      {
        "stage": 4,
        "description": "Keep heading round the circular path, crossing a bridge. In sunny weather keep an eye out for adders which may bask in gaps between the heather. As the boardwalk nears the trees another short detour leads to the left. Soon you are back at the viewing tower and the start."
      }
    ],
    "scraped_at": 1756310937.5653121
  },
  {
    "title": "Loch Lomond Shores walk, Balloch",
    "summary": "This short stroll from the Loch Lomond Shores shopping complex makes a good leg stretch or family walk and is suitable for baby buggies and some wheelchairs.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/lomond-shores.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.0,
    "estimated_hours": 30.0,
    "ascent_m": 10,
    "start_grid_ref": "NS383821",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start next to the Tree Zone building to the left of the main shopping complex as you look out towards Loch Lomond. The large building to the right used to be a visitor centre but is now closed. Go up the path between this building and Tree Zone, turning right to head along the far side of the building. Take the second path on the left to cross a small stream on a boardwalk path; the Tree Zone assault course can be seen overhead."
      },
      {
        "stage": 2,
        "description": "After crossing the bridge continue to the next junction and then turn right, following the boardwalk through the trees. The next turning right is a short detour to a slipway with a view over part of the loch.  Follow the path as it bears to the left. The path now comes close to the loch and an artwork installation in the form of a quartzite curving wall that divides the land from the water of the loch."
      },
      {
        "stage": 3,
        "description": "Continue on the main path around the edge of Loch Lomond.  Follow the path past another beach to reach an open grassy glade. There is a path junction here; you can either short-cut the walk by turning left or continue on the path ahead passing the picnic tables. The path then swings left to head back towards a multi-coloured metal and plastic sculpture that contrasts strangely with the rural surroundings."
      },
      {
        "stage": 4,
        "description": "The path then plunges back into the trees and rejoins the outward route. Turn right here but ignore the turning back over the bridge to the visitor centre - keeping ahead. Another sculpture can be seen on the left - a black tower with blue and white squares of light. Continue ahead through the trees - the path forks and continues around a loop before doubling back.  Exit by heading back past the Tree Zone bulding to the car park."
      }
    ],
    "scraped_at": 1756310940.18727
  },
  {
    "title": "Duncryne hill, by Gartocharn",
    "summary": "Duncryne, known locally as the Dumpling, is a tiny hill of only 465 feet above sea level. However the very short ascent gives a reward out of all proportion to the effort, revealing a fantastic view of Loch Lomond, dotted with its many islands and backed by the great mountains of the Southern Highlands.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/duncryne.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.25,
    "estimated_hours": 40.0,
    "ascent_m": 88,
    "start_grid_ref": "NS432856",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Take the minor road that leaves Gartocharn by the inn and heads southeast towards Duncryne, which is well seen across the fields to the left. You can either park in the layby alongside the woods where the path begins, or walk here from Gartocharn village if the layby is full - but do not block any farmers gates. The path is signposted and heads through a gate on the left into the trees."
      },
      {
        "stage": 2,
        "description": "A kissing gate leads out of the first section of woods; go through a further gate to cross the fields on a grassy lane between two fences.  Another kissing gate leads into the final section of woodland on the hill itself. Pass through it and follow the path which heads round to the right. It then climbs up the bracken slope onto the bald summit of the hill, marked by a triangulation point."
      },
      {
        "stage": 3,
        "description": "It is for the view that Duncryne is renowned. Loch Lomond with its many wooded islands looks supremely beautiful, whilst beyond it is a grand sweep of the Highland mountains, including favourite summits such as The Cobbler, Ben Vorlich and, dominating the view, Ben Lomond. The legendary hill-goer Tom Weir, who presented a TV program on Scotland's landscape for decades, used to live at Gartocharn; he reckoned Dumcryne has the best view of any small hill in the country - and on a fine day here it is hard to disagree. The return is made the same way."
      }
    ],
    "scraped_at": 1756310942.9104772
  },
  {
    "title": "Mountain lookout trail, Crianlarich",
    "summary": "This short walk from Crianlarich is ideal as an early evening leg stretcher. It heads up through the native community woodlands with to a viewpoint overlooking the surrounding mountains. At the end of the loop there is a chance to visit the banks of the River Fillan.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/crianlarich.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 34,
    "start_grid_ref": "NN386253",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the centre of Crianlarich; there is a good sized car park opposite the school (which is next to the Rod and Reel pub). Begin the walk by carefully crossing the main road and then heading up the minor road that runs past the Londis supermarket. Keep left when it forks (signed 'Mountain Lookout') to reach another small parking area. Here a marked footpath crosses a footbridge and climbs uphill through the woods."
      },
      {
        "stage": 2,
        "description": "The path passes a bench and then heads through a gate into a more open area. Follow the path uphill passing young rowan, birch, willow and alder trees. This area is part of Crianlarich Community Woodland, where local children have planted native species of trees.  At a marked junction keep straight ahead (the Inverardan Forest branch on the left is the return route). Soon the path turns left into a constructed viewing area with seating and an indicator giving the names of the surrounding mountains."
      },
      {
        "stage": 3,
        "description": "Continue on the path that heads through the viewing area and swings right. Soon it climbs up to a small rocky knobble which gives excellent views back over Crianlarich."
      },
      {
        "stage": 4,
        "description": "Continuing along the path there are good views ahead to Ben More, the highest local Munro at 1174 metres. Turn just past a bench (blue marker) and then left when a t-junction is reached with another path. This leads to a wooden boardwalk across a wet area; cross this and then turn right along a landrover track beyond."
      },
      {
        "stage": 5,
        "description": "When this reaches the edge of commercial forest plantations turn right (blue waymarker) onto a footpath. This soon passes through a gate and then returns to the junction mentioned at . From this point turn left and retrace your steps back to the car park."
      },
      {
        "stage": 2,
        "description": "When this reaches the edge of commercial forest plantations turn right (blue waymarker) onto a footpath. This soon passes through a gate and then returns to the junction mentioned at . From this point turn left and retrace your steps back to the car park."
      },
      {
        "stage": 6,
        "description": "Before leaving the car park, it is worth following the 'River and Rail Trail' path from the far side. This swings left past a bench to run along what was once part of the Oban and Callander railway line, which closed in 1965. Follow it until it leads beneath the Glenbruar Viaduct which carries the West Highland Line high above - this is still in use. Do not pass underneath, instead following the track to the right to reach the banks of the River Fillan - an attractive spot. Return to the car park the same way."
      }
    ],
    "scraped_at": 1756310945.5016901
  },
  {
    "title": "Tarbet Isle Walk, near Tarbet",
    "summary": "An easy circuit which climbs gently through pine woods and then oak woodland with good views over Loch Lomond and Tarbet Isle below.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/tarbet-isle.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 55,
    "start_grid_ref": "NN326053",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The car park is signed from both directions of the A82 and is just north of Tarbet on the inland side of the road up a steep drive. From the parking area take the path marked with a yellow marker post heading uphill towards some Scots Pines. The path climbs steadily before easing off and looping to the right and then descending for a short section."
      },
      {
        "stage": 2,
        "description": "As the path goes through mixed conifer and broadleaved woodland the remains of Caulfield's Military Road which ran from Tarbet to Crianlarich can be seen on the other side of the drystane dyke to the left of the path. Keep following the path as it goes through a gap in the dyke and eventually comes within sight of the Bonnie Braes tea room at Blairannich. It is possible to divert over the small wooden bridge to visit the tea room, otherwise continue on the main path as it bears right to head back towards Tarbet Isle."
      },
      {
        "stage": 3,
        "description": "The woodland is now mainly oak and glimpses of the water of Loch Lomond can be seen through the trees. Tarbet Isle, a small island only 80 metres long and 10 metres at its highest point, can be viewed from here. The island takes its name from nearby Tarbet which itself means the portage place. This name comes from folklore that the 13th century King Haakon sailed his Viking fleet up and down Loch Lomond causing havoc and panic having dragged his boats overland to Tarbet across the narrowest part of the land. The path soon returns to the car park where there are also good views of the water."
      }
    ],
    "scraped_at": 1756310948.082881
  },
  {
    "title": "Balmaha Millennium Forest path",
    "summary": "This very short walk explores the village of Balmaha. It climbs up to Craigie Fort before returning via a path cut out of the rock on the very edge of Loch Lomond.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/balmaha.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 55,
    "start_grid_ref": "NS421909",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the huge car park in the centre of Balmaha, which also has an information centre. The path leaves from the very back of the car park close to an information board. It immediately divides at a t-junction; turn left here to follow the path through the trees close behind the car park. The invasive rhododendrons in this part of the wood are being cut back to give native plants a chance to thrive. Look out for woodland birds such as siskin and goldcrest."
      },
      {
        "stage": 2,
        "description": "Soon the path reaches the main road; head straight across to follow a path running parallel on the far side, heading to the right. The path gives views of the many boats moored in the bay. When the main road swings away to the right continue onto the minor road along the loch shore. Turn right onto a steep path marked by a West Highland Way thistle marker post."
      },
      {
        "stage": 3,
        "description": "The path climbs up onto the wooded promontory of Craigie Fort. Keep right at the junction to reach the summit, which offers superb views of Loch Lomond. Continue to follow the West Highland Way as it descends down the other side."
      },
      {
        "stage": 4,
        "description": "The path continues down to the shores of Loch Lomond. Here the West Highland Way continues to the north along the loch shores, but to return to Balmaha, turn left. The path heads round the bottom of the promontory, crossing first an attractive bridge and then following a path cut from the rock right on the edge of the water. The impressive island just offshore is Inchcailloch. The path leads to a small jetty; turn left along the lane to return to the main road in Balmaha. Turn right along the road to head back to the car park."
      }
    ],
    "scraped_at": 1756310950.6723723
  },
  {
    "title": "Arrochar - Tarbet link path",
    "summary": "This walk links Tarbet to Arrochar and makes a nice one way walk - or an out and back route. There are good views from the elevated path which has some steep sections.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/arrochar-tarbet.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.25,
    "estimated_hours": 1.0,
    "ascent_m": 95,
    "start_grid_ref": "NN298048",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the car park on the shore at Arrochar (charge payable) and follow the short path along the shore to the main road and turn right to pass the shop/post office and chippy. At this point cross the road and climb the few steps opposite to reach an information board with a map of the route. Follow the path uphill following the yellow waymarkers. At the junction turn right and keep following the path."
      },
      {
        "stage": 2,
        "description": "In the 13th century the Vikings took advantage of the low and short piece of ground between Arrochar and Tarbet (which in Gaelic means place of portage) to carry their longboats overland and carry out raids on the settlements on Loch Lomond. It must have been truly terrifying to see one of King Haakon's longboats appearing out of the mist filled with armed Viking raiders. Now the 2.5km stretch houses the busy A83 linking Glasgow and the east to most of Argyll. As the path climbs there are good views back over Arrochar and across to the Cobbler and Beinn Narnain beyond. You can also see the remains of the second world war torpedo testing station on the far side of Loch Long where there is still a large jetty and some derelict buildings."
      },
      {
        "stage": 3,
        "description": "The path passes a bench with a good view and continues straight ahead. Stay on the main path, ignoring a rough path  to the right through the rhododendrons. At a fine Scots pine, the route passes a wooden barrier and continues to climb uphill. It then winds through beech, birch and oak trees. Ignore a small path joining from the right."
      },
      {
        "stage": 4,
        "description": "With pine forest on the left side pass a group of carved heads and soon a junction is reached. Turn right here to descend to Tarbet Station. If continuing to Tarbet itself, follow the path under the railway line. There is some parking here."
      }
    ],
    "scraped_at": 1756310953.2565715
  },
  {
    "title": "Luss Heritage Trail",
    "summary": "This easy walking trail takes in the model village of Luss, with its pretty stone cottages and pier on Loch Lomond as well as riverside and woodland sections.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/luss.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.0,
    "ascent_m": 18,
    "start_grid_ref": "NS359930",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the main car park in Luss (charge). Luss was orginally known as Clachan Dhu, the dark village, due to its position in the shadow of the hills. However approximately 1,500 years ago St Kessog brought Christianity to the area; he was martyred and his body embalmed in sweet herbs. Local legend suggests that the herbs grew and covered his grave and gave the village its new name derived from the Gaelic word lus meaning herb. Head away from the lochside to follow the road towards the village from the car park. Almost immediately turn right towards the tiny primary school (old road sign for Glen Road), following the pathway up the slope and then up steps to head across the footbridge over the A82. The pathway emerges next to a large house, keep straight on through a gate onto a path signed for the Quarry Walk."
      },
      {
        "stage": 2,
        "description": "Cross the minor road and go through the gate to follow a path through the woodland. Keep on the main path when smaller paths head off to the right and soon you start descending steps to a wooden bridge. Here the spoil heaps from the slate quarry can be seen. Many of the villagers worked in the slate quarry and would have been too poor to clad their turf-thatched cottages in slate, much of which was sold for the roofs of the Glasgow tenements. However in 1850 the laird who was also the local clan chief replaced the hovels with the new model village that can be seen today. Cross the bridge and turn left to walk downstream passing the small weir. Keep following the path which passes under the busy A82 and then alongside grazing land before crossing a small wooden bridge and heading up to the village road."
      },
      {
        "stage": 3,
        "description": "Climb the steps up to the road and cross over. Turn left and follow the pavement very briefly before turning right down steps and onto a path signed River Path. Turn right on the path and follow it as follows the river downstream, eventually reaching some benches at a sharp bend in the water. The path passes a water treatment works before it reaches the first houses of Luss. Here there is the option to turn right over the wooden bridge to visit the Glebe where there is a celtic-cross sculpture and a circular path."
      },
      {
        "stage": 4,
        "description": "If not exploring the Glebe keep straight on to pass the church which was built in 1875. The graveyard is much older with some of the earliest stones dating from the 7th and 8th century. It is worth exploring the graveyard to find the 11th century Viking hogback grave. Bear round to the right through the gate past the church to reach the shores of Loch Lomond. Follow the lochside to the left, soon reaching Luss pier where boat trips run on the Loch in the summer months. There are stunning views across the loch to Ben Lomond."
      },
      {
        "stage": 5,
        "description": "From the pier head straight up the main street, where the neat cottages of the model village can be admired. The laird built the village to provide housing for the workers who worked in his slate quarry and mills which included a cotton mill, saw mill and corn mill. Turn right alongside a whitewashed cottage onto a one-way lane, then go right again to return to the car park."
      }
    ],
    "scraped_at": 1756310955.8550882
  },
  {
    "title": "Inversnaid RSPB nature trail",
    "summary": "This short but steep little nature trail explores the stunningly beautiful oakwoods on the east side of Loch Lomond. Inversnaid was celebrated in poetry by Gerard Manley Hopkins.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/inversnaid.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.0,
    "ascent_m": 145,
    "start_grid_ref": "NN336088",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins at the large hotel at Inversnaid on the east side of Loch Lomond. It can be reached either via as the end of a long road from Aberfoyle in the Trossachs, or alternatively via a boat from Inveruglas on the west side of the Loch during the summer months. Inversnaid was part of the grand tour during the nineteenth century; tourists would approach by boat before being taken from Inversnaid by horse and coach to Stronachlachar on Loch Katrine, from where they would sail down the loch. Today the hotel here is the base for coach holidays but it still enjoys a peaceful and very beautiful spot."
      },
      {
        "stage": 2,
        "description": "The walk begins by following the West Highland Way north from the large car park. A sign soon indicates the beginning of the Inversnaid Nature Reserve, owned and maintained by the RSPB. Beautiful oakwoods sweep down from the hills to the shores of the loch; a truly natural landscape, these woods contain birch, rowan, hazel and holly as well as oaks. Continue along the West Highland Way, reaching and passing behind an old corrugated iron boat house on the loch shores. The prominent pipelines and building on the shores opposite are the hydro-electric power station at Inveruglas."
      },
      {
        "stage": 3,
        "description": "Just after a little wooden bridge a sign indicates the start of the nature trail, turning off to the right uphill into the woods. The climb is steep but very enjoyable, with old ruins beneath the canopy of trees being all that remains of the old settlement of Cladachbeag. Eventually the path reaches a grassy clearing with a fine view back down Loch Lomond. Opposite, towering behind Tarbet, are the mountains of the Arrochar Alps."
      },
      {
        "stage": 4,
        "description": "From the clearing the path bears right slightly to descend back towards and into the woods, crossing a wooden footbridge over a stream. Once back down to the loch shores the West Highland Way is reached once more. A glance at the map shows a tempting detour to the right to visit Rob Roy's cave; however this old hideout of the noble rogue really only consists of a cleft amongst broken rocks and isn't really worth the effort. Instead turn left to return to Inversnaid along the beautiful shores of Loch Lomond."
      },
      {
        "stage": 5,
        "description": "The poet Gerard Manley Hopkins stayed at Inversnaid and wrote a poem of the same name. It is often quoted by conservationists and nature enthusiasts:What would the world be, once bereftOf wet and wildness? Let them be leftOh let them be left, wildness and wetLong live the weeds and wilderness yet."
      }
    ],
    "scraped_at": 1756310958.4416332
  },
  {
    "title": "Creag an Tuirc, Balquhidder",
    "summary": "Many people come to the beautiful hamlet of Balquhidder to visit Rob Roy's Grave, but few know that just above the village is a viewpoint which must rank amongst the finest in the country when compared to the minimal effort involved in reaching it. Creag an Tuirc, a grassy knoll atop a crag was the ancient rallying place of Clan MacLaren. It gives superb views over both the village and along Loch Voil.",
    "source_url": "https://www.walkhighlands.co.uk/lochlomond/creag-an-tuirc.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.0,
    "ascent_m": 125,
    "start_grid_ref": "NN536209",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "There is limited parking near the churchyard in Balquhidder, which is well-signed as the site of Rob Roy's Grave. If full, there is alternative space with a voluntary charge at the community hall a short distance further along the road. Rob Roy's Grave is immediately in front of the ruins of the old church, between that of his wife and his sons. The words 'MacGregor despite them' refers to government efforts to suppress the clan which included the banning of the MacGregor name. The graveyard is very old and well repays exploration, whilst the church contains the tombstone of St Angus. Begin the walk by heading back down out the churchyard and then turning sharp left to head up the track that runs uphill beside it."
      },
      {
        "stage": 2,
        "description": "When the path reaches a junction, bear right past the forestry sign for Kirkton Glen. A short distance further on the track swings left, and continues uphill for another 400m, reaching a hydro building. Immediately beyond this turn right onto a good path that leads very gently uphill through the forest. At the end is a gate; pass through and a small path continues up to a wooded knoll."
      },
      {
        "stage": 3,
        "description": "The summit of Creag an Tuirc (which means the crag of the boar) is marked with a large cairn and a bench. This was the ancient gathering place of Clan MacLaren in times of trouble. Runners would alert clan members to arm themselves and assemble here, and 'Creag an Tuirc' is the clan's rallying cry. For many of today's visitors it is the views for which the ascent is worthwhile. Looking south there is an aerial view of the village, Glen Buckie beyond and a backdrop of Benvane."
      },
      {
        "stage": 4,
        "description": "To the right is the most picturesque part of the view, looking up the length of Loch Voil. From the summit return a few paces the same way, heading back down to the hydro building. You could extend the walk from here for several miles by following the Kirkton Glen circular off right; otherwise turn left, continuing to retrace your steps."
      },
      {
        "stage": 5,
        "description": "Follow the track back down to the Kirkton Glen Forestry sign near the start. Rather than returning down the lane beside the graveyard, it is worth taking the right fork to vary the route to the village. At the next junction turn right to reach and cross a footbridge with a view of an attractive waterfall. The path now swings left and returns to the houses of Balquhidder; bear left to cross the old stone hump-back bridge. The road is reached just beyond; turn left to return to the start."
      }
    ],
    "scraped_at": 1756310961.0355499
  }
]