[
  {
    "title": "Dun Ardtreck and Ardtreck Point, Fiskavaig",
    "summary": "Ardtreck Point is the northernmost part of Minginish, and an automated light guards the entrance to Loch Harport. The highlight of this enjoyable short moorland walk is the stunningly situated remains of Dun Ardtreck.",
    "source_url": "https://www.walkhighlands.co.uk/skye/dun-ardtreck.shtml",
    "difficulty_rating": 2,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.75,
    "estimated_hours": 2.0,
    "ascent_m": 148,
    "start_grid_ref": "NG342359",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "There is a parking area at the B8009 road end at Portnalong pier - please use this as there is no suitable parking at the Ardtreck road end. From the pier head back along the road very briefly, then turn right onto the track that leads down to the pontoons - signed as a path to Ardtreck Road. When the track forks, ignore the right hand branch right down by the pontoons, and take the slightly higher track ahead that runs past the front of the modern houses."
      },
      {
        "stage": 2,
        "description": "The track reaches a gated storage area, and then swings left. Soon afterwards it reaches a gate - don't pass through this, instead turning right and crossing metal footbridge. On the far side a narrow path climbs up through the trees, passes through a pedestrian gate and then slopes up through a field, giving great views back over Loch Harport. Livestock are grazed here so dogs must be on a lead. After another gate, the path eventually emerges on a minor road. Turn right here. At the signed turning area, fork half right onto a gravelled track - there's a makeshift sign for the broch and lighthouse."
      },
      {
        "stage": 3,
        "description": "Go through a gate, and follow the track as it curves round to the right. There's a second gate as it climbs, keeping well to the right of a crofthouse. Keep ahead until a wooden fence at the end, then turn left (white sign) to head across the narrowest part of the field to a gate on the other side. Pass throughm, and follow the rough moorland path left to another gate and the open moor. At this point there are two paths - take the one that keeps just to the right of a small grassy mound. It leads down towards the west side of the peninsula. Take the lower path when it forks. The remains of Dun Ardtreck can be seen atop a rocky promontory. Head up to visit it."
      },
      {
        "stage": 4,
        "description": "Dun Ardtreck is a D-shaped structure, with galleried walls on the inland side, known as a semi-broch; it is thought to date back around 2,000 years. There are guard cells either side of the entrance passage, and the walls stand to several feet in places. Return back down from the broch and then bear left to follow a path that runs atop the coastal cliffs."
      },
      {
        "stage": 5,
        "description": "Eventually the small automated light at Ardtreck Point comes into view; follow faint paths to reach it. There are views across to Bracadale, with Macleod's Tables prominent in the distance."
      },
      {
        "stage": 6,
        "description": "This is the turning point of the walk; from here, take a path that leads just to the right of the prow-like rocky hill to the southeast, passing the ruins of an old settlement. Once past the steep section, it's worth detouring to visit the summit of the hill, giving great views back over the point."
      },
      {
        "stage": 7,
        "description": "Retrace steps briefly, then cross the moors, keeping to the highest spine of the peninsula; there's a faint path but it's boggy. It rejoins the outward route at a gate; bear left here and retrace your steps all the way back to the start."
      }
    ],
    "scraped_at": 1756309829.1992373
  },
  {
    "title": "The Fairy Glen, near Uig",
    "summary": "A bizarre and delightful miniature landscape of grassy, cone-shaped hills, the Fairy Glen (sometimes spelt Faerie Glen) is a fascinating and otherworldly place to visit.",
    "source_url": "https://www.walkhighlands.co.uk/skye/fairyglen.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.5,
    "estimated_hours": 1.0,
    "ascent_m": 45,
    "start_grid_ref": "NG411632",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Take the side road which leaves the A87 near the Uig Hotel - signed for Sheader and Balnaknock. After a few houses the Fairy Glen comes into view ahead as you descend. There is a pay-and-display car park on the left.  Take the obvious path from the car park that slopes uphill from a parking meter. It soon reveals a striking view of a unique landscape; the Fairy Glen was formed by the land being disrupted by a series of landslides (on a smaller scale than the huge landslips that formed the Storr and the Quiraing), with the results then smoothed by subsequent glaciation."
      },
      {
        "stage": 2,
        "description": "Stay on the good path that descends and passes between some of the striking grassy conical hills. The path leads past a small lochan and then emerges on the road. Go straight across and follow the path as it bends left, running parallel to the road briefly, and then diverging around the opposite side of a lochan. Soon the sharp park of Castle Ewen is seen - the path climbs to the right of this."
      },
      {
        "stage": 3,
        "description": "The path emerges at a grassy hollow next to Castle Ewen. From here you can make a detour to the summit of this rocky tower if you wish - a steep path leads up onto the ridge. Head left along the narrow ridge and then up a final scramble up a rocky step in a gap in the summit tower - great care is needed."
      },
      {
        "stage": 4,
        "description": "The summit is surprisingly spacious, with enough flat grass for a picnic."
      },
      {
        "stage": 5,
        "description": "Retrace your steps to return to the grassy hollow below the ridge. A great deal of work has taken place here to clear away the stone stacks made by visitors which were causing damage to the grazing land - please leave any stones as you find them. Now take the path that heads through the gap to the right of the Castle Ewen ridge. This soon descends to meet the minor road."
      },
      {
        "stage": 6,
        "description": "Once back at the road, turn left to head back to the start along it. Castle Ewen looks impressive across a small loch."
      }
    ],
    "scraped_at": 1756309831.9028416
  },
  {
    "title": "Neist Point",
    "summary": "Neist Point - the most westerly headland on Skye - is an iconic destination, with stunning cliff scenery, a fine lighthouse, an outlook to the Outer Hebrides, and the chance to watch for minke whales in the summer months.",
    "source_url": "https://www.walkhighlands.co.uk/skye/neistpoint.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 2.0,
    "ascent_m": 142,
    "start_grid_ref": "NG132478",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the end of the road. There is enough space for a number of cars. The parking can be congested in the summer months, but new spaces created alongside the road are a great help. Begin by following the path through the gate, which if locked can be easily walked round. The only actual private area is that fenced around the lighthouse and cottages - the rest is the common grazings for Waterstein township. Almost immediately turn left on the path, which then swings right to ease the descent to the headland far below. There is a metal handrail for most of the descent."
      },
      {
        "stage": 2,
        "description": "There is an aerial ropeway which is used to take supplies out to the lighthouse and cottages at the Point. Continue along the now level path. Several scenes in Lars Von Trier's film Breaking the Waves were shot here. It is possible to detour to the right to visit the edge of the cliffs, overlooking the great prow of An t-Aigeach  (meaning the Stallion's Head), the dramatic upstanding crag half way out on the headland. The crag is the site of some of Skye's hardest rockclimbs.  To the left are great views to the impressive cliffs of Waterstein Head and the Hoe, the second highest on Skye."
      },
      {
        "stage": 3,
        "description": "At the highest point of the constructed path, a grassy path heads off to the right - this is an optional detour to the top of  An t-Aigeach. If you decide to visit the top take great care near the cliff edge, and retrace your steps back to the main path. As the corner is rounded the lighthouse comes into view for the first time."
      },
      {
        "stage": 4,
        "description": "Continue along the path towards the lighthouse and the former keepers' cottages (once run as accommodation but now closed down). The complex was built in 1909 at a cost of £4,350 - the engineer being David A Stevenson of the famous Stevenson family of lighthouse builders. From the path junction, you can turn left along a made path to reach the crane and crane which was once used to bring in supplies. It is also worth detouring across rougher pathless ground beyond the lighthouse complex to reach the furthest point. Look out for breaching fins and blows in the sea - this is one of the best places for whales and dolphins on Skye."
      },
      {
        "stage": 5,
        "description": "The return route is back the same way. It is worth detouring to the left from the path before it heads round An t-Aigeach to visit the cliff edge; from here you can watch seabirds in season but take care as the edge is, of course, unprotected."
      },
      {
        "stage": 6,
        "description": "For the classic view of the lighthouse beyond the cliffs, you can head on a boggy path northwest from the car park for a short distance (this is the start of the Neist and Milovaig clifftop walk). This must rank as one of the best places imaginable from which to watch the sunset."
      }
    ],
    "scraped_at": 1756309833.9908469
  },
  {
    "title": "The Lower Falls and Achriabhach Forest, Glen Nevis",
    "summary": "After visiting the renowned Polldubh Falls, this walk climbs steeply into Achriabhach Forest, giving superb views across upper Glen Nevis.",
    "source_url": "https://www.walkhighlands.co.uk/fortwilliam/achriabhach.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 2.0,
    "ascent_m": 190,
    "start_grid_ref": "NN145683",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the Lower Falls car park situated above the Glen Nevis road just before reaching the bridge at Polldubh - there is a charge. It is worth walking over to this bridge before starting the walk to have a good look at the Polldubh Falls  - also known as the Lower Falls - usually busy with coach parties. Begin the route by heading the opposite way up the road, back towards Fort William. After a couple of hundred metres the road passes the white cottage at Achriabhach on the right, and just beyond this there is a small parking area and a track heading towards the forest on the left. Turn up this track."
      },
      {
        "stage": 2,
        "description": "As the track enters the trees, take a path off to the left - signed Achriabhach Trail - Mamore hill access. This climbs up close to the edge of the conifers, soon passing through a gate. It then ascends steeply; much of the commercial forestry has been replaced by regenerating native birches, and there are views across the glen. Further up, the path passes a waterfall on the Allt a'Choire Dheirg. Continue the ascent until the path climbs steps and reaches a forest track at a sharp bend, with a view of the mountain ridge around Coire Dearg high above."
      },
      {
        "stage": 3,
        "description": "Don't go along the track, but take the path that continues opposite. This continues the ascent; after a short distance there is a seat off to the left with a truly magnificent view up Glen Nevis towards the Nevis Gorge. Continue up the path, with improving views of Ben Nevis behind, until finally some more stone steps bring you up to another forestry track."
      },
      {
        "stage": 4,
        "description": "Turn right along this track; there are more great views ahead, this time down Glen Nevis towards the foot of the glen. Follow the track gently downhill until it meets a junction with another track. Turn sharp right here, and continue down this new track to reach the sharp bend the path briefly crossed earlier. This time continue on the track which swings sharply to the left."
      },
      {
        "stage": 5,
        "description": "The descent continues on the track to yet another junction. As before, turn sharp right for this final zig-zag, and follow the track back down to the road at Achriabhach and the start."
      }
    ],
    "scraped_at": 1756309836.0739381
  },
  {
    "title": "Loch Vaa, near Aviemore",
    "summary": "Hidden away in the pinewoods just off the A95 between Aviemore and Boat of Garten, Loch Vaa is a secluded gem. This short walk makes a straightforward circuit around the loch.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/loch-vaa.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.0,
    "ascent_m": 28,
    "start_grid_ref": "NH910174",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from next to Laggantrygown Cemetery, which is just off the main A95 between Aviemore and Boat of Garten. The parking for Loch Vaa is on the left with the locked cemetery car park to the right - there is further parking in a layby towards Aviemore. Begin the walk on the clear path outside the left edge of the cemetery. This soon swings left and climbs up a wooded ridge; known as an esker, this was formed by glacial action. The path then forks; keep ahead on the main path which curves left downhill to the shores of Loch Vaa."
      },
      {
        "stage": 2,
        "description": "The loch is a beautiful and secluded place set amidst stunning pine and birchwoods, although it is only a stones throw from the busy road. Continue along the shores (depending on the water levels) to the left towards the very attractive boathouse."
      },
      {
        "stage": 3,
        "description": "Head into the woods to the left of the boathouse. Further on a track leads through the forest. Stay on the main track, ignoring a path off to the right. Eventually a (locked) gate is reached; pass to the right of this, turning right along the track beyond."
      },
      {
        "stage": 4,
        "description": "Keep along this track. Ignore a path off right, then a fainter track after 500m. After 1km from the gate, look out for another track off right that has two branch points, the second with a small boulder amidst smaller rocks at the turning. Follow this track, which leads back towards Loch Vaa."
      },
      {
        "stage": 5,
        "description": "It eventually becomes a path (with a view through the trees to the loch down to the right) - ignore the path heading steeply down to the loch, instead continuing ahead to cross a stile over a fence. Beyond this the path climbs a low wooded hill with good views over the loch."
      },
      {
        "stage": 6,
        "description": "When the narrow path forks again take the right branch which descends steeply. The path then undulates, with a final steeper climb where a fence comes alongside on your right (and the loch beyond). Continue along the fence path until a stile. Cross this and follow a path along the top of a esker until it reaches the outward route near the start. Turn left here to head back to the cemetery and car park."
      }
    ],
    "scraped_at": 1756309838.1642368
  }
]