[
  {
    "title": "The Fairy Glen, near Uig",
    "summary": "A bizarre and delightful miniature landscape of grassy, cone-shaped hills, the Fairy Glen (sometimes spelt Faerie Glen) is a fascinating and otherworldly place to visit.",
    "source_url": "https://www.walkhighlands.co.uk/skye/fairyglen.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.5,
    "estimated_hours": 1.0,
    "ascent_m": 45,
    "start_grid_ref": "NG411632",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Take the side road which leaves the A87 near the Uig Hotel - signed for Sheader and Balnaknock. After a few houses the Fairy Glen comes into view ahead as you descend. There is a pay-and-display car park on the left.  Take the obvious path from the car park that slopes uphill from a parking meter. It soon reveals a striking view of a unique landscape; the Fairy Glen was formed by the land being disrupted by a series of landslides (on a smaller scale than the huge landslips that formed the Storr and the Quiraing), with the results then smoothed by subsequent glaciation."
      },
      {
        "stage": 2,
        "description": "Stay on the good path that descends and passes between some of the striking grassy conical hills. The path leads past a small lochan and then emerges on the road. Go straight across and follow the path as it bends left, running parallel to the road briefly, and then diverging around the opposite side of a lochan. Soon the sharp park of Castle Ewen is seen - the path climbs to the right of this."
      },
      {
        "stage": 3,
        "description": "The path emerges at a grassy hollow next to Castle Ewen. From here you can make a detour to the summit of this rocky tower if you wish - a steep path leads up onto the ridge. Head left along the narrow ridge and then up a final scramble up a rocky step in a gap in the summit tower - great care is needed."
      },
      {
        "stage": 4,
        "description": "The summit is surprisingly spacious, with enough flat grass for a picnic."
      },
      {
        "stage": 5,
        "description": "Retrace your steps to return to the grassy hollow below the ridge. A great deal of work has taken place here to clear away the stone stacks made by visitors which were causing damage to the grazing land - please leave any stones as you find them. Now take the path that heads through the gap to the right of the Castle Ewen ridge. This soon descends to meet the minor road."
      },
      {
        "stage": 6,
        "description": "Once back at the road, turn left to head back to the start along it. Castle Ewen looks impressive across a small loch."
      }
    ],
    "scraped_at": 1756310176.3094475
  },
  {
    "title": "Coille Iòsal, Braes",
    "summary": "This short walk is set in the heart of the lovely Braes area south of Portree. It climbs up through native woodland to visit a waterfall before a more open return giving great views across the Sound to Raasay and Ben Tianavaig.",
    "source_url": "https://www.walkhighlands.co.uk/skye/braes.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 111,
    "start_grid_ref": "NG515366",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "There is a parking area at Braes village hall, by the recycling bins. The Braes was the site of the famous Battle of the Braes where local crofters fought Glasgow policemen during the Crofters' struggle for security of tenure - there's a memorial to the Battle a kilometre further down the road. Back at the car park, the walk begins opposite the stone buildings. It heads through some lovely native woodland of birch, hazel, rowan and juniper."
      },
      {
        "stage": 2,
        "description": "Follow the white markers as the path heads uphill, passing above a ravine to eventually emerge onto the open moor. The path continues up the moor, crossing a tiny bridge and having some wooden steps in places. There are great views looking back across the Sound."
      },
      {
        "stage": 3,
        "description": "Near the top, it comes alongside a pretty cascading waterfall. Continue above the waterfall to a gate."
      },
      {
        "stage": 4,
        "description": "Go through the gate and immediately turn right (ignoring the second gate ahead). Soon the path becomes a track. There's a bench here with a fabulous view of Raasay and Ben Tianavaig."
      },
      {
        "stage": 5,
        "description": "Continue on the track, which passes beneath a waterworks and a small electricity substation as it descends back down to the Braes road. Turn right along the road to return to the start."
      }
    ],
    "scraped_at": 1756310178.8940446
  },
  {
    "title": "Dùn Scaith Castle, Tokavaig",
    "summary": "This very short walk leads to the dramatic remains of Dùn Scaith Castle. The views are quite simply sensational, well justifying the drive along the switchback road to reach the start.",
    "source_url": "https://www.walkhighlands.co.uk/skye/dunscaith.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 2,
    "distance_km": 2.0,
    "estimated_hours": 40.0,
    "ascent_m": 20,
    "start_grid_ref": "NG600118",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park off the road at Tokavaig Bay, which has the most sensational views of the Cuillin and Bla Bheinn, with Dùn Scaith castle visible as a foreground. Walk along the road towards Ord. Just past the cattle grid a track branches off to the left. Turn sharp left here."
      },
      {
        "stage": 2,
        "description": "Follow the track across the head of the bay passing a prominent rock outcrop on your right. The track leads to a whitewashed crofthouse. Pass to the left of the house; the going from here has only faint paths, but it doesn't matter whether you head directly over the low rise or keep closer to the shoreline; either way you'll approach the castle."
      },
      {
        "stage": 3,
        "description": "The remains of Dùn Scaith castle date back to the 13th century but occupying an older, fortified site. The castle, perched on a rock above Loch Eishort, was a stronghold of the Macleod before it became the principal seat of the MacDonalds of Skye in the 15th century.  Among the many legends associated with Dùn Scaith are those recounted in Macpherson's 'Ossian' concerning the adventures of the Irish folk hero Cu Chulainn, who came here when he first landed in Skye. One tradition tells how he came here to learn the marshal arts of war from the warrior queen 'Sgathaich', whose home this was. The castle is reached over a gully bridged by two walls which flanked a drawbridge, whose pivot holes are still visible on the far side. With the drawbridge missing the dangers of entering the castle can be clearly seen. On the far side of the bridge a door would have opened onto a flight of steps leading up between walls to the castle."
      },
      {
        "stage": 4,
        "description": "Parts of the curtain wall (one of the earliest surviving examples in the district of lime-mortared construction, being random rubble with smaller infill bound with lime) still cling to the cliff edge, but what survives of the internal structures (which probably included a tower) are identifiable only by grassy mounds. In the courtyard is a well, and at the south east angle are remains of a stair within a tower leading to the parapet walkway. To the right of the castle great views of the Cuillins can be seen on a clear day. Immediately across the water are the remains of the cleared villages of Boreraig and Suisnish."
      },
      {
        "stage": 5,
        "description": "Return to the road along the same outward path and track."
      }
    ],
    "scraped_at": 1756310181.4763572
  },
  {
    "title": "Kylerhea Otter Hide trail",
    "summary": "Easy walk with lovely views over the Kyle strait to the mainland. The hide at the midway point gives a good opportunity to spot otters, seals and other wildlife. Picnic tables and toilets near start.",
    "source_url": "https://www.walkhighlands.co.uk/skye/kylerheaotter.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 1,
    "distance_km": 2.25,
    "estimated_hours": 1.0,
    "ascent_m": 43,
    "start_grid_ref": "NG786211",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the Kylerhea Forestry and Land Scotland car park on the left as you come down the hill towards Kylerhea. Just below the parking there's a lovely picnic area overlooking the water and the Skye Ferry from Glenelg."
      },
      {
        "stage": 2,
        "description": "Follow the track north, soon passing the toilets. There are breaks in the mixed woodland with seats offering great views over the water."
      },
      {
        "stage": 3,
        "description": "Turn right at a fork, then right again on the main path whic leads downhill to reach the otter hide. The hide is free (donation box) and open all year.  While otters may prove elusive, there are usually seals to be seen on the rocks to the left of the lighthouse."
      },
      {
        "stage": 4,
        "description": "Retrace your steps the same way back to the car park."
      }
    ],
    "scraped_at": 1756310184.063243
  },
  {
    "title": "Scorrybreac circuit, Portree",
    "summary": "A beautiful circuit on the north side of Portree bay, popular with both visitors and local dog walkers.",
    "source_url": "https://www.walkhighlands.co.uk/skye/scorrybreac.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 2.0,
    "ascent_m": 164,
    "start_grid_ref": "NG488437",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Scorrybreac Road is the first right turn after passing above the harbour on the road towards Staffin (signed Cullin Hills Hotel). There are marked parking bays on the shore just after the turning to the Cuillin Hills hotel. There are picnic tables here, and further along the route. A display board gives a map and details of this walk. The walk begins along the tarmac path close to the wooded shore, giving excellent views of the cottages around Portree Harbour. A prominent tower in the woods above the harbour is an example of an Apothecary's tower, built as a sign to passing seafarers that medical supplies and expertise are available in the village. Photo: Portree harbour from Staffin road"
      },
      {
        "stage": 2,
        "description": "The path soon passes the boathouse which is the home of Portree sailing club before crossing a footbridge and reaching a gate signed 'Urras Clann Mhicneacail'. This is Gaelic for the Nicolson Trust, the headland beyond has been purchased by members of the Clan Nicolson from all around the world, Scorrybreac being considered the homeland of the clan."
      },
      {
        "stage": 3,
        "description": "Through the gate, the path becomes gravelled. To the left of the path is a memorial with a flagpole and grand views across Loch Portree to the distant Cuillin hills. The plaque commemorates the members of Clan Nicolson who contributed to buying this land. A further gravel path and steps can be optionally climbed to reach a higher viewpoint above the cliff."
      },
      {
        "stage": 4,
        "description": "Back on the main path, continue beside the shore. The low lying land blocking the entrance to Portree bay is part of the Isle of Raasay, whilst the hill directly across the bay is Ben Tianavaig. White-tailed eagles nest on the inaccessible cliffs below Ben Tianavaig, so keep a keen eye out. The outcrop of rock just offshore, which can be reached at low tide, is the Black Rock, whilst across Loch Portree you can clearly see the sandy beach at Camas Ban. The loch itself is home to a number of salmon farms. The fish can usually be seen within their enclosures as they jump up from the water. Common seals can also sometimes be seen swimming by the shore."
      },
      {
        "stage": 5,
        "description": "The path reaches a stone seat where a view of the high coastal cliffs to the north are revealed. The going becomes stonier at this point; continue ahead on the path until it reaches a dry stone wall. Here, turn left and follow the path uphill, at first beside the wall; soon it bends left and ascends a steep series of zig-zags."
      },
      {
        "stage": 6,
        "description": "Above the zigzags, the route levels off. There are great views over the salmon farms to Raasay, with Dùn Caan prominent like a little volcano. The route now loses sight of the coastline and crosses more open countryside. Continue on the path, passing through a kissing gate before heading downhill to a further gate. The path now enters an attractive silver birchwood. After another kissing gate, the path descends along the edge of the wood before emerging behind the Cuillin Hills hotel. Continue down the tarmac road back to the start point."
      }
    ],
    "scraped_at": 1756310186.652054
  },
  {
    "title": "Neist Point",
    "summary": "Neist Point - the most westerly headland on Skye - is an iconic destination, with stunning cliff scenery, a fine lighthouse, an outlook to the Outer Hebrides, and the chance to watch for minke whales in the summer months.",
    "source_url": "https://www.walkhighlands.co.uk/skye/neistpoint.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 2.0,
    "ascent_m": 142,
    "start_grid_ref": "NG132478",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the end of the road. There is enough space for a number of cars. The parking can be congested in the summer months, but new spaces created alongside the road are a great help. Begin by following the path through the gate, which if locked can be easily walked round. The only actual private area is that fenced around the lighthouse and cottages - the rest is the common grazings for Waterstein township. Almost immediately turn left on the path, which then swings right to ease the descent to the headland far below. There is a metal handrail for most of the descent."
      },
      {
        "stage": 2,
        "description": "There is an aerial ropeway which is used to take supplies out to the lighthouse and cottages at the Point. Continue along the now level path. Several scenes in Lars Von Trier's film Breaking the Waves were shot here. It is possible to detour to the right to visit the edge of the cliffs, overlooking the great prow of An t-Aigeach  (meaning the Stallion's Head), the dramatic upstanding crag half way out on the headland. The crag is the site of some of Skye's hardest rockclimbs.  To the left are great views to the impressive cliffs of Waterstein Head and the Hoe, the second highest on Skye."
      },
      {
        "stage": 3,
        "description": "At the highest point of the constructed path, a grassy path heads off to the right - this is an optional detour to the top of  An t-Aigeach. If you decide to visit the top take great care near the cliff edge, and retrace your steps back to the main path. As the corner is rounded the lighthouse comes into view for the first time."
      },
      {
        "stage": 4,
        "description": "Continue along the path towards the lighthouse and the former keepers' cottages (once run as accommodation but now closed down). The complex was built in 1909 at a cost of £4,350 - the engineer being David A Stevenson of the famous Stevenson family of lighthouse builders. From the path junction, you can turn left along a made path to reach the crane and crane which was once used to bring in supplies. It is also worth detouring across rougher pathless ground beyond the lighthouse complex to reach the furthest point. Look out for breaching fins and blows in the sea - this is one of the best places for whales and dolphins on Skye."
      },
      {
        "stage": 5,
        "description": "The return route is back the same way. It is worth detouring to the left from the path before it heads round An t-Aigeach to visit the cliff edge; from here you can watch seabirds in season but take care as the edge is, of course, unprotected."
      },
      {
        "stage": 6,
        "description": "For the classic view of the lighthouse beyond the cliffs, you can head on a boggy path northwest from the car park for a short distance (this is the start of the Neist and Milovaig clifftop walk). This must rank as one of the best places imaginable from which to watch the sunset."
      }
    ],
    "scraped_at": 1756310189.236361
  },
  {
    "title": "Dunvegan Two Churches Walk, Dunvegan",
    "summary": "Park in the car park at the Duirinish Church of Scotland in Dunvegan village, on the road towards the castle. The walk starts through gate to the left of the church; there is an information board giving details of the route. At first the route leads through a felled area - which is being replanted with native trees.",
    "source_url": "https://www.walkhighlands.co.uk/skye/twochurches.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 45.0,
    "ascent_m": 88,
    "start_grid_ref": "NG251479",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the car park at the Duirinish Church of Scotland in Dunvegan village, on the road towards the castle. The walk starts through gate to the left of the church; there is an information board giving details of the route. At first the route leads through a felled area - which is being replanted with native trees."
      },
      {
        "stage": 2,
        "description": "Further on the path narrows and reaches more established native woodland. There are many wild flowers here in spring and summer, and glimpses of a view over Loch Dunvegan. After some Eventually an unmarked T junction is reached with a larger path. Turn right, heading uphill. The path climbs up to pass through a gate and reaches the open moor beyond."
      },
      {
        "stage": 3,
        "description": "As the path begins to descend look for a pedestrian gate in the fence on the right  - there's a prominent standing stone on the hill beyond. Pass through the gate and head for the stone. The stone is a commanding viewpoint for Dunvegan village and miles around, but it is not a prehistoric monument. Instead, it was erected on midsummer's day 2000 by the villagers of Dunvegan, using only hand power and ropes. As the stone is fifteen feet high and weighs five tons, this was an impressive feat, and presumably used the same techniques as would have been used to build stone circles thousands of years ago."
      },
      {
        "stage": 4,
        "description": "There are excellent views of Macleods Tables, and the distant Cuillin ridge. Head downhill on a faint grassy path towards the ruined church in view."
      },
      {
        "stage": 5,
        "description": "The path passes just to the right of St Mary's Church, which dates to before the reformation, to reach the road. Turn right on the road (crossing over for the pavement), and right again at the T junction to return to the current church and the start."
      }
    ],
    "scraped_at": 1756310191.8314097
  },
  {
    "title": "Dùn Ringill, Kilmarie",
    "summary": "A short, attractive walk to the remains of a medieval castle, visiting a Chambered Cairn on the way back.",
    "source_url": "https://www.walkhighlands.co.uk/skye/dunringill.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.5,
    "ascent_m": 27,
    "start_grid_ref": "NG554172",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the small car park just beyond the Kilmarie house next to Kilmarie burial ground. Walk back up the road past the house until you reach a metal gate on the right leading to a woodland path. Follow this path and cross the ornate bridge over the Abhainn Cille Mahaire. Kilmarie House was until 1994 owned and lived in by Ian Anderson, the singer and flautist who fronted Jethro Tull, since 1968. He sold the estate at a very reasonable price to the John Muir Trust who now manage the land with conservation as the first priority. The house - and most of the ground on this route - remain privately owned and the current owners request that walkers observe the access code and in particular keep dogs under tight control to protect the wildlife along the route."
      },
      {
        "stage": 2,
        "description": "Immediately after crossing the bridge take the path on the right running parallel to the river. The path heads out to the bay passing a ford with stepping stones. Don't go through the gate but keep to a grassy path alongside the fence. At one point the fence turns left (leading towards a stile) - continue straight on here across a tiny stream to reach another stile further on. Cross this stile and follow the boggy path beyond."
      },
      {
        "stage": 3,
        "description": "A clear, and in places boggy, path follows the coast climbing very gently. In a short distance it joins a clearer path coming in from the left (this route is used for the return). After a small rocky headland, the built remains of Dùn Ringill can be seen on the right near the cliff edge. The path leads over to the Dùn. The entrance is intact and can be passed through to give a good view up and down the coast from the Dùn. Dùn Ringill was the original seat of Clan Mackinnon before they moved to Castle Moil at Kyleakin. It was built on the site of an earlier iron age broch or fort."
      },
      {
        "stage": 4,
        "description": "After exploring the coast and enjoying the views, return back along the path to where you came up from the left earlier. This time continue on the main path; soon it crosses a stream on the edge of the wood. One path goes downhill left from here to return to the outward route; instead, follow the path uphill to the right into the trees. Soon this path passes a bench; a very short distance beyond this turn left along another grassy path. This passes the remains of some stone buildings with a view of the twin summits of Bla Bheinn ahead. Turn left at yet another fork and the path soon becomes a track."
      },
      {
        "stage": 5,
        "description": "Continue along the track. Soon it heads down towards a dip with a rise ahead; look out on the left before the dip for a path heading into the trees (a sign here reads 'No Camping, No Fires). This path leads back down through the woods to the footbridge crossed near the start of the walk. Immediately before reaching the footbridge, look left to see a prominent but overgrown grassy mound. This is the Kilmarie Chambered Cairn, one of the best examples on the island. Near the top of the cairn (on the same side as the stream) is a small square opening or cist; these were used for burial. A beaker found in the cist here is in the National Museum of Scotland. Take great care not to disturb or damage the site before returning over the bridge to the start."
      }
    ],
    "scraped_at": 1756310194.416503
  },
  {
    "title": "Cnoc a'Mhadaidh Ruaidh, Kyleakin",
    "summary": "This short walk follows the Anavig Trail climbs through mixed woodland above the edge of Kyleakin. There are superb views over the Skye Bridge, Kyleakin, the Cuillin and distant Trotternish, more than making up for the massive nearby quarry works that mar the coast below.",
    "source_url": "https://www.walkhighlands.co.uk/skye/cnoc-a-mhadaidh-ruaidh.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 10,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 89,
    "start_grid_ref": "NG743263",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Old Kyle Farm Road is the minor road heading south from the Skye Bridge roundabout on the edge of Kyleakin. There is a layby on the right a short distance along the road before the first house; the walk begins from here, where there is an information board. Follow the gravel path that starts between the two boulders and climbs through into native woodland, soon crossing a small wooden bridge."
      },
      {
        "stage": 2,
        "description": "Soon the views really begin to improve, first towards the flat-topped summit of Dùn Caan on the Isle of Raasay, and then back over the steep hump of the Skye bridge and over Kyleakin."
      },
      {
        "stage": 3,
        "description": "After a climb a fork is reached where a rocky path leads off right; this is used on the return route so ignore it for now. Continue ahead on the main path, ignoring a blue waymarked path which turns off to the left. The path then reaches a clear section near the summit of Cnoc a'Mhadaidh Ruaidh (the hill of the red fox). The views are simply superb. Applecross is visible on the mainland, with the long outline of Raasay to its left, and the distant Storr in Trotternish is visible beyond."
      },
      {
        "stage": 4,
        "description": "However perhaps the dominant feature are the steep but rounded outlines of the Red Hills, with the spikier Cuillin peaking out over them in places; the path heads this way, eventually curving left."
      },
      {
        "stage": 5,
        "description": "Soon the path reaches a bench backed by a view of the Kylerhea Hills. Continue to reach a path junction. The easiest way back from here is to turn left on the blue route which soon loops back to the outward route. Otherwise, turn right to keep following the red route; this path descends gradually around the north side of the hill across a felled area, eventually swinging back to return across the hillside at a lower level. There are views through birchwoods to the industrial buildings comprising a massive fish feed plant."
      },
      {
        "stage": 6,
        "description": "The path crosses a wooden bridge and climbs once more to reach an area of more open, native woodland. At one point the path climbs a rocky slab, but this can be bypassed using a route off to the left. Once again there are views ahead of Kyleakin and the Skye Bridge, now from a new angle. Eventually the outward route is rejoined; continue ahead and follow the path back down to the start."
      }
    ],
    "scraped_at": 1756310197.045206
  },
  {
    "title": "Bearreraig Bay",
    "summary": "Bearreraig Bay is a beautiful stony bay famous for its fossils - a short walk with a very steep path. This is a quiet and secluded place when the nearby Old Man of Storr is packed with visitors.",
    "source_url": "https://www.walkhighlands.co.uk/skye/beareraigbay.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.25,
    "estimated_hours": 2.0,
    "ascent_m": 153,
    "start_grid_ref": "NG516524",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Heading north on the main road from Portree, the Hydro road turns off on the right immediately after the Storr Lochs. There is a bus shelter next to the turning. There is a parking area part way along this road before the dam. Start the walk here and continue along the road before turning right to leave the road at a path sign to follow a short section of path skirting the house and turning area."
      },
      {
        "stage": 2,
        "description": "The winch house is the square flat roofed building used to pull a carriage up and down a funicular track to the Hydro station below. Bear left to head down the far side of the winch house to reach a viewpoint.  The viewpoint has superb views of the bay below, with the Storr cliffs visible far above. Interpretative displays explain about the fossil finds and the geology. The path down to the bay starts on the seaward side of this viewing area, descending in a series of zigzags. It soon reaches a staircase cut out of the rock above a big drop - luckily this part has a handrail!"
      },
      {
        "stage": 3,
        "description": "Beyond the path continues zigzagging right down to the Hydro station on the beach. The hydroelectric scheme, which includes the Storr Lochs on the moorland above, was built in 1952 and gave Skye its first electricity supply (apart from the Royal Hotel which had a generator). It has a capacity of 2.4MW, not nearly enough to supply the island's needs today. You can see the turbine through the windows. Go through the gate and head along the front wall of the building, passing above the water rushing out from the turbines. Beyond the building, cross the stile. Usually it is easy to cross the burn near here as most of the water now heads through the turbines instead but occasionally there is more water here and it may be impassable."
      },
      {
        "stage": 4,
        "description": "After crossing there's a broken stile. Cross to head out onto the stony beach - looking out for otters which can sometimes be spotted swimming offshore. At the far end of the bay crumbling cliffs reach down almost to the sea. Below these cliffs is the best place to hunt for fossils - at low tide; but don't take any away as this is a protected site. Afterwards, return back past the front of the hydro building. Before heading back up the steep path to the right, it's worth crossing the stile ahead and exploring the wave cut platforms at this end of the beach. If you round the corner of the bay you can see Holm Island just offshore - according to local legends this was Tir Na Nog, the land of eternal youth. It's necessary to reascend the path you came down in order to return to the start."
      }
    ],
    "scraped_at": 1756310199.6332908
  }
]