[
  {
    "title": "Torridon Trail - boathouse walk",
    "summary": "Easy waymarked walk with beautiful views across Loch Torridon. The walk includes a beauiful section of shoreline.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Lochtorridon.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.5,
    "estimated_hours": 45.0,
    "ascent_m": 40,
    "start_grid_ref": "NG889542",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the parking for Torridon Activities/Beinn Bar (the entrance after the Torridon Hotel turn off the A896 heading east between Torridon and Sheildaig). From the car park head into the courtyard behind the Beinn Bar and follow the track over a small bridge. At the cross-tracks, keep straight ahead - our route follows the markers for 'Torridon Trail'."
      },
      {
        "stage": 2,
        "description": "The track continues through the pinewoods - great effort has been made in recent years to restore these to good condition, after the area was blighted by invasive rhododendrons. It is now starting to recover its former glory. Eventually a junction is reached - the track ahead continues towards the Falls of Balgy - a much longer walk - whereas our route turns right onto a path, signed for Torridon Trail."
      },
      {
        "stage": 3,
        "description": "The path winds through the trees, passes through a gate, gives a view over the boathouse to the left, and then descends steeply to reach a track. Turn right along the track along the loch shores. There are superb views across the water towards Torridon village and Liathach looming behind."
      },
      {
        "stage": 4,
        "description": "Continue along the shore, with an increasinly lovely view back over the pine-clad islet of Eilean Chasgaig across Loch Torridon to the mountain of Beinn Alligin on the far side. This is a good spot to catch a sighting of herons, oystercatchers and otters. Eventually the track swings right away from the loch. Turn left through a gate signed for the Kitchen Garden. Head into this walled garden which still produces vegetables for the Loch Torridon hotel. Turn right in the centre of the garden to pass alongside the polytunnels, passing through a gate to leave the garden and join a track. Turn right along the track to return to the start."
      }
    ],
    "scraped_at": 1756310847.817512
  },
  {
    "title": "Buzzard Path, Beinn Eighe visitor centre",
    "summary": "This short, attractive walk in the Beinn Eighe National Nature Reserve begins from the visitor centre - a great source of information. The walk has a good path through the pinewoods leading past several excellent sculptures but perhaps the greatest attraction is the superb views of Beinn Eighe and Slioch.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Talkingtrail.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.5,
    "estimated_hours": 30.0,
    "ascent_m": 50,
    "start_grid_ref": "NH020630",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the car park for the Beinn Eighe Visitor Centre at Aultroy on the A832. The visitor centre is housed in an old white cottage; there are also toilets. The walk begins past the front of the visitor centre, reaching an attractive picnic area with finely carved benches and tables."
      },
      {
        "stage": 2,
        "description": "There is a large wooden hide here overlooking bird feeders - with more information on the species you might see inside. Continue along the path until a junction, with a curved stone seat opposite; turn right here. Ignore the next turning on the right, keeping on the main path (with a buzzard symbol). Soon there's a curved wooden seat on the right, engraved with poetry."
      },
      {
        "stage": 3,
        "description": "The walk continues along the excellent, dry path. When a seat is reached it is possible to make a short detour to the left to visit a woodland pond - a great place for dragonfly. Back on the main path, continue to reach and cross a large wooden bridge. Beyond this the path leads through some silver birches."
      },
      {
        "stage": 4,
        "description": "The path then emerges at a track. Bear right here to continue on a footpath, soon climbing a long flight of steps. There are great views of the eastern scree-girt peaks of Beinn Eighe ahead, and Slioch behind. The path soon reaches a junction; turn right, ignoring the lesser path straight ahead. Soon you will reach an elaborately built seat at the highest point on the trail."
      },
      {
        "stage": 5,
        "description": "From here, the trail continues downhill, with fine views of Slioch ahead, to emerge briefly on the outward route. Turn left here, then turn right at the next junction for a different route back to the start."
      },
      {
        "stage": 6,
        "description": "The car park is just a short distance further on, past a fine stone sculpture of a pine cone. If you've enjoyed this walk, consider also doing the Woodland Trail just a short distance north up the A832, which has much older pinewoods."
      }
    ],
    "scraped_at": 1756310850.4018145
  },
  {
    "title": "Cuaig Beach",
    "summary": "This short walk to a little visited but beautiful sandy beach. The walk is best done around low tide as the sands are covered when the sea comes in.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Cuaig.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 1.0,
    "ascent_m": 40,
    "start_grid_ref": "NG706578",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park on the inland side of the road where it is widened, just east of Cuaig bridge. The walk begins by heading west along the road and across the bridge. Around 80m after the bridge turn right to head through a gate. The path beyond is good at first but becomes boggy; soon it passes through a gap in a fence, keeping to the top of the bank above the burn at first."
      },
      {
        "stage": 2,
        "description": "Slowly the path slopes down to reach the river bank and becomes very boggy, passing through another gate. Ahead on this side of the river, the bank has been built up as part of the construction of an old salmon fishing station. Cross the river using the large stepping stones."
      },
      {
        "stage": 3,
        "description": "On the other side, turn left to head towards the beach. It is easiest to keep just to the right of the old stone walls and boat nousts before heading across to the sands where there are fewest boulders. If the tide is half in you'll need to scramble over rocks to reach the beach - which is completely submerged at high tide. The beach here has wonderful fine sands at low tide and is very infrequently visited."
      },
      {
        "stage": 4,
        "description": "The return is the same way."
      }
    ],
    "scraped_at": 1756310852.983593
  },
  {
    "title": "Laide Wood, near Aultbea",
    "summary": "This short and easy walk leads through a former commercial plantation, now run as a community woodland with broadleaf species being planted. It visits two forest lochs and a cascading burn, and is very popular with local dog-walkers.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/laide-wood.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 45.0,
    "ascent_m": 25,
    "start_grid_ref": "NG894907",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "The car park for Laide Wood is well signed from the A832 south of Laide. Planted by the Forestry Commission from 1963 - 1967, the forest was aquired by a community charity in 2003. Since then a series of paths have been laid out between the original lodgepole pines and the newer native trees. Begin the walk from the far end of the car park where there is a noticeboard and a picnic table."
      },
      {
        "stage": 2,
        "description": "On a good day the mountains visible include the tent-shaped Beinn Ghobhlach as well as pinnacled An Teallach.  Follow the path as it heads downhill through a felled area to pass between two blocks of trees. The path crosses a small bridge and then follows a burn, the banks of which are decked with primroses in the spring. The path then turns to the right, crossing the burn by another bridge near a bench."
      },
      {
        "stage": 3,
        "description": "Continue, crossing yet another burn, to reach a path junction. Turn left here to begin a short detour loop to visit Loch na Creige, which is reached at an angled path junction by a wildlife hide. Continue ahead here, crossing a footbridge and ignoring a new path off to the left. The trail eventually reaches the burn feeding the loch, with a cascade on the left and a bench overlooking the water to the right."
      },
      {
        "stage": 4,
        "description": "Retrace your steps to the hide and this time take the left fork. This path winds through the trees for some distance before eventually emerging by Loch na Cathrach Duibhe. Continue along the path until it reaches a t-junction with the main trail. Turn left here."
      },
      {
        "stage": 5,
        "description": "The route passes more picnic tables and climbs from the loch.The habitat is being improved by the planting of varied species by volunteers; look out for moorhens, mallard or herons using the loch and for woodpeckers and treecreepers amongst the trees. Continue on the main path which eventually leads back up to the car park."
      }
    ],
    "scraped_at": 1756310855.5765748
  },
  {
    "title": "Gruinard Bay and the Eas Dubh falls",
    "summary": "This short walk combines a visit to a beautiful sandy beach with a brief but rough hike up a beautiful glen to reach an attractive waterfall.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/gruinardbay.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 90,
    "start_grid_ref": "NG952899",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Gruinard Bay ranks amongst the finest sandy bays in this part of the Highlands - a beautiful sweep of golden sand, especially at low tide; it is seen particularly well from an elevated layby a short distance west along the main road. The walk itself begins from the car park east of the river near Little Gruinard."
      },
      {
        "stage": 2,
        "description": "Cross over the road and go down the wooden broadwalk to reach the sands of Gruinard beach.  Turn left along the beach; before reaching the river, look out for a path leading back up the dunes - this leads back to the road at a pedestrian gate."
      },
      {
        "stage": 3,
        "description": "Turn right along the road (care - it can be busy) for a short distance before turning left through the gate just before the bridge. The path - initially more of a muddy ATV track - swings left to avoid the gorse bushes, but it's worth detouring for a look upriver first."
      },
      {
        "stage": 4,
        "description": "Back on the muddy track, this soon becomes an indistinct path - follow the clearest trod past the area of gorse bushes, eventually losing a little height. The path becomes clearer as it runs along a short distance above the river, and eventually it runs beside the water itself."
      },
      {
        "stage": 5,
        "description": "After about a kilometre and a half the path reaches a viewpoint for the Eas Dubh a Ghlinne Ghaibh, a fine and very attractive waterfall. The path does continue further upstream but runs across a steep slope above a gorge, and it isn't really possible to make a circular walk, so it is probably better to return the same way. Rather than head back across the beach, it is possible to shortcut from near the end of the glen section to head more directly down to a stile giving access to the car park."
      }
    ],
    "scraped_at": 1756310858.1787775
  },
  {
    "title": "Gairloch Beach and Pier",
    "summary": "This short but varied walk takes in the stunning Gaineamh Mhòr beach of Gairloch before climbing across to the pier at Charlestown. The return walk is via the Flowerdale Arboretum.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/gairloch-beach.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.0,
    "ascent_m": 85,
    "start_grid_ref": "NG806756",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Begin from the large public car park by Gairloch golf club. From here a wooden walkway slopes down towards the beach; at one point it forks - the left branch continues through the dunes but unless the tide is very high, continue ahead down to the golden sand. The beach, known as Gaineamh Mhòr in Gaelic, is truly stunning, all the better for being between the two built up parts of Gairloch (Charlestown and Strath) and thus backed by the verdant green of the golf course and hills."
      },
      {
        "stage": 2,
        "description": "Turn left and cross the sands to the far end of the beach where a clear path climbs up. The dune path rejoins from the left here beside a buoy; instead head slightly to the right and then left, as indicated 'To the Pier' on a wooden signpost. Before taking the path it is worth exploring the tiny An Dùn headland on the right - the name being an indicator that this was once the site of an ancient fort. Contininuing the walk, the excellent path climbs south above a rocky bay before passing through native woodland via a wooden walkway. Another signpost then indicates where to turn left (counter intuitively!) and climb across the moorland above the beach. There are stunning views over the sands to the Strath part of Gairloch."
      },
      {
        "stage": 3,
        "description": "After passing a bench the path becomes rocky as it curves round to the right, with magnificent views to the mountains, dominated by the great square block of Baosbhein. The path soon begins to descend beside a fence as the buildings of Charlestown and the pier come into view below. Another signpost indicates where to turn right down the steps to emerge on the road beside the chandlery. Charlestown has both a cafe and a shop; the walk continues by turning left along the road."
      },
      {
        "stage": 4,
        "description": "Cross directly over the main A832 road to reach a parking area opposite the Old Inn (see Gairloch hotels for details). Do not cross the bridge but instead take the 'Flowerdale' path that continues parallel to a track. This soon passes a pond with a beautiful view up the Flowerdale Glen."
      },
      {
        "stage": 5,
        "description": "Look out for a wooden signpost that indicates a left turn for the 'Flowerdale Arboretum circuit', which continues directly across the track. This ascends slightly and is marked by green spots on posts; turn left at the next two path junctions. Now continue on the main path as it winds up to the top of the Ord na h-Eaglaise. A bench provides an opportunity for a break with a great outlook over the golf course to the sea beyond. Continuing, the path now descends gradually through the fine woodland, decorated with rhododendrons."
      },
      {
        "stage": 6,
        "description": "At the bottom of the slope again keep to the main path as it swings back to the left before heading right across a small wooden bridge and pass along the edge of the woodland. Cross the flat valley floor and climb slightly up into the trees on the far side to reach a clear path at a t-junction. The waymarkers head back to the right, across a bridge, to return to the Flowerdale Glen here. Our walk instead turns to the left and continues to contour the slope through the woods. Once level with a cemetery follow the path as it turns down to the left and across the back of the cemetery. At the far end turn right onto a broad lane that leads back to the main road immediately opposite the car park and the start. Before leaving the area, be sure to enjoy the view of the beach from the viewpoint a short distance north along the road."
      }
    ],
    "scraped_at": 1756310860.8094175
  },
  {
    "title": "Applecross and Milltown circuit",
    "summary": "This circuit around Applecross explores the nearby woods, crofts and loch all providing havens for wildlife. The route also visits a broch, a reconstructed round house and some historic barns. The return route has good sea views;  this short walk should leave plenty of time to explore the shore and visit the renowned Inn.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/milton-applecross.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.75,
    "estimated_hours": 1.0,
    "ascent_m": 75,
    "start_grid_ref": "NG711445",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the Applecross village car park where there are community-run toilets. From here walk up to the road, turn left to pass between the petrol pump and a coffee shop, and then turn right up the hill out of Applecross (along the Bealach road). After a short distance branch off along the clear path to the right and head steeply uphill through trees. Once past the houses the path emerges onto the drive to the farm and campsite."
      },
      {
        "stage": 2,
        "description": "Turn right along the track, then fork slightly left at a track junction past the old farm buildings - ignoring the campsite off to the right. Go through a gate - with a footpath sign for Càrnach and Torgarve. Immediately through the gate and before the barns a short detour to the right leads up to Applecross broch overlooking the campsite - this archaeological site has been excavated in recent years."
      },
      {
        "stage": 3,
        "description": "Return to the track and continue to the right. The two beautiful barn buildings on the right have been restored, and the nearer contains intepretation. Known as Hebridean ventilated barns - a type found only in Wester Ross - they date from the 18th century and were used for drying crops, winnowing and making sileage. There's a signed path between the two barns  - a short detour to visit a reconstructed ancient thatched round house. After visting this, return to the track once again and follow it to the right through another gate. It leads through some lovely old woodland of hazel and a fine pines before passing through another gate."
      },
      {
        "stage": 4,
        "description": "This area is being regenerated as community woodland. Our route ignores the archaeological trail turning off to the right (it visits some ruined houses on a loop if you wish to take it). The main route passes a wooden cabin, and then the archaeological trail joins back in from the left and leaves on the right. Keep ahead on the main path; the route now continues downhill towards a cottage, Torgarve House. There are great views to Skye and Raasay. Go through the gate and pass in front of the cottage and continue on the clear path across the croftland towards Loch a' Mhuillin."
      },
      {
        "stage": 5,
        "description": "Here in winter you may see whooper swans and otters are occasionally spotted here all year round. The path emerges onto a track just before the loch, turn right here to pass in front of Lochend Cottage and through another gate, continuing by the loch heading back towards the village. At the end of the Loch go through the gate onto the main road at the start of the houses making up Milltown."
      },
      {
        "stage": 6,
        "description": "Turn left then immediately right to follow the small loop road through the houses and past the fishing sheds and slipway - it's worth detouring onto this for a lovely view to Applecross village. Re-emerge onto the main road and turn left, then look for a sign indicating a footpath up through the woods on the right. Take this turn up to the right and climb steeply for a short section until the path levels off."
      },
      {
        "stage": 7,
        "description": "Go through a gate and then follow the path to the left, keeping right of a house to emerge through a gap immediately left of some agricultural buildings. From here go through a gate into the campsite, and follow the campsite track as it curves right. Continue round to the right on the track, passing the reception building until it rejoins the outward route. Turn left here to head down the campsite entrance track back to the road, retracing your steps back to the car park at the start. The famous Applecross Inn is a short distance further along the road."
      }
    ],
    "scraped_at": 1756310863.3928964
  },
  {
    "title": "Applecross House and Walled Garden circuit",
    "summary": "This straightforward walk combines woodland, riverside, and seafront as it passes through the grounds of Applecross House. The walk begins and ends at the beautiful Walled Garden which has a cafe / restaurant. Many variations are possible as there is a wide range of signed paths across the estate.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Applecrosshouse.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.1,
    "estimated_hours": 1.5,
    "ascent_m": 60,
    "start_grid_ref": "NG719455",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the car park at the Applecross Walled Garden - which is signed from the public road. The garden itself is a beautiful place to visit - and at the far end is an excellent cafe and restaurant. Begin the walk from the walled garden entrance adjacent to the car park, go through the wooden gate and turn right to head alongside the outer wall of the garden - signed for the Tree House. The path curves left round the far end of the garden. Pass to the left of the greenhouse and then fork right, passing the potting shed."
      },
      {
        "stage": 2,
        "description": "The path now crosses a wooden bridge to reach the Tree House on the far side; turn left once across the bridge. Soon the path leads through a gate. Bear right after the gate, ignoring a footbridge to the left, and continue uphill to reach a broad track through a gap in a drystone wall. Turn right along the track, keeping right when the main track continues ahead. The track narrows and continues ahead with deciduous woodland on the left. Continue until a footpath sign indicates the Roe's Walk path heading left into the trees - take this turning."
      },
      {
        "stage": 3,
        "description": "Soon the trees thin and the path runs through an area of regenerating woodland and gorse - a tower off to the left gives an elevated viewpoint. Continue through a wooden gate and then follow the path as it descends to the river. At the river turn sharp left to follow the path that leads downstream. Pass through a gate and continue downstream."
      },
      {
        "stage": 4,
        "description": "Eventually the track curves left away from the river - leave it to follow the narrower path that keeps beside the water. This leads to a tarred track which crosses on a bridge - ignore the track (and bridge) and stay on the signed River Walk that continues opposite. This passes through some fine mature woodland along a very attractive stretch of riverbank."
      },
      {
        "stage": 5,
        "description": "Eventually some steps lead up to the coastal road beside a bridge. Turn left to walk carefully along the road, giving fine views across the bay and to Applecross village. Continue along the road for around 650m until the signed turning for the Walled Garden on the left - turn left up this."
      },
      {
        "stage": 6,
        "description": "Ignore the Beechwood Trail off to the right (that links with Applecross village) and follow the tarred lane until a track leaves on the right. Turn right onto the track, but ignore the 'Lost Path' up to the right. Further on take a signed path on the left ('Arboretum Walk and Walled Garden'). The path heads through woodland and a couple of gates to eventually reach a signed crossroads of paths. Turn left here to return to the Walled Garden car park. There are views towards the private Applecross House from the entrance."
      }
    ],
    "scraped_at": 1756310865.9805245
  },
  {
    "title": "Flowerdale Glen, Gairloch",
    "summary": "A delightful waymarked walk up a sheltered glen to an attractive waterfall. The Flowerdale Glen was given its English name by the MacKenzies of Gairloch (the owners of the estate) after its impressive displays of wild flowers.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Flowerdale.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.75,
    "estimated_hours": 2.0,
    "ascent_m": 156,
    "start_grid_ref": "NG811753",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Turn off the main road in Gairloch into a car park opposite the turning for the harbour. The fine Old Inn is situated just across the old bridge over the river here.  Don't cross the bridge, instead taking the path that runs to the right of and parallel to a track, heading up the glen. The path passes a pond with many varied trees and rhododendrons. Ignore the signed route off to the left ('Arboretum Circular') instead keeping straight on, signed 'Waterfall Walk'."
      },
      {
        "stage": 2,
        "description": "You'll soon glimpse Flowerdale House over to the left, seat of the Mackenzies since 1738; the house remains a private residence so please respect the privacy screens. Keep on the path as it curves right, then turn left at the next junction (again signed 'Waterfall Walk'). The path crosses a bridge and boardwalk, and then another bridge. Beyond this follow the main path upriver - with lovely bluebells in summer - to reach a track at a 'T' junction. You'll return to this point later; turn left now, cross a bridge over the main river and then turn right, still signed for the waterfall. The path passes a hydroelectric station and then meets a main track - bear right along this."
      },
      {
        "stage": 3,
        "description": "Keep straight on at the utility area (ignore the track over the bridge to the righ - you'll come back across this later). Later bear right off the track onto a signed path. You'll now see glimpses the Flowerdale Waterfalls ahead, actually two falls known as the Eas Dubh and the Easan Bana. Cross a bridge to approach the falls. Although not particularly high or big by Highland standards, and hard to see with the trees, it's an attractive spot. There are two options for the ascent near the falls - a newer broad path/track on the left, or the narrower but rougher original path that keeps closer to the falls. Above the falls the routes rejoin; the glen is barer and the path soon reaches another bridge. Cross this and follow the well made path back down the far side of the stream."
      },
      {
        "stage": 4,
        "description": "There's a really beautiful view back down the Flowerdale Glen to the sea and islands beyond. The route crosses a bridge and then reaches a track at a 'T' junction - note the memorial on the left to the Blind Piper of Gairloch. Turn right to follow the track to a bridge, crossing and then rejoining the outward route at the wide turning area. Turn left here to retrace your steps back towards the start."
      },
      {
        "stage": 5,
        "description": "Keep retracing steps - forking left off the track onto the path past the hydro, and left over the bridge. At the next junction the outward route came in on the path on the right - ignore this and instead keep ahead, signed for Cherry Tree Hill."
      },
      {
        "stage": 6,
        "description": "Soon another junction is reached; keep right here, now following apath which was until the nineteenth century the main road to Gairloch from the south. Further on, keep left on the main path at a fork. It soon leads to some old commercial buildings; continue to reach the back of the Old Inn. Pass round the front of the Inn (if not going in for a drink!) and cross the old bridge back to the car park."
      }
    ],
    "scraped_at": 1756310868.571451
  },
  {
    "title": "Lochcarron Coffin Road circuit",
    "summary": "This circuit follows the line of the old coffin and drove road from Kirkton, before descending to Lochcarron and returning along the shore road.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/lochcarron-coffin-road.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 5.0,
    "estimated_hours": 1.5,
    "ascent_m": 116,
    "start_grid_ref": "NG914412",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the public car park at the Golf Club at Kirkton at the eastern extremity of Lochcarron - there is a cafe here. The route starts on the opposite side of the road up a track - signed for Kishorn Road via Kirkton Wood. It follows the route of an old coffin road (linking Kishorn to Kirkton burial ground) and a drove road for bringing cattle over from Applecross to a local market held here."
      },
      {
        "stage": 2,
        "description": "When the track reaches a gate and cottage, do not pass through - instead following the marker indicating the route diverting to the right uphill, then left, passing above the cottage before descending left again to a footbridge. Cross and go through the gate opposite. The route now follows a rough path, soon bearing right to head along a low bank through the scattered birch trees. The route is marked with scallop shell markers. Ignore a path off left (a detour to the remains of the cleared settlement of Kirkton), instead continuing along the ATV track through the trees and gorse. Good views begin to open up over Loch Carron."
      },
      {
        "stage": 3,
        "description": "The route curves left at a stand of old pines, and then continues by a long line of birches. Eventually a gate is reached leading onto the open moorland."
      },
      {
        "stage": 4,
        "description": "Continue across the moor until a clearer path is reached at a t-junction. The old drove and coffin route to Kishorn turns right here, but our circular walk turns left to begin heading back towards Lochcarron. When the path forks, take the right branch, towards a stand of conifers."
      },
      {
        "stage": 5,
        "description": "After passing the trees the route continues as a grassy track, with views over Loch Carron ahead. Further down, the route passes through two gates and continues to reach Croft Road. Take the footpath almost opposite which cuts right down to the main road in Lochcarron."
      },
      {
        "stage": 6,
        "description": "The village shop is just to the right, but our route turns left along Lochcarron's seafront. When the lochside pavement ends there's a pavement on the opposite side, but eventually you need to continue along the grass verge to return to Kirkton and the start, passing the original Kirkton burial ground."
      }
    ],
    "scraped_at": 1756310871.153177
  },
  {
    "title": "Torridon village walk, Torridon",
    "summary": "This route combines two walks from the edge of Torridon village. The first heads past a deer farm to reach a hide and a beautiful stretch close by the shore of Loch Torridon, visiting the site of an open air church. It then joins the road at Fasag (shop/cafe) from where the second walk takes a path keeping above the road and loch to visit the site of a ruined township. The return is back along the minor road through the village.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/torridon-village.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 6.1,
    "estimated_hours": 2.0,
    "ascent_m": 32,
    "start_grid_ref": "NG905557",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Begin from the National Trust for Scotland's Torridon Countryside centre, which is on the left immediately after turning in towards Torridon village from the A896 road. The centre gives information about the Torridon Estate, regarded by many as amongst the most beautiful parts of the Highlands. Begin the walk by heading along the tarred track from the centre, ignoring another track which forks off left."
      },
      {
        "stage": 2,
        "description": "The track passes through a gate and, after 500m, reaches a fine whitewashed house. Part of this houses the Deer Museum, where you can learn about Scotland's red deer. The paddock on the left is part of a deer farm and you can usually see both stags and hinds at close quarters through the fence."
      },
      {
        "stage": 3,
        "description": "At the far corner of the paddock there is a detour path turning left along the line of the fence to reach a wildlife hide. This overlooks a marshy area at the head of the loch and is a good spot to watch for oystercatches, ringed plovers, sandpipers and other birds. After visiting the hide retrace your steps to the paddock corner."
      },
      {
        "stage": 4,
        "description": "Turn left to rejoin the original track, continuing to the left of the white buidling and house. From the parking area bear right to pick up a path between two fences. This now runs between the paddocks below Torridon village on the right, and the loch shore on the left. Eventually it passes through a gate and then continues as a grassy path just above the shore. This is a beautiful spot."
      },
      {
        "stage": 5,
        "description": "The path continues by the shore, eventually crossing a footbridge and passing through a gate. A little further on a signpost indicates the detour to Am Ploc to visit the open air church. Turn left as indicated, then left again at a track, then left once more onto a path, passing a ruin. The path leads to the Am Ploc open air church, with stone seats and a rock pulpit. The church was used after the Free Church broke from the main Church of Scotland during the Great Disruption of 1843, giving the church control over the selection of ministers. With no buildings, the Free Church initially operated from sites such as this. Occasional services were still held here as recently as the 1980s."
      },
      {
        "stage": 6,
        "description": "Retrace your steps back to the track, then turn right to follow it to reach the main road at Fasag (the shop almost opposite also has a cafe). From here you could turn right to walk back along the road through the village to the start. To include instead the rougher path that visits the old township, turn left along the road instead. Continue until the jetty, and then almost opposite it take a signed path off to the right, beginning by the national speed limit sign - once on the path it is very clear to follow. It runs parallel to but at a higher level than the road. Look out for the tumbledown ruins of the old houses some distance along."
      },
      {
        "stage": 7,
        "description": "Eventually the path becomes a little rougher and heads into birchwoods. At a junction (with only a minor path ahead) turn left to descend some rough stone steps, soon heading down to the road. Turn left at this point to head all the way back - through Torridon village - to return to the start. The road is usually quiet but still take care with traffic. It passes the cafe, school, village hall and youth hostel before eventually reaching the NTS Countryside Centre."
      }
    ],
    "scraped_at": 1756310873.7421699
  },
  {
    "title": "Coral Beaches, near Culduie",
    "summary": "Driving south from Applecross to Toscaig, there is parking at the junction with the minor road which turns to the right for Àrd-Dhubh. Walk along the Àrd-Dhubh road for a short distance until a footpath sign on the left. Follow the wide, well made footpath across the moor. It passes through some attractive birchwoods as it rounds a stream.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Coralbeach.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 6.3,
    "estimated_hours": 2.0,
    "ascent_m": 210,
    "start_grid_ref": "NG713398",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Driving south from Applecross to Toscaig, there is parking at the junction with the minor road which turns to the right for Àrd-Dhubh. Walk along the Àrd-Dhubh road for a short distance until a footpath sign on the left. Follow the wide, well made footpath across the moor. It passes through some attractive birchwoods as it rounds a stream."
      },
      {
        "stage": 2,
        "description": "Beyond, the path reaches a signposted junction; each branch leads to a different coral beach. Take the right hand branch first, signed for 'Àrd Ban'. This path soon reaches a picturesque section where it is built up alongside the Poll Domhain bay."
      },
      {
        "stage": 3,
        "description": "Further on it bends left to reach Àrd Ban, a collection of three old cottages by a coral beach. The white 'coral' sand is not true coral; it is in fact maerl or calcified seaweed; nonetheless it is fascinating to examine, and this is a beautiful spot."
      },
      {
        "stage": 4,
        "description": "Return to the signpost. Reaching the other beach is a little muddy, so you could just return from here; otherwise, turn right."
      },
      {
        "stage": 5,
        "description": "The path passes through another birchwood and approaches some isolated houses. A couple of shortcut paths head off right but it's best to continue until almost at the houses before turning right at a sign ('Coral beach') to follow a faint boggy path to the beach, which is covered at high tide but when the tide is out is even more attractive than Àrd Ban. Back on the path, you can also explore the bay around some abandoned and some renovated cottages, before returning back to the start."
      }
    ],
    "scraped_at": 1756310876.3332055
  },
  {
    "title": "Sand River circuit, Big Sand",
    "summary": "The seemingly bleak moorlands north of the Sand River, like many in the Highlands, harbour the remains of centuries of human activities. This constructed circular trail heads through these empty moors.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/sand-river.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 6.5,
    "estimated_hours": 1.5,
    "ascent_m": 125,
    "start_grid_ref": "NG761790",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "This newly constructed walk replaces the earlier archaeological trail which started further north. Park on the grass verge at the start of the track on the right marked \"Sand Farm Hill Access\"; take care not to cause an obstruction. The walk begins by heading through the gate and following the track to a levelled area. Here turn left onto a clearly constructed footpath."
      },
      {
        "stage": 2,
        "description": "The path cuts across the moorland, soon coming parallel to but remaining above the Sand River. Eventually it descends and crosses the river via a bridge. The ruin visable over to the left was the schoolmaster's barn, dating from around 1876; the schoolmaster lived in a cottage on the other side of the road."
      },
      {
        "stage": 3,
        "description": "The route now climbs a little before contouring the slope to the north of the Sand River. The scattered stone ruins seen include old dykes and, more clearly, hut circles and a field system on this side of the river."
      },
      {
        "stage": 4,
        "description": "The trail leads across another bridge over one of the tributaries, and passes through a gate. The area is grazed by both cattle and sheep, so ensure to keep any dogs under very tight control. After another bridge the route passes over the almost imperceptable hillock of Druim Liath, and then meets a wider track."
      },
      {
        "stage": 5,
        "description": "Turn right along this track for the return walk back to the start. One the final descent are views over Longa Island to the distant Trotternish Ridge on the Isle of Skye. The track eventually leads back to the road at the start point."
      }
    ],
    "scraped_at": 1756310878.9301872
  },
  {
    "title": "Sand to Applecross Bay",
    "summary": "An easy linear walk between the beautiful sandy bays at Sand to the more pebbly Applecross Bay with great views over to Raasay, Skye and Rona. The walk can be done in either direction or as a return walk - the time and distance given are for one way.",
    "source_url": "https://www.walkhighlands.co.uk/torridon/Sandapplecross.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 7.0,
    "estimated_hours": 2.0,
    "ascent_m": 183,
    "start_grid_ref": "NG684493",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the car park at Sand on the road that leads to the Ministry of Defence submarine testing station. From the car park it is well worth visiting Sand Beach before starting the walk proper. To do so follow the track until a path heading off to the left, and follow this down to the beach. At the far right edge of the bay is a stone building that was used by Monty Halls in his beachcomber series on TV."
      },
      {
        "stage": 2,
        "description": "Walk back to the main road and cross the road to take a clear path opposite signed for Cruarg. The path leads south uphill on a gentle gradient. There are fine views out over the beach and the Inner Sound to the islands of Raasay and Skye beyond."
      },
      {
        "stage": 3,
        "description": "Continue along the wide path, crossing a small stream on a wooden footbridge, and then becoming less steep as the path contours around the hillside. The road below is lost from sight and you can imagine this part of Applecross before the road was built in the 1960s when this path and the sea would have been the only communication routes."
      },
      {
        "stage": 4,
        "description": "The path crosses a pretty stone and wood bridge and levels off before rounding the bend to approach Applecross Bay. There are remains of hut circles and sheilings on this part of the hillside but little is visible today from the path. The route passes through the remains of a metal kissing gate, the surrounding fence long gone. On a clear day the Cuillin mountains on Skye are visible and the dramatic conical peak of Glamaig to the right of them."
      },
      {
        "stage": 5,
        "description": "Soon the houses of Applecross come into view on the opposite side of the bay. Continue on the path as it narrows and begins the descent to the road. This is the steepest section of the walk but is still well graded. When a signpost is reached a path downhill to the right shortcuts the walk down to a car park at Cruarg. Otherwise continue on the upgraded path ahead."
      },
      {
        "stage": 6,
        "description": "The path comes close to the road before diverging again. Eventually another path junction is reached - turn right here to follow the path down to the Applecross Heritage Centre, which is well worth a visit. To reach the car park at the end of the walk turn right along the nearside of the Heritage Centre."
      }
    ],
    "scraped_at": 1756310881.5581129
  },
  {
    "title": "Gynack Mill Trail, Kingussie",
    "summary": "This short, easy walk follows the Gynack Burn to explore the history of Kingussie. It can be linked to the Creag Bheag and Tom Baraidh route to make a much longer walk.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/gynack-mill.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.3,
    "estimated_hours": 1.0,
    "ascent_m": 50,
    "start_grid_ref": "NH755007",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a large free car park just behind the Duke of Gordon Hotel in the centre of Kingussie, off Gynack Road, where there are also toilets and information about the local path network. From here return to the road and turn left to head uphill following the sign for the Gynack Mill Trail. Soon another green sign is reached, follow the steps down to the right to reach the Gynack Burn. This burn was at the heart of the Fourth Duke of Gordon's plans to build a new town at Kingussie. The water did power a number of mills producing flax, flour and wool, however Kingussie did not develop into the industrial powerhouse the Duke had envisaged, becoming instead, a popular tourist town once the railway arrived in 1863."
      },
      {
        "stage": 2,
        "description": "Across the burn you can see one of the mills, now converted to housing. Continue to cross the footbridge. There is an interpretation board with more information about the history of Kingussie. Pass this, keeping on the main path ahead. Pass a viewing platform on the left where the remains of one of several dams built to control the water flow can be seen. The writer, Robert Louis Stevenson, author of Treasure Island and many more popular books, spent his holidays in Kingussie in the 1880's and he loved to sail paper boats on the burn. Keep on the path and head uphill through the trees."
      },
      {
        "stage": 3,
        "description": "When the path forks, keep on the main path heading straight ahead.  At a T junction turn left and follow the path upstream, a little way from the burn now. The path soon bends to the right between wire fences, with newly built houses on the left. When the road is reached turn left. After the last house on the left turn left at a green signpost, passing a stone cairn and heading down steps to the river."
      },
      {
        "stage": 4,
        "description": "Cross the bridge and bear left on the other side, passing an information board and then turning left onto the road to head downhill. The road passes the St Vincent Hospital on the right and soon reaches the green signed path heading down to the river on the left. Take this path for the second time and cross the bridge. Here keep straight ahead following a smaller path alongside the fence to go up a flight of steps. At the top turn right through the gate onto a track, Boa Vista Road, to pass a number of lovely houses overlooking Kingussie. When a road junction is reached turn right to head downhill towards the town. Further down there are good views over the cemetery to Creag Bheag."
      },
      {
        "stage": 5,
        "description": "When you see a clock tower on the left, head towards it for a few paces then visit the information board on the right showing an old map of the town from the viewpoint. Return to the main road and continue down to reach the High Street. Go straight across at the traffic lights and follow King Street until the T junction where you turn right along Spey Street. Here the old Post Office building can be seen on the left."
      },
      {
        "stage": 6,
        "description": "Cross the bridge over the Gynack Burn and then turn right into the park. Walk through the formal gardens, passing the war memorial, with the imposing Duke of Gordon Hotel ahead. Once out of the park cross the road and head up Gynack Road to return to the car park at the start of the walk."
      }
    ],
    "scraped_at": 1756310884.151846
  },
  {
    "title": "Riverside Walk, Kincraig",
    "summary": "A beautiful out-and-back walk along a high bank above the River Spey with good views of the Cairngorms and passing through lovely woodland.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/kincraig.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.7,
    "estimated_hours": 1.0,
    "ascent_m": 20,
    "start_grid_ref": "NH833056",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a small parking area just down from The Old Post Office Cafe in the centre of Kincraig, next to the phone box. From here head back up the road past the stores and turn right along Speybank Walk. After passing some fine houses the route becomes a track up through the woods. When the track bends left keep straight ahead onto a narrow path through the trees, signed Speybank Walk."
      },
      {
        "stage": 2,
        "description": "The route runs parallel to a winding new surfaced section of the Speyside Way path which is set back further from the high bank above the river; the two routes meet at several points. Keep straight on when a path joins from the right, and keep right when a fainter path forks off to the left. The Speyside Way path is joined for a section of boardwalk; beyond this leave it again by climbing up a steep bank to reach the top of the ridge overlooking the river."
      },
      {
        "stage": 3,
        "description": "The Spey is wide here and there are good views down to it at times as well as across the strath to the Cairngorm mountains. Continue along the path, passing a bench (link path to the Speyside Way goes off left here) and a gate, and a mixture of birch and oak trees with a thick carpet of heather and blaeberries underneath. The riverbank can be very steep in places so care is needed with young children."
      },
      {
        "stage": 4,
        "description": "After a short section of fencing, an old marker stone with a cross carved on it is passed. Keep following the path until eventually a small clearing with a wooden bench is reached. This is a good viewpoint and a lovely spot for a break."
      },
      {
        "stage": 5,
        "description": "Beyond the bench the path rejoins the Speyside Way. Either turn round to begin the walk back by the same outward path, or instead turn left to follow the Speyside Way back. Once back at Kincraig it is worth exploring the long bridge over the River Spey at the north end of Loch Insh. The bridge was built in 1874 before which a ferry boat ran across the same stretch of water, which lead to the original name of the village which was Boat of Insh."
      }
    ],
    "scraped_at": 1756310886.739751
  },
  {
    "title": "Nethy Bridge riverside and Dell woods",
    "summary": "This is a walk of two halves, the first alongside the burbling River Nethy and then through beautiful Dell Woods (a National Nature Reserve) to return to Nethy Bridge. An easy short walk on good, waymarked paths, with plenty of variety and the option to extend the walk.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/nethybridge.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 30,
    "start_grid_ref": "NJ001205",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start at Nethy Bridge Community Centre (just up from the shop) where there is parking and toilets. Start the walk by taking the riverside path opposite the community centre. The path drops down to the river and follows it upstream. In the past, timber has, and still does to some extent, play a major part in the local economy. This river was used to transport felled trees to the River Spey and on to the sea at Spey Bay. Dams and sluices further up allowed water to build up which when released would float hundreds of tree trunks downstream.  After a short while the all-abilities path turns right but our route continues straight ahead following the river bank."
      },
      {
        "stage": 2,
        "description": "Near a house the path joins a minor road. Turn left and continue until the pretty, green bridge is reached. Don't cross the bridge but continue along the road. Follow the road as it turns sharp right and passes between houses. At the junction cross the road and follow the path straight ahead through the two sets of beech hedging."
      },
      {
        "stage": 3,
        "description": "The two large Wellingtonia (giant redwoods) trees and the beech hedges mark the entrance to what used to be the tree nursery established in 1855 to raise pine seedlings for replanting the forest. Today natural regeneration techniques are favoured and the nursery closed in 1984. Continue straight ahead at a small crossroads of paths and keep ahead at the end of the hedges following the blue and green arrows. Turn right at the next junction through a lovely area of mixed pine wood."
      },
      {
        "stage": 4,
        "description": "As the path nears the corner of a large white house turn left following the arrowed signs and continue through the pine forest. Eventually the path runs near the back of a number of houses. Ignore the path right towards the houses here instead bear left further into the wood. After winding through the trees, a field is seen on the right and a path junction with a picnic table reached. Our route continues onto the wider track ahead but you can extend the walk by a couple of miles by following the loop of the green waymarked 'Puggy line trail' which follows the line of an old railway on the left. Otherwise continue ahead until the track emerges from the wood onto a road. Turn right and follow the road, keeping straight on past houses back to the centre of Nethy Bridge. At the road junction turn left to return to the community centre."
      }
    ],
    "scraped_at": 1756310889.3219929
  },
  {
    "title": "River Spey & old railway, by Grantown-on-Spey",
    "summary": "This short walk follows the Speyside Way along the old railway line near Grantown on Spey before returning on a rougher path right beside the Spey. Views of woodland, farmland, distant hills and the beautiful River Spey.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/river-spey-grantown.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 45.0,
    "ascent_m": 23,
    "start_grid_ref": "NJ035262",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the informal parking layby opposite the old smokehouse building on the right just after the turn off for Nethy Bridge (B970) from the A95 south of Grantown on Spey; do not obstruct access for farm vehicles to the field. If full you can usually find more parking on nearby Achnagonalin industrial estate (home to an excellent cafe/bakery and pizzeria). If walking from Grantown either take A939 (or the old military road through the woods) and cross the Spey Bridge and take the 2nd right off the A95. Start by crossing the B970 and taking the Speyside Way path on the left hand side of the entrance to the industrial building ahead. This heads round the back of the building, through a gate and up a ramp onto the old railway line."
      },
      {
        "stage": 2,
        "description": "The Speyside Line railway ran closed in 1968 and became part of the Speyside Way long distance walk in 1981. The route now runs from Buckie on the Moray coast to Newtownmore mainly following the River Spey. Follow the path under a bridge and through a set of double gates and continue ahead passing through sparse birch trees."
      },
      {
        "stage": 3,
        "description": "Continue on the Speyside Way until just after a farm gate with pedestrian gate alongside and look out for a small stile on the right. Climb this and head straight down through the grass to the trees and river ahead. Bear right near the river to cross a stile and pick up the riverside path soon passing a small fishing hut. Continue ahead on the riverside path."
      },
      {
        "stage": 4,
        "description": "This section of the river is particularly popular for fly fishing, soon the path passes a large wooden seat and grill made from old horseshoes used by the fishermen. Watch out for salmon and trout leaping in the river as the path continues downstream. On the far side of the river the old cemetery at Inverallan can be seen. Pass another small fishing hut."
      },
      {
        "stage": 5,
        "description": "Continue through a wooden kissing gate as Spey Bridge comes into view. Dating from 1931 this bridge replaced a much older bridge built by General Wade in 1754 which can still be crossed on foot further downstream. Pass a third fishing hut. Don't go under the bridge but climb the tall flight of steps on the right to reach the road. Turn right at the top and follow the pavement, crossing the road entrance to Achnagonalin industrial estate and taking the next right to return to the start."
      }
    ],
    "scraped_at": 1756310891.9204524
  },
  {
    "title": "Linn of Dee circuit, Linn of Dee, near Braemar",
    "summary": "This short waymarked walk begins with a visit to the beautiful Linn of Dee, where the river cascades through a narrow chasm, topped by an old stone bridge. It then heads up the lower reaches of Glen Luibeg, passing more waterfalls and through beautiful old pinewoods.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/linn-of-dee.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 42,
    "start_grid_ref": "NO062898",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the large National Trust car park at the Linn of Dee; there is a charge. Return to the road and take the footpath - waymarked in blue and yellow - off the opposite side. This soon descends gently down steps towards the River Dee. Our blue route turns left at this path junction, but first turn right with the yellow markers to take a closer look at the Linn of Dee. Here the river thunders through a rocky chasm, spanned by the old stone road bridge."
      },
      {
        "stage": 2,
        "description": "It's worth heading up to the road bridge and crossing the road to a path on the far side to view the river just above the falls. After viewing, return to the path junction and now take the blue waymarked path that continues downriver."
      },
      {
        "stage": 3,
        "description": "The path continues downstream by the river, through the stately pinewoods. After around 350m follow the main path as it bears left and ascends a series of steps to climb up to the road. Go straight across this onto the path on the far side, which then bears right parallel to the road."
      },
      {
        "stage": 4,
        "description": "The path emerges on a track beside the River Luibeg. Turn left up the track; after 250m a blue marker indicates where to fork right onto a path that keeps the river in close view. The natural pinewoods here are simply stunning, and regenerating strongly since the National Trust for Scotland has tried to bring deer numbers down towards natural levels. The River Luibeg has some attractive cascades, and the remains of an old salmon ladder are visible at one point."
      },
      {
        "stage": 5,
        "description": "Eventually the path swings left, and there are distant views up the glen towards the cone-shaped summit of Derry Cairngorm. When the path meets a large track, turn left along it. After another 450m a signpost indicates where to turn right onto a path through the woods back to the car park. This crosses a boardwalk in an open area and climbs a few steps before reaching a fork. The left option is the shortest route back to the start."
      }
    ],
    "scraped_at": 1756310894.5085578
  },
  {
    "title": "Loch Vaa, near Aviemore",
    "summary": "Hidden away in the pinewoods just off the A95 between Aviemore and Boat of Garten, Loch Vaa is a secluded gem. This short walk makes a straightforward circuit around the loch.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/loch-vaa.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.0,
    "ascent_m": 28,
    "start_grid_ref": "NH910174",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from next to Laggantrygown Cemetery, which is just off the main A95 between Aviemore and Boat of Garten. The parking for Loch Vaa is on the left with the locked cemetery car park to the right - there is further parking in a layby towards Aviemore. Begin the walk on the clear path outside the left edge of the cemetery. This soon swings left and climbs up a wooded ridge; known as an esker, this was formed by glacial action. The path then forks; keep ahead on the main path which curves left downhill to the shores of Loch Vaa."
      },
      {
        "stage": 2,
        "description": "The loch is a beautiful and secluded place set amidst stunning pine and birchwoods, although it is only a stones throw from the busy road. Continue along the shores (depending on the water levels) to the left towards the very attractive boathouse."
      },
      {
        "stage": 3,
        "description": "Head into the woods to the left of the boathouse. Further on a track leads through the forest. Stay on the main track, ignoring a path off to the right. Eventually a (locked) gate is reached; pass to the right of this, turning right along the track beyond."
      },
      {
        "stage": 4,
        "description": "Keep along this track. Ignore a path off right, then a fainter track after 500m. After 1km from the gate, look out for another track off right that has two branch points, the second with a small boulder amidst smaller rocks at the turning. Follow this track, which leads back towards Loch Vaa."
      },
      {
        "stage": 5,
        "description": "It eventually becomes a path (with a view through the trees to the loch down to the right) - ignore the path heading steeply down to the loch, instead continuing ahead to cross a stile over a fence. Beyond this the path climbs a low wooded hill with good views over the loch."
      },
      {
        "stage": 6,
        "description": "When the narrow path forks again take the right branch which descends steeply. The path then undulates, with a final steeper climb where a fence comes alongside on your right (and the loch beyond). Continue along the fence path until a stile. Cross this and follow a path along the top of a esker until it reaches the outward route near the start. Turn left here to head back to the cemetery and car park."
      }
    ],
    "scraped_at": 1756310897.0974462
  }
]