[
  {
    "title": "The Fairy Glen, near Uig",
    "summary": "A bizarre and delightful miniature landscape of grassy, cone-shaped hills, the Fairy Glen (sometimes spelt Faerie Glen) is a fascinating and otherworldly place to visit.",
    "source_url": "https://www.walkhighlands.co.uk/skye/fairyglen.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.5,
    "estimated_hours": 1.0,
    "ascent_m": 45,
    "start_grid_ref": "NG411632",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Take the side road which leaves the A87 near the Uig Hotel - signed for Sheader and Balnaknock. After a few houses the Fairy Glen comes into view ahead as you descend. There is a pay-and-display car park on the left.  Take the obvious path from the car park that slopes uphill from a parking meter. It soon reveals a striking view of a unique landscape; the Fairy Glen was formed by the land being disrupted by a series of landslides (on a smaller scale than the huge landslips that formed the Storr and the Quiraing), with the results then smoothed by subsequent glaciation."
      },
      {
        "stage": 2,
        "description": "Stay on the good path that descends and passes between some of the striking grassy conical hills. The path leads past a small lochan and then emerges on the road. Go straight across and follow the path as it bends left, running parallel to the road briefly, and then diverging around the opposite side of a lochan. Soon the sharp park of Castle Ewen is seen - the path climbs to the right of this."
      },
      {
        "stage": 3,
        "description": "The path emerges at a grassy hollow next to Castle Ewen. From here you can make a detour to the summit of this rocky tower if you wish - a steep path leads up onto the ridge. Head left along the narrow ridge and then up a final scramble up a rocky step in a gap in the summit tower - great care is needed."
      },
      {
        "stage": 4,
        "description": "The summit is surprisingly spacious, with enough flat grass for a picnic."
      },
      {
        "stage": 5,
        "description": "Retrace your steps to return to the grassy hollow below the ridge. A great deal of work has taken place here to clear away the stone stacks made by visitors which were causing damage to the grazing land - please leave any stones as you find them. Now take the path that heads through the gap to the right of the Castle Ewen ridge. This soon descends to meet the minor road."
      },
      {
        "stage": 6,
        "description": "Once back at the road, turn left to head back to the start along it. Castle Ewen looks impressive across a small loch."
      }
    ],
    "scraped_at": 1756310176.3094475
  },
  {
    "title": "Coille Iòsal, Braes",
    "summary": "This short walk is set in the heart of the lovely Braes area south of Portree. It climbs up through native woodland to visit a waterfall before a more open return giving great views across the Sound to Raasay and Ben Tianavaig.",
    "source_url": "https://www.walkhighlands.co.uk/skye/braes.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 111,
    "start_grid_ref": "NG515366",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "There is a parking area at Braes village hall, by the recycling bins. The Braes was the site of the famous Battle of the Braes where local crofters fought Glasgow policemen during the Crofters' struggle for security of tenure - there's a memorial to the Battle a kilometre further down the road. Back at the car park, the walk begins opposite the stone buildings. It heads through some lovely native woodland of birch, hazel, rowan and juniper."
      },
      {
        "stage": 2,
        "description": "Follow the white markers as the path heads uphill, passing above a ravine to eventually emerge onto the open moor. The path continues up the moor, crossing a tiny bridge and having some wooden steps in places. There are great views looking back across the Sound."
      },
      {
        "stage": 3,
        "description": "Near the top, it comes alongside a pretty cascading waterfall. Continue above the waterfall to a gate."
      },
      {
        "stage": 4,
        "description": "Go through the gate and immediately turn right (ignoring the second gate ahead). Soon the path becomes a track. There's a bench here with a fabulous view of Raasay and Ben Tianavaig."
      },
      {
        "stage": 5,
        "description": "Continue on the track, which passes beneath a waterworks and a small electricity substation as it descends back down to the Braes road. Turn right along the road to return to the start."
      }
    ],
    "scraped_at": 1756310178.8940446
  },
  {
    "title": "Dùn Scaith Castle, Tokavaig",
    "summary": "This very short walk leads to the dramatic remains of Dùn Scaith Castle. The views are quite simply sensational, well justifying the drive along the switchback road to reach the start.",
    "source_url": "https://www.walkhighlands.co.uk/skye/dunscaith.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 2,
    "distance_km": 2.0,
    "estimated_hours": 40.0,
    "ascent_m": 20,
    "start_grid_ref": "NG600118",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park off the road at Tokavaig Bay, which has the most sensational views of the Cuillin and Bla Bheinn, with Dùn Scaith castle visible as a foreground. Walk along the road towards Ord. Just past the cattle grid a track branches off to the left. Turn sharp left here."
      },
      {
        "stage": 2,
        "description": "Follow the track across the head of the bay passing a prominent rock outcrop on your right. The track leads to a whitewashed crofthouse. Pass to the left of the house; the going from here has only faint paths, but it doesn't matter whether you head directly over the low rise or keep closer to the shoreline; either way you'll approach the castle."
      },
      {
        "stage": 3,
        "description": "The remains of Dùn Scaith castle date back to the 13th century but occupying an older, fortified site. The castle, perched on a rock above Loch Eishort, was a stronghold of the Macleod before it became the principal seat of the MacDonalds of Skye in the 15th century.  Among the many legends associated with Dùn Scaith are those recounted in Macpherson's 'Ossian' concerning the adventures of the Irish folk hero Cu Chulainn, who came here when he first landed in Skye. One tradition tells how he came here to learn the marshal arts of war from the warrior queen 'Sgathaich', whose home this was. The castle is reached over a gully bridged by two walls which flanked a drawbridge, whose pivot holes are still visible on the far side. With the drawbridge missing the dangers of entering the castle can be clearly seen. On the far side of the bridge a door would have opened onto a flight of steps leading up between walls to the castle."
      },
      {
        "stage": 4,
        "description": "Parts of the curtain wall (one of the earliest surviving examples in the district of lime-mortared construction, being random rubble with smaller infill bound with lime) still cling to the cliff edge, but what survives of the internal structures (which probably included a tower) are identifiable only by grassy mounds. In the courtyard is a well, and at the south east angle are remains of a stair within a tower leading to the parapet walkway. To the right of the castle great views of the Cuillins can be seen on a clear day. Immediately across the water are the remains of the cleared villages of Boreraig and Suisnish."
      },
      {
        "stage": 5,
        "description": "Return to the road along the same outward path and track."
      }
    ],
    "scraped_at": 1756310181.4763572
  },
  {
    "title": "Kylerhea Otter Hide trail",
    "summary": "Easy walk with lovely views over the Kyle strait to the mainland. The hide at the midway point gives a good opportunity to spot otters, seals and other wildlife. Picnic tables and toilets near start.",
    "source_url": "https://www.walkhighlands.co.uk/skye/kylerheaotter.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 1,
    "distance_km": 2.25,
    "estimated_hours": 1.0,
    "ascent_m": 43,
    "start_grid_ref": "NG786211",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the Kylerhea Forestry and Land Scotland car park on the left as you come down the hill towards Kylerhea. Just below the parking there's a lovely picnic area overlooking the water and the Skye Ferry from Glenelg."
      },
      {
        "stage": 2,
        "description": "Follow the track north, soon passing the toilets. There are breaks in the mixed woodland with seats offering great views over the water."
      },
      {
        "stage": 3,
        "description": "Turn right at a fork, then right again on the main path whic leads downhill to reach the otter hide. The hide is free (donation box) and open all year.  While otters may prove elusive, there are usually seals to be seen on the rocks to the left of the lighthouse."
      },
      {
        "stage": 4,
        "description": "Retrace your steps the same way back to the car park."
      }
    ],
    "scraped_at": 1756310184.063243
  },
  {
    "title": "Scorrybreac circuit, Portree",
    "summary": "A beautiful circuit on the north side of Portree bay, popular with both visitors and local dog walkers.",
    "source_url": "https://www.walkhighlands.co.uk/skye/scorrybreac.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 2.0,
    "ascent_m": 164,
    "start_grid_ref": "NG488437",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Scorrybreac Road is the first right turn after passing above the harbour on the road towards Staffin (signed Cullin Hills Hotel). There are marked parking bays on the shore just after the turning to the Cuillin Hills hotel. There are picnic tables here, and further along the route. A display board gives a map and details of this walk. The walk begins along the tarmac path close to the wooded shore, giving excellent views of the cottages around Portree Harbour. A prominent tower in the woods above the harbour is an example of an Apothecary's tower, built as a sign to passing seafarers that medical supplies and expertise are available in the village. Photo: Portree harbour from Staffin road"
      },
      {
        "stage": 2,
        "description": "The path soon passes the boathouse which is the home of Portree sailing club before crossing a footbridge and reaching a gate signed 'Urras Clann Mhicneacail'. This is Gaelic for the Nicolson Trust, the headland beyond has been purchased by members of the Clan Nicolson from all around the world, Scorrybreac being considered the homeland of the clan."
      },
      {
        "stage": 3,
        "description": "Through the gate, the path becomes gravelled. To the left of the path is a memorial with a flagpole and grand views across Loch Portree to the distant Cuillin hills. The plaque commemorates the members of Clan Nicolson who contributed to buying this land. A further gravel path and steps can be optionally climbed to reach a higher viewpoint above the cliff."
      },
      {
        "stage": 4,
        "description": "Back on the main path, continue beside the shore. The low lying land blocking the entrance to Portree bay is part of the Isle of Raasay, whilst the hill directly across the bay is Ben Tianavaig. White-tailed eagles nest on the inaccessible cliffs below Ben Tianavaig, so keep a keen eye out. The outcrop of rock just offshore, which can be reached at low tide, is the Black Rock, whilst across Loch Portree you can clearly see the sandy beach at Camas Ban. The loch itself is home to a number of salmon farms. The fish can usually be seen within their enclosures as they jump up from the water. Common seals can also sometimes be seen swimming by the shore."
      },
      {
        "stage": 5,
        "description": "The path reaches a stone seat where a view of the high coastal cliffs to the north are revealed. The going becomes stonier at this point; continue ahead on the path until it reaches a dry stone wall. Here, turn left and follow the path uphill, at first beside the wall; soon it bends left and ascends a steep series of zig-zags."
      },
      {
        "stage": 6,
        "description": "Above the zigzags, the route levels off. There are great views over the salmon farms to Raasay, with Dùn Caan prominent like a little volcano. The route now loses sight of the coastline and crosses more open countryside. Continue on the path, passing through a kissing gate before heading downhill to a further gate. The path now enters an attractive silver birchwood. After another kissing gate, the path descends along the edge of the wood before emerging behind the Cuillin Hills hotel. Continue down the tarmac road back to the start point."
      }
    ],
    "scraped_at": 1756310186.652054
  },
  {
    "title": "Neist Point",
    "summary": "Neist Point - the most westerly headland on Skye - is an iconic destination, with stunning cliff scenery, a fine lighthouse, an outlook to the Outer Hebrides, and the chance to watch for minke whales in the summer months.",
    "source_url": "https://www.walkhighlands.co.uk/skye/neistpoint.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 2.0,
    "ascent_m": 142,
    "start_grid_ref": "NG132478",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the end of the road. There is enough space for a number of cars. The parking can be congested in the summer months, but new spaces created alongside the road are a great help. Begin by following the path through the gate, which if locked can be easily walked round. The only actual private area is that fenced around the lighthouse and cottages - the rest is the common grazings for Waterstein township. Almost immediately turn left on the path, which then swings right to ease the descent to the headland far below. There is a metal handrail for most of the descent."
      },
      {
        "stage": 2,
        "description": "There is an aerial ropeway which is used to take supplies out to the lighthouse and cottages at the Point. Continue along the now level path. Several scenes in Lars Von Trier's film Breaking the Waves were shot here. It is possible to detour to the right to visit the edge of the cliffs, overlooking the great prow of An t-Aigeach  (meaning the Stallion's Head), the dramatic upstanding crag half way out on the headland. The crag is the site of some of Skye's hardest rockclimbs.  To the left are great views to the impressive cliffs of Waterstein Head and the Hoe, the second highest on Skye."
      },
      {
        "stage": 3,
        "description": "At the highest point of the constructed path, a grassy path heads off to the right - this is an optional detour to the top of  An t-Aigeach. If you decide to visit the top take great care near the cliff edge, and retrace your steps back to the main path. As the corner is rounded the lighthouse comes into view for the first time."
      },
      {
        "stage": 4,
        "description": "Continue along the path towards the lighthouse and the former keepers' cottages (once run as accommodation but now closed down). The complex was built in 1909 at a cost of £4,350 - the engineer being David A Stevenson of the famous Stevenson family of lighthouse builders. From the path junction, you can turn left along a made path to reach the crane and crane which was once used to bring in supplies. It is also worth detouring across rougher pathless ground beyond the lighthouse complex to reach the furthest point. Look out for breaching fins and blows in the sea - this is one of the best places for whales and dolphins on Skye."
      },
      {
        "stage": 5,
        "description": "The return route is back the same way. It is worth detouring to the left from the path before it heads round An t-Aigeach to visit the cliff edge; from here you can watch seabirds in season but take care as the edge is, of course, unprotected."
      },
      {
        "stage": 6,
        "description": "For the classic view of the lighthouse beyond the cliffs, you can head on a boggy path northwest from the car park for a short distance (this is the start of the Neist and Milovaig clifftop walk). This must rank as one of the best places imaginable from which to watch the sunset."
      }
    ],
    "scraped_at": 1756310189.236361
  },
  {
    "title": "Dunvegan Two Churches Walk, Dunvegan",
    "summary": "Park in the car park at the Duirinish Church of Scotland in Dunvegan village, on the road towards the castle. The walk starts through gate to the left of the church; there is an information board giving details of the route. At first the route leads through a felled area - which is being replanted with native trees.",
    "source_url": "https://www.walkhighlands.co.uk/skye/twochurches.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 45.0,
    "ascent_m": 88,
    "start_grid_ref": "NG251479",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the car park at the Duirinish Church of Scotland in Dunvegan village, on the road towards the castle. The walk starts through gate to the left of the church; there is an information board giving details of the route. At first the route leads through a felled area - which is being replanted with native trees."
      },
      {
        "stage": 2,
        "description": "Further on the path narrows and reaches more established native woodland. There are many wild flowers here in spring and summer, and glimpses of a view over Loch Dunvegan. After some Eventually an unmarked T junction is reached with a larger path. Turn right, heading uphill. The path climbs up to pass through a gate and reaches the open moor beyond."
      },
      {
        "stage": 3,
        "description": "As the path begins to descend look for a pedestrian gate in the fence on the right  - there's a prominent standing stone on the hill beyond. Pass through the gate and head for the stone. The stone is a commanding viewpoint for Dunvegan village and miles around, but it is not a prehistoric monument. Instead, it was erected on midsummer's day 2000 by the villagers of Dunvegan, using only hand power and ropes. As the stone is fifteen feet high and weighs five tons, this was an impressive feat, and presumably used the same techniques as would have been used to build stone circles thousands of years ago."
      },
      {
        "stage": 4,
        "description": "There are excellent views of Macleods Tables, and the distant Cuillin ridge. Head downhill on a faint grassy path towards the ruined church in view."
      },
      {
        "stage": 5,
        "description": "The path passes just to the right of St Mary's Church, which dates to before the reformation, to reach the road. Turn right on the road (crossing over for the pavement), and right again at the T junction to return to the current church and the start."
      }
    ],
    "scraped_at": 1756310191.8314097
  },
  {
    "title": "Dùn Ringill, Kilmarie",
    "summary": "A short, attractive walk to the remains of a medieval castle, visiting a Chambered Cairn on the way back.",
    "source_url": "https://www.walkhighlands.co.uk/skye/dunringill.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.5,
    "ascent_m": 27,
    "start_grid_ref": "NG554172",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the small car park just beyond the Kilmarie house next to Kilmarie burial ground. Walk back up the road past the house until you reach a metal gate on the right leading to a woodland path. Follow this path and cross the ornate bridge over the Abhainn Cille Mahaire. Kilmarie House was until 1994 owned and lived in by Ian Anderson, the singer and flautist who fronted Jethro Tull, since 1968. He sold the estate at a very reasonable price to the John Muir Trust who now manage the land with conservation as the first priority. The house - and most of the ground on this route - remain privately owned and the current owners request that walkers observe the access code and in particular keep dogs under tight control to protect the wildlife along the route."
      },
      {
        "stage": 2,
        "description": "Immediately after crossing the bridge take the path on the right running parallel to the river. The path heads out to the bay passing a ford with stepping stones. Don't go through the gate but keep to a grassy path alongside the fence. At one point the fence turns left (leading towards a stile) - continue straight on here across a tiny stream to reach another stile further on. Cross this stile and follow the boggy path beyond."
      },
      {
        "stage": 3,
        "description": "A clear, and in places boggy, path follows the coast climbing very gently. In a short distance it joins a clearer path coming in from the left (this route is used for the return). After a small rocky headland, the built remains of Dùn Ringill can be seen on the right near the cliff edge. The path leads over to the Dùn. The entrance is intact and can be passed through to give a good view up and down the coast from the Dùn. Dùn Ringill was the original seat of Clan Mackinnon before they moved to Castle Moil at Kyleakin. It was built on the site of an earlier iron age broch or fort."
      },
      {
        "stage": 4,
        "description": "After exploring the coast and enjoying the views, return back along the path to where you came up from the left earlier. This time continue on the main path; soon it crosses a stream on the edge of the wood. One path goes downhill left from here to return to the outward route; instead, follow the path uphill to the right into the trees. Soon this path passes a bench; a very short distance beyond this turn left along another grassy path. This passes the remains of some stone buildings with a view of the twin summits of Bla Bheinn ahead. Turn left at yet another fork and the path soon becomes a track."
      },
      {
        "stage": 5,
        "description": "Continue along the track. Soon it heads down towards a dip with a rise ahead; look out on the left before the dip for a path heading into the trees (a sign here reads 'No Camping, No Fires). This path leads back down through the woods to the footbridge crossed near the start of the walk. Immediately before reaching the footbridge, look left to see a prominent but overgrown grassy mound. This is the Kilmarie Chambered Cairn, one of the best examples on the island. Near the top of the cairn (on the same side as the stream) is a small square opening or cist; these were used for burial. A beaker found in the cist here is in the National Museum of Scotland. Take great care not to disturb or damage the site before returning over the bridge to the start."
      }
    ],
    "scraped_at": 1756310194.416503
  },
  {
    "title": "Cnoc a'Mhadaidh Ruaidh, Kyleakin",
    "summary": "This short walk follows the Anavig Trail climbs through mixed woodland above the edge of Kyleakin. There are superb views over the Skye Bridge, Kyleakin, the Cuillin and distant Trotternish, more than making up for the massive nearby quarry works that mar the coast below.",
    "source_url": "https://www.walkhighlands.co.uk/skye/cnoc-a-mhadaidh-ruaidh.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 10,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 89,
    "start_grid_ref": "NG743263",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Old Kyle Farm Road is the minor road heading south from the Skye Bridge roundabout on the edge of Kyleakin. There is a layby on the right a short distance along the road before the first house; the walk begins from here, where there is an information board. Follow the gravel path that starts between the two boulders and climbs through into native woodland, soon crossing a small wooden bridge."
      },
      {
        "stage": 2,
        "description": "Soon the views really begin to improve, first towards the flat-topped summit of Dùn Caan on the Isle of Raasay, and then back over the steep hump of the Skye bridge and over Kyleakin."
      },
      {
        "stage": 3,
        "description": "After a climb a fork is reached where a rocky path leads off right; this is used on the return route so ignore it for now. Continue ahead on the main path, ignoring a blue waymarked path which turns off to the left. The path then reaches a clear section near the summit of Cnoc a'Mhadaidh Ruaidh (the hill of the red fox). The views are simply superb. Applecross is visible on the mainland, with the long outline of Raasay to its left, and the distant Storr in Trotternish is visible beyond."
      },
      {
        "stage": 4,
        "description": "However perhaps the dominant feature are the steep but rounded outlines of the Red Hills, with the spikier Cuillin peaking out over them in places; the path heads this way, eventually curving left."
      },
      {
        "stage": 5,
        "description": "Soon the path reaches a bench backed by a view of the Kylerhea Hills. Continue to reach a path junction. The easiest way back from here is to turn left on the blue route which soon loops back to the outward route. Otherwise, turn right to keep following the red route; this path descends gradually around the north side of the hill across a felled area, eventually swinging back to return across the hillside at a lower level. There are views through birchwoods to the industrial buildings comprising a massive fish feed plant."
      },
      {
        "stage": 6,
        "description": "The path crosses a wooden bridge and climbs once more to reach an area of more open, native woodland. At one point the path climbs a rocky slab, but this can be bypassed using a route off to the left. Once again there are views ahead of Kyleakin and the Skye Bridge, now from a new angle. Eventually the outward route is rejoined; continue ahead and follow the path back down to the start."
      }
    ],
    "scraped_at": 1756310197.045206
  },
  {
    "title": "Bearreraig Bay",
    "summary": "Bearreraig Bay is a beautiful stony bay famous for its fossils - a short walk with a very steep path. This is a quiet and secluded place when the nearby Old Man of Storr is packed with visitors.",
    "source_url": "https://www.walkhighlands.co.uk/skye/beareraigbay.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.25,
    "estimated_hours": 2.0,
    "ascent_m": 153,
    "start_grid_ref": "NG516524",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Heading north on the main road from Portree, the Hydro road turns off on the right immediately after the Storr Lochs. There is a bus shelter next to the turning. There is a parking area part way along this road before the dam. Start the walk here and continue along the road before turning right to leave the road at a path sign to follow a short section of path skirting the house and turning area."
      },
      {
        "stage": 2,
        "description": "The winch house is the square flat roofed building used to pull a carriage up and down a funicular track to the Hydro station below. Bear left to head down the far side of the winch house to reach a viewpoint.  The viewpoint has superb views of the bay below, with the Storr cliffs visible far above. Interpretative displays explain about the fossil finds and the geology. The path down to the bay starts on the seaward side of this viewing area, descending in a series of zigzags. It soon reaches a staircase cut out of the rock above a big drop - luckily this part has a handrail!"
      },
      {
        "stage": 3,
        "description": "Beyond the path continues zigzagging right down to the Hydro station on the beach. The hydroelectric scheme, which includes the Storr Lochs on the moorland above, was built in 1952 and gave Skye its first electricity supply (apart from the Royal Hotel which had a generator). It has a capacity of 2.4MW, not nearly enough to supply the island's needs today. You can see the turbine through the windows. Go through the gate and head along the front wall of the building, passing above the water rushing out from the turbines. Beyond the building, cross the stile. Usually it is easy to cross the burn near here as most of the water now heads through the turbines instead but occasionally there is more water here and it may be impassable."
      },
      {
        "stage": 4,
        "description": "After crossing there's a broken stile. Cross to head out onto the stony beach - looking out for otters which can sometimes be spotted swimming offshore. At the far end of the bay crumbling cliffs reach down almost to the sea. Below these cliffs is the best place to hunt for fossils - at low tide; but don't take any away as this is a protected site. Afterwards, return back past the front of the hydro building. Before heading back up the steep path to the right, it's worth crossing the stile ahead and exploring the wave cut platforms at this end of the beach. If you round the corner of the bay you can see Holm Island just offshore - according to local legends this was Tir Na Nog, the land of eternal youth. It's necessary to reascend the path you came down in order to return to the start."
      }
    ],
    "scraped_at": 1756310199.6332908
  },
  {
    "title": "Talisker Bay",
    "summary": "A very easy walk to a truly enchanting sandy bay, the finest on Skye. The setting is superb, with a dramatic sea stack, and great cliffs down which a waterfall plunges to the sea. Magical on a fine evening.",
    "source_url": "https://www.walkhighlands.co.uk/skye/taliskerbay.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.0,
    "ascent_m": 54,
    "start_grid_ref": "NG326306",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park carefully near the end of the tarmac road to Talisker (the tiny settlement, and not the Talisker distillery which is actually at Carbost). Take care not to block the turning area, or any passing places - parking further back along the road as necessary (there's an old quarry on the left at one point). The walk begins along the left hand track from the road end; there is a sign reading 'To the bay'. After passing a gate, the track emerges at the side of Talisker House. This stately white house dates from the 1720s and for centuries was the home of the next-in-line to the Macleod chief. Dr Johnson and James Boswell stayed here during their tour of the Hebrides, Boswell writing 'Talisker is a better place than one commonly finds in Sky. It is situated in a rich bottom. Before it is a wide expanse of sea, on each hand of which are immense rocks; and, at some distance to the sea, there are three columned rocks rising to sharp points. The billows break with prodigious force and noise on the coast of Talisker. There are here a good many well grown trees.'"
      },
      {
        "stage": 2,
        "description": "The track continues through a further gate beyond the house. Looking back, the prominent dome-shaped hill ringed by cliffs is Preshal Mòr . Boswell ascended this with Donald MacLean, the then Laird of Coll; the route up the cliffs is known as Boswell's Buttress and is quite a scramble."
      },
      {
        "stage": 3,
        "description": "The track rises slightly before emerging at the southern end of Talisker Bay. Talisker Bay is a beautiful beach of stones and sand, best visited at low tide. The northern side of the bay is hemmed in by vertical cliffs and an impressive waterfall."
      },
      {
        "stage": 4,
        "description": "The southern end of the beach has an impressive sea stack. There is both black and white and on the beach, often blended by the burns flowing out to create beautiful, complex patterns."
      },
      {
        "stage": 5,
        "description": "The bay is a wonderful place to linger and is especially renowned for its sunsets."
      },
      {
        "stage": 6,
        "description": "When you can drag yourself away from the beach, the return to the start is back the same way."
      }
    ],
    "scraped_at": 1756310212.2286572
  },
  {
    "title": "Rubh an Eireannaich, Broadford",
    "summary": "This picturesque walk follows a shoreside path to reach Broadford pier and then continues out to the low headland beyond. There are good opportunities for spotting wildlife and flowers. The optional alternate return is boggy.",
    "source_url": "https://www.walkhighlands.co.uk/skye/irishmanspoint.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.0,
    "ascent_m": 20,
    "start_grid_ref": "NG643234",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "From the large car park overlooking Broadford Bay, walk north - keeping to the right of the play area - to reach a footbridge. Turn right across this, with excellent views out over the bay."
      },
      {
        "stage": 2,
        "description": "Once over the bridge keep right on the footpath - signed for Broadford Pier and Irishman's Point - that runs parallel to the road through the trees adjacent to the shoreline. This fine path soon emerges at Broadford's main pier."
      },
      {
        "stage": 3,
        "description": "From here go through the gate straight ahead - signed for Irishman's Point and Corry Lodge. When the track forks take the right hand branch which follows the shore. At a second fork keep right again, following the path between the shore and trees, and passing a derelict building. When the track reaches a gate leave it and take the grassy shoreline path to the right. This keeps close to the shore until the low cliffs of Rubh' an Eireannaich or Irishman's Point. There are good views of the low lying island of Pabay which is inhabited and even issues its own stamps."
      },
      {
        "stage": 4,
        "description": "The driest way back is to retrace your steps, but if you don't mind a bit of boggyness you can continue on the path which now climbs up to the flat grassy area above the low cliffs. Cross a stile and continue on the wet path as far as a broad grassy bay. It is possible at low tide to continue right round the shoreline to Camas na Sgrianadin, where there is a track - and then follow a cycle path back to Broadford, but this route involves crossing slippery rocks and is impossible if the tide comes in. Instead follow a faint path that cuts inland from the middle of the grassy bay."
      },
      {
        "stage": 5,
        "description": "This is very boggy, but eventually joins a rough track. This leads to a gate; pass through into a grassy field. At the far end of this is another gate, leading back to the outward route. Now retrace your steps along the track to Broadford Pier and back to the start using the path beyond."
      }
    ],
    "scraped_at": 1756310214.813376
  },
  {
    "title": "Caisteal Maol and Kyleakin",
    "summary": "This short but interesting walk explores the village of Kyleakin and its environs - including the Skye Bridge and a ruined castle.",
    "source_url": "https://www.walkhighlands.co.uk/skye/caistealmaol.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": 6,
    "distance_km": 3.5,
    "estimated_hours": 1.5,
    "ascent_m": 40,
    "start_grid_ref": "NG753264",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the large car park opposite the village green in the centre of Kyleakin - it is possible to check the tide times on the notice board between March and October - at very high tides a rough detour needs to be taken. The walk begins by continuing along the road towards the pier at the end of the village. After passing King Haakon's Bar, there's an optional detour onto a fenced path on the left. This leads up, via steps, to Kyleakin's War Memorial atop the low hill known as An Cnap - a great viewpoint. Return back down the steps to the road, and head left along it towards the old ferry pier."
      },
      {
        "stage": 2,
        "description": "Retrace your steps briefly and then turn left to continue alongside the habour / river until you reach a bridge across the river to South Obbe. Cross the bridge and follow the road to the left until it ends at a pier."
      },
      {
        "stage": 3,
        "description": "A path begins here which leads around the coast towards Caisteal Maol. It emerges onto the beach at a large boathouse. The route continues round to the castle on the rocky shoreline; at low tide this is simple enough but at high tide some very rough detours inland may be necessary. Below the Castle, a clear path ascends to the ruins, passing a bench."
      },
      {
        "stage": 4,
        "description": "Caisteal Maol (often anglicised to Castle Moil) was the ancestral seat of the Clan MacKinnon. According to Legend it was built by 'Saucy' Mary, a Norwegian princess who married a MacKinnon. The MacKinnons supported themselves by exacting a toll from ships passing through the straits. The castle is thought to date from the late fifteenth century and is still today a commanding viewpoint over the straits, and also back over Kyleakin. Return by the same route to the bridge in Kyleakin."
      },
      {
        "stage": 5,
        "description": "Once back across this bridge, this time turn immediately left to follow the pebbly river banks and later a grassy path upstream. This leads into an area of tidal salt marsh known as the Obb, with many pink thrift flowers in summer; there are often many herons to be seen. The path soon bends right, passing where the river emerges from a pond, and passes between the new Kyleakin village hall and the primary school (ignore a footpath off right here) to follow a tarmac road to emerge at the main road."
      },
      {
        "stage": 6,
        "description": "Continue on a narrow path directly opposite to reach a telescope and some benches down by the coast. Just to the right of the Skye Bridge is Eilean Ban, the white island, the cottage on which was the last home of the famous wildlife writer Gavin Maxwell, author of Ring of Bright Water. The cottage is now a museum of Gavin Maxwell's effects; guided tours are available if pre-booked through the Eilean Ban Trust."
      },
      {
        "stage": 7,
        "description": "Turn right on the path just above the beach. Before arriving back at the start, there is a small wildlife garden down to the left with a pond and open hide - a possible place to spot otters as well as herons and other birds."
      }
    ],
    "scraped_at": 1756310217.4017687
  },
  {
    "title": "Staffin slipway and An Corran beach circuit",
    "summary": "A short walk on well defined paths and minor roads exploring the crofting village of Staffin and its coast.",
    "source_url": "https://www.walkhighlands.co.uk/skye/staffin.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.0,
    "estimated_hours": 2.0,
    "ascent_m": 164,
    "start_grid_ref": "NG490674",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Staffin is a traditional crofting community scattered around a lovely bay. It remains a stronghold of the Gaelic language. Park in the car park at Columba 1400, a community and leadership training centre providing courses for disadvantaged young people and businesses across the UK. It also houses an excellent cafe, and serves evening meals most nights. The walk starts up the steep gravel track signed for An Corran.  After the short gravel section turn right to pass above the playing field - this section is often very muddy. Then head to the left uphill alongside the stone wall. This field was part of the glebe land of the Free Church of Scotland and was traditionally worked by the community to provide upkeep for the church and minister."
      },
      {
        "stage": 2,
        "description": "After crossing the stile the path continues over the moor until reaching the start of a steep zig zagging descent to Staffin slipway seen below.  There are the remains of an iron-age chambered cairn just to the left of the path. Looking back there are great views of the whole Trotternish ridge from the Storr to the Quiraing. Follow the path down to the shore, taking care; the lower section has been repaired by bus tour drivers in collaboration with the Staffin Trust."
      },
      {
        "stage": 3,
        "description": "It is worth venturing out onto the Slipway; boat trips for both wildlife and fishing operate from here during the summer months. On clear days there are grand views over to the mountains on the mainland, with the domed summit of Ben Alligin and the square fortress of Slioch prominent; the houses of Gairloch and the beaches at Red Point are also sometimes visible. After exploring the slipway head left along the coast road.  The small, flat island on the right is Staffin Island; the house and poles were once part of a salmon netting station. These days the island is still used for grazing cattle in the winter, the beasts swim across from the beach."
      },
      {
        "stage": 4,
        "description": "At the lay-by head down a ramp to explore the small sandy beach at An Corran. At low tide fossilised dinosaur footprints are exposed to the right of the large boulders on the flat mud stone.  These are sometimes obscured by sand. The footprints belong to the three-toed Hadrosaur, a herbivore which lived 170 million years ago. More recently the land above the beach was the site of an important mesolithic community. Stone tools made here have been found in Applecross and other ancient sites. The site is now buried under the road."
      },
      {
        "stage": 5,
        "description": "Return to the coast road and follow it past a single house with a particularly wonderful outlook to the Quiraing across the width of Staffin's wide bay. Continue along the tarmac, heading over the cattle grid towards the bridge over the Stenscholl river."
      },
      {
        "stage": 6,
        "description": "The river, and its outflow into the sea, are good places to look for otters. Cross the bridge and keep left at the junction, following the road up the hill to a T junction with the main road. Turn left to return to Columba 1400 passing Staffin Stores on the right."
      }
    ],
    "scraped_at": 1756310219.98752
  },
  {
    "title": "Coral Beaches, Claigan near Dunvegan",
    "summary": "This popular short walk to the spectacular Coral Beaches, one of the most beautiful coastal locations on Skye. The walk heads across crofting land with livestock so be sure to keep any dogs under tight control.",
    "source_url": "https://www.walkhighlands.co.uk/skye/coralbeaches.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.0,
    "estimated_hours": 2.0,
    "ascent_m": 90,
    "start_grid_ref": "NG232537",
    "terrain": null,
    "latitude": 57.3,
    "longitude": -6.2,
    "stages": [
      {
        "stage": 1,
        "description": "Continue on the minor road past Dunvegan Castle to its end at Claigan; there is a car park here on the left - if full do not block gates/entrances. At the far end of the car park is an information board giving details about the Coral Beaches and the walk. Go through the gate and follow the track. Eventually it descends to run alongside the coast."
      },
      {
        "stage": 2,
        "description": "There are lovely views across Loch Dunvegan to Borreraig on the far side and Dunvegan Head; inquisitive seals sometimes pop up and peer at walkers passing along here. A pebbly bay with some coral sands is reached at Camas Ban, where the track heads off to the right. For the coral beaches bear left across the grass and then up towards the obvious gap in the dry stone wall. A stream is crossed on stones. Pass through the gap in the wall and over a slight rise. The true Coral Beaches are now revealed ahead - a beautiful sight, which on a fine day looks almost tropical."
      },
      {
        "stage": 3,
        "description": "Descend down to the coral beach. Close inspection reveals the sand to be made out of dried, calcified algae known as maerl. There are also thousands of tiny, delicate snail shells."
      },
      {
        "stage": 4,
        "description": "Continue along the beach to the end of the sands. The island just off-shore to the left is Lampay whereas the larger island straight ahead is Isay."
      },
      {
        "stage": 5,
        "description": "On the way back, it is worth ascending the little flat-topped hill behind the beaches, known as Cnoc Mòr a Ghrobain. This has excellent extensive views over the beach from Stein in Waternish right round to Dunvegan Head. The return is by the same route."
      }
    ],
    "scraped_at": 1756310222.6317592
  },
  {
    "title": "Glencoe Lochan trails",
    "summary": "A gem of a walk following waymarked trails through ornamental woodland at the foot of Glen Coe.The picturesque and serene lochan and its wooded shores contrasts with the wild and dramatic mountains of the glen which are seen across it.",
    "source_url": "https://www.walkhighlands.co.uk/fortwilliam/glencoelochan.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.5,
    "ascent_m": 100,
    "start_grid_ref": "NN104594",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the Glencoe Lochan car park; to find it, follow the minor road east from the village towards the Clachaig Inn; take the second of two lefts after the bridge over the River Coe; the car park is then reached by turning right a short way up this road. It is well signed. There are three short waymarked trails; the route described here combines them all. The blue waymarked 'Mountain Trail' is followed first; this section is steep but could be omitted by heading straight for the lochan. For the mountain trail, take the path on the right and follow the blue markers."
      },
      {
        "stage": 2,
        "description": "Turn right again to follow the path which climbs steeply uphill. At the top it reaches a picnic table with a view across Loch Leven. The path now descends again, eventually reaching a t-junction beside the lochan. Turn right here, following the trail around the lochan. The woodland here was planted by Lord Strathcona, in an attempt to make his Canadian wife feel more at home in the Highlands; sadly this failed and the couple later emigrated to Canada."
      },
      {
        "stage": 3,
        "description": "The lochan is very picturesque and there are views across it towards Beinn a Bheithir. The lochside path is accessible to wheelchairs and is very popular, with several wooden platforms built out onto the loch for fishing. The loch itself was created artificially as part of Lord Strathcona's estate; it is often known as the 'Hospital Lochan' as Glencoe House served as the local hospital for many years. Continue round the lake, passing several picnic benches. The views change as you walk around the loch, and soon the Pap of Glencoe is seen, often reflected in the water."
      },
      {
        "stage": 4,
        "description": "Further round, look out for a yellow waymarked path which turns off to the right. This is the woodland path, and extends the route for a further kilometre or so. It winds between the trees including Douglas Firs and Sequoias.  There are various junctions with minor paths, and one viewpoint with a seat overlooking Loch Leven. Keep following the yellow markers (generally bearing left); when the path reaches a larger track turn right and then immediately left by the wooden handrail. Pass a water-lilly covered lochan and return to the start just beyond."
      }
    ],
    "scraped_at": 1756310225.2259645
  },
  {
    "title": "Gynack Mill Trail, Kingussie",
    "summary": "This short, easy walk follows the Gynack Burn to explore the history of Kingussie. It can be linked to the Creag Bheag and Tom Baraidh route to make a much longer walk.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/gynack-mill.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.3,
    "estimated_hours": 1.0,
    "ascent_m": 50,
    "start_grid_ref": "NH755007",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a large free car park just behind the Duke of Gordon Hotel in the centre of Kingussie, off Gynack Road, where there are also toilets and information about the local path network. From here return to the road and turn left to head uphill following the sign for the Gynack Mill Trail. Soon another green sign is reached, follow the steps down to the right to reach the Gynack Burn. This burn was at the heart of the Fourth Duke of Gordon's plans to build a new town at Kingussie. The water did power a number of mills producing flax, flour and wool, however Kingussie did not develop into the industrial powerhouse the Duke had envisaged, becoming instead, a popular tourist town once the railway arrived in 1863."
      },
      {
        "stage": 2,
        "description": "Across the burn you can see one of the mills, now converted to housing. Continue to cross the footbridge. There is an interpretation board with more information about the history of Kingussie. Pass this, keeping on the main path ahead. Pass a viewing platform on the left where the remains of one of several dams built to control the water flow can be seen. The writer, Robert Louis Stevenson, author of Treasure Island and many more popular books, spent his holidays in Kingussie in the 1880's and he loved to sail paper boats on the burn. Keep on the path and head uphill through the trees."
      },
      {
        "stage": 3,
        "description": "When the path forks, keep on the main path heading straight ahead.  At a T junction turn left and follow the path upstream, a little way from the burn now. The path soon bends to the right between wire fences, with newly built houses on the left. When the road is reached turn left. After the last house on the left turn left at a green signpost, passing a stone cairn and heading down steps to the river."
      },
      {
        "stage": 4,
        "description": "Cross the bridge and bear left on the other side, passing an information board and then turning left onto the road to head downhill. The road passes the St Vincent Hospital on the right and soon reaches the green signed path heading down to the river on the left. Take this path for the second time and cross the bridge. Here keep straight ahead following a smaller path alongside the fence to go up a flight of steps. At the top turn right through the gate onto a track, Boa Vista Road, to pass a number of lovely houses overlooking Kingussie. When a road junction is reached turn right to head downhill towards the town. Further down there are good views over the cemetery to Creag Bheag."
      },
      {
        "stage": 5,
        "description": "When you see a clock tower on the left, head towards it for a few paces then visit the information board on the right showing an old map of the town from the viewpoint. Return to the main road and continue down to reach the High Street. Go straight across at the traffic lights and follow King Street until the T junction where you turn right along Spey Street. Here the old Post Office building can be seen on the left."
      },
      {
        "stage": 6,
        "description": "Cross the bridge over the Gynack Burn and then turn right into the park. Walk through the formal gardens, passing the war memorial, with the imposing Duke of Gordon Hotel ahead. Once out of the park cross the road and head up Gynack Road to return to the car park at the start of the walk."
      }
    ],
    "scraped_at": 1756310227.8146656
  },
  {
    "title": "Riverside Walk, Kincraig",
    "summary": "A beautiful out-and-back walk along a high bank above the River Spey with good views of the Cairngorms and passing through lovely woodland.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/kincraig.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.7,
    "estimated_hours": 1.0,
    "ascent_m": 20,
    "start_grid_ref": "NH833056",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a small parking area just down from The Old Post Office Cafe in the centre of Kincraig, next to the phone box. From here head back up the road past the stores and turn right along Speybank Walk. After passing some fine houses the route becomes a track up through the woods. When the track bends left keep straight ahead onto a narrow path through the trees, signed Speybank Walk."
      },
      {
        "stage": 2,
        "description": "The route runs parallel to a winding new surfaced section of the Speyside Way path which is set back further from the high bank above the river; the two routes meet at several points. Keep straight on when a path joins from the right, and keep right when a fainter path forks off to the left. The Speyside Way path is joined for a section of boardwalk; beyond this leave it again by climbing up a steep bank to reach the top of the ridge overlooking the river."
      },
      {
        "stage": 3,
        "description": "The Spey is wide here and there are good views down to it at times as well as across the strath to the Cairngorm mountains. Continue along the path, passing a bench (link path to the Speyside Way goes off left here) and a gate, and a mixture of birch and oak trees with a thick carpet of heather and blaeberries underneath. The riverbank can be very steep in places so care is needed with young children."
      },
      {
        "stage": 4,
        "description": "After a short section of fencing, an old marker stone with a cross carved on it is passed. Keep following the path until eventually a small clearing with a wooden bench is reached. This is a good viewpoint and a lovely spot for a break."
      },
      {
        "stage": 5,
        "description": "Beyond the bench the path rejoins the Speyside Way. Either turn round to begin the walk back by the same outward path, or instead turn left to follow the Speyside Way back. Once back at Kincraig it is worth exploring the long bridge over the River Spey at the north end of Loch Insh. The bridge was built in 1874 before which a ferry boat ran across the same stretch of water, which lead to the original name of the village which was Boat of Insh."
      }
    ],
    "scraped_at": 1756310230.416053
  },
  {
    "title": "Nethy Bridge riverside and Dell woods",
    "summary": "This is a walk of two halves, the first alongside the burbling River Nethy and then through beautiful Dell Woods (a National Nature Reserve) to return to Nethy Bridge. An easy short walk on good, waymarked paths, with plenty of variety and the option to extend the walk.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/nethybridge.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 30,
    "start_grid_ref": "NJ001205",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start at Nethy Bridge Community Centre (just up from the shop) where there is parking and toilets. Start the walk by taking the riverside path opposite the community centre. The path drops down to the river and follows it upstream. In the past, timber has, and still does to some extent, play a major part in the local economy. This river was used to transport felled trees to the River Spey and on to the sea at Spey Bay. Dams and sluices further up allowed water to build up which when released would float hundreds of tree trunks downstream.  After a short while the all-abilities path turns right but our route continues straight ahead following the river bank."
      },
      {
        "stage": 2,
        "description": "Near a house the path joins a minor road. Turn left and continue until the pretty, green bridge is reached. Don't cross the bridge but continue along the road. Follow the road as it turns sharp right and passes between houses. At the junction cross the road and follow the path straight ahead through the two sets of beech hedging."
      },
      {
        "stage": 3,
        "description": "The two large Wellingtonia (giant redwoods) trees and the beech hedges mark the entrance to what used to be the tree nursery established in 1855 to raise pine seedlings for replanting the forest. Today natural regeneration techniques are favoured and the nursery closed in 1984. Continue straight ahead at a small crossroads of paths and keep ahead at the end of the hedges following the blue and green arrows. Turn right at the next junction through a lovely area of mixed pine wood."
      },
      {
        "stage": 4,
        "description": "As the path nears the corner of a large white house turn left following the arrowed signs and continue through the pine forest. Eventually the path runs near the back of a number of houses. Ignore the path right towards the houses here instead bear left further into the wood. After winding through the trees, a field is seen on the right and a path junction with a picnic table reached. Our route continues onto the wider track ahead but you can extend the walk by a couple of miles by following the loop of the green waymarked 'Puggy line trail' which follows the line of an old railway on the left. Otherwise continue ahead until the track emerges from the wood onto a road. Turn right and follow the road, keeping straight on past houses back to the centre of Nethy Bridge. At the road junction turn left to return to the community centre."
      }
    ],
    "scraped_at": 1756310233.0018802
  },
  {
    "title": "River Spey & old railway, by Grantown-on-Spey",
    "summary": "This short walk follows the Speyside Way along the old railway line near Grantown on Spey before returning on a rougher path right beside the Spey. Views of woodland, farmland, distant hills and the beautiful River Spey.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/river-spey-grantown.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 45.0,
    "ascent_m": 23,
    "start_grid_ref": "NJ035262",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Start from the informal parking layby opposite the old smokehouse building on the right just after the turn off for Nethy Bridge (B970) from the A95 south of Grantown on Spey; do not obstruct access for farm vehicles to the field. If full you can usually find more parking on nearby Achnagonalin industrial estate (home to an excellent cafe/bakery and pizzeria). If walking from Grantown either take A939 (or the old military road through the woods) and cross the Spey Bridge and take the 2nd right off the A95. Start by crossing the B970 and taking the Speyside Way path on the left hand side of the entrance to the industrial building ahead. This heads round the back of the building, through a gate and up a ramp onto the old railway line."
      },
      {
        "stage": 2,
        "description": "The Speyside Line railway ran closed in 1968 and became part of the Speyside Way long distance walk in 1981. The route now runs from Buckie on the Moray coast to Newtownmore mainly following the River Spey. Follow the path under a bridge and through a set of double gates and continue ahead passing through sparse birch trees."
      },
      {
        "stage": 3,
        "description": "Continue on the Speyside Way until just after a farm gate with pedestrian gate alongside and look out for a small stile on the right. Climb this and head straight down through the grass to the trees and river ahead. Bear right near the river to cross a stile and pick up the riverside path soon passing a small fishing hut. Continue ahead on the riverside path."
      },
      {
        "stage": 4,
        "description": "This section of the river is particularly popular for fly fishing, soon the path passes a large wooden seat and grill made from old horseshoes used by the fishermen. Watch out for salmon and trout leaping in the river as the path continues downstream. On the far side of the river the old cemetery at Inverallan can be seen. Pass another small fishing hut."
      },
      {
        "stage": 5,
        "description": "Continue through a wooden kissing gate as Spey Bridge comes into view. Dating from 1931 this bridge replaced a much older bridge built by General Wade in 1754 which can still be crossed on foot further downstream. Pass a third fishing hut. Don't go under the bridge but climb the tall flight of steps on the right to reach the road. Turn right at the top and follow the pavement, crossing the road entrance to Achnagonalin industrial estate and taking the next right to return to the start."
      }
    ],
    "scraped_at": 1756310235.591611
  },
  {
    "title": "Linn of Dee circuit, Linn of Dee, near Braemar",
    "summary": "This short waymarked walk begins with a visit to the beautiful Linn of Dee, where the river cascades through a narrow chasm, topped by an old stone bridge. It then heads up the lower reaches of Glen Luibeg, passing more waterfalls and through beautiful old pinewoods.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/linn-of-dee.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 42,
    "start_grid_ref": "NO062898",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the large National Trust car park at the Linn of Dee; there is a charge. Return to the road and take the footpath - waymarked in blue and yellow - off the opposite side. This soon descends gently down steps towards the River Dee. Our blue route turns left at this path junction, but first turn right with the yellow markers to take a closer look at the Linn of Dee. Here the river thunders through a rocky chasm, spanned by the old stone road bridge."
      },
      {
        "stage": 2,
        "description": "It's worth heading up to the road bridge and crossing the road to a path on the far side to view the river just above the falls. After viewing, return to the path junction and now take the blue waymarked path that continues downriver."
      },
      {
        "stage": 3,
        "description": "The path continues downstream by the river, through the stately pinewoods. After around 350m follow the main path as it bears left and ascends a series of steps to climb up to the road. Go straight across this onto the path on the far side, which then bears right parallel to the road."
      },
      {
        "stage": 4,
        "description": "The path emerges on a track beside the River Luibeg. Turn left up the track; after 250m a blue marker indicates where to fork right onto a path that keeps the river in close view. The natural pinewoods here are simply stunning, and regenerating strongly since the National Trust for Scotland has tried to bring deer numbers down towards natural levels. The River Luibeg has some attractive cascades, and the remains of an old salmon ladder are visible at one point."
      },
      {
        "stage": 5,
        "description": "Eventually the path swings left, and there are distant views up the glen towards the cone-shaped summit of Derry Cairngorm. When the path meets a large track, turn left along it. After another 450m a signpost indicates where to turn right onto a path through the woods back to the car park. This crosses a boardwalk in an open area and climbs a few steps before reaching a fork. The left option is the shortest route back to the start."
      }
    ],
    "scraped_at": 1756310248.1949296
  },
  {
    "title": "Loch Vaa, near Aviemore",
    "summary": "Hidden away in the pinewoods just off the A95 between Aviemore and Boat of Garten, Loch Vaa is a secluded gem. This short walk makes a straightforward circuit around the loch.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/loch-vaa.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.0,
    "ascent_m": 28,
    "start_grid_ref": "NH910174",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from next to Laggantrygown Cemetery, which is just off the main A95 between Aviemore and Boat of Garten. The parking for Loch Vaa is on the left with the locked cemetery car park to the right - there is further parking in a layby towards Aviemore. Begin the walk on the clear path outside the left edge of the cemetery. This soon swings left and climbs up a wooded ridge; known as an esker, this was formed by glacial action. The path then forks; keep ahead on the main path which curves left downhill to the shores of Loch Vaa."
      },
      {
        "stage": 2,
        "description": "The loch is a beautiful and secluded place set amidst stunning pine and birchwoods, although it is only a stones throw from the busy road. Continue along the shores (depending on the water levels) to the left towards the very attractive boathouse."
      },
      {
        "stage": 3,
        "description": "Head into the woods to the left of the boathouse. Further on a track leads through the forest. Stay on the main track, ignoring a path off to the right. Eventually a (locked) gate is reached; pass to the right of this, turning right along the track beyond."
      },
      {
        "stage": 4,
        "description": "Keep along this track. Ignore a path off right, then a fainter track after 500m. After 1km from the gate, look out for another track off right that has two branch points, the second with a small boulder amidst smaller rocks at the turning. Follow this track, which leads back towards Loch Vaa."
      },
      {
        "stage": 5,
        "description": "It eventually becomes a path (with a view through the trees to the loch down to the right) - ignore the path heading steeply down to the loch, instead continuing ahead to cross a stile over a fence. Beyond this the path climbs a low wooded hill with good views over the loch."
      },
      {
        "stage": 6,
        "description": "When the narrow path forks again take the right branch which descends steeply. The path then undulates, with a final steeper climb where a fence comes alongside on your right (and the loch beyond). Continue along the fence path until a stile. Cross this and follow a path along the top of a esker until it reaches the outward route near the start. Turn left here to head back to the cemetery and car park."
      }
    ],
    "scraped_at": 1756310250.7837336
  },
  {
    "title": "Cambus o' May Pinewood trail",
    "summary": "This is the longest of three circular waymarked trails through the pinewoods at Cambus o' May. The walk offers views up Deeside, passes two attractive forest lochans and offers the chance to spot woodland wildlife.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/pinewood-trail.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.25,
    "estimated_hours": 2.0,
    "ascent_m": 50,
    "start_grid_ref": "NO403980",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is an information board in the car park giving a map of the three waymarked trails here; this route follows the longest, the Pine Trail. The route is waymarked by yellow-banded posts. All three trails begin up the path which climbs up into the trees between the posts. This first stretch of path runs along a low, birch-clad ridge and gives some views up Deeside to the left."
      },
      {
        "stage": 2,
        "description": "Down to the right is an attractive tree-fringed lochan. Ignore a path turning off to the right, instead keeping straight ahead (yellow and red markers). Further on the path reaches a track - go straight across here."
      },
      {
        "stage": 3,
        "description": "The path now runs along beneath a line of pylons before plunging back into the pinewoods. After crossing a small footbridge with a stone bridge beside it, keep straight ahead (ignoring the red route turning off to the right). Eventually the path emerges onto a track; turn right along this. Follow the track, keeping ahead at a junction where another track goes off left. When a yellow marker post is reached turn right onto a path once more."
      },
      {
        "stage": 4,
        "description": "At another junction the red route joins back in from the right; keep ahead. Bear left at another junction, crossing a wooden footbridge. Soon the route passes another attractive lochan - seen on the right. After crossing a tiny stone bridge there is a picnic table overlooking the water. Continuing the walk, turn left at the next junction and then left again onto a track. Keep ahead along the track until it approaches a barrier - turn right here onto the waymarked path which leads back to the car park."
      }
    ],
    "scraped_at": 1756310253.384987
  },
  {
    "title": "Druim an Aird, near Laggan",
    "summary": "This walk begins by passing above the lower Pattack gorge and its waterfalls. It then follows forest tracks to reach the lonely ruins of the deserted village of Druim an Aird. It was once possible to make a circuit using the Right of Way from Dalwhinnie, but this path has been lost following forest works so the return is back the same way.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/pattack.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 97,
    "start_grid_ref": "NN567903",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "From the car park take the path heading south-east signed Forest Walks and Waterfall. Ignore the first path going off on the right and walk uphill for a short while until you reach a path junction. The viewing area for the waterfalls (not to be confused with the nearby more impressive Falls of Pattack) is just over the right here; the cascading river in its impressive gorge has been used as a location in TV's Monarch of the Glen. From the falls walk uphill along the main path (ignoring the faint path on the right next to the river)."
      },
      {
        "stage": 2,
        "description": "The path winds uphill to a waymarked junction; you can turn left here to follow a loop path through the attractive pinewoods but it can be overgrown; both routes rejoin a little further on. Follow the path as it continues down to a t-junction with a forestry track where you turn right."
      },
      {
        "stage": 3,
        "description": "Follow the wide track. When a junction is reached, turn left. There are good distant views ahead towards the Creag Meagaidh range."
      },
      {
        "stage": 4,
        "description": "At another rather industrial looking junction, turn left again. Continue along the track. Soon the remains of Druim an Aird can be seen on the right in a fenced enclosure next to an interpretation sign. It is not known for certain why the village was deserted but one local story is that the villagers left after all the menfolk died in a snowstorm returning from wedding celebrations near by."
      },
      {
        "stage": 5,
        "description": "It used to be possible to make a different return using the old right of way from Dalwhinnie, but this was not reinstated after felling work and is now very difficult to follow with brash and bog. Instead, it's best to return the way you came."
      }
    ],
    "scraped_at": 1756310255.9678965
  },
  {
    "title": "Falls of Pattack",
    "summary": "The true Falls of Pattack are somewhat hidden away, but are much more impressive than the better known lower falls near the main road at Feagour. This easy out-and-back walk follows a good track until a final short path leads to the best viewpoint looking over the falls.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/falls-of-pattack.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 98,
    "start_grid_ref": "NN555899",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins up the track signed for Gallovie Farm from the A86, but there is no parking here - instead park around 70m to the east in the layby on the opposite side of the road. Return to the junction and follow the track, soon crossing a bridge over the River Pattack."
      },
      {
        "stage": 2,
        "description": "At a junction turn right to keep on the main track. The track leads past a vehicle barrier, then reaches is another junction of tracks - this time turn left, signed again for Gallovie Farm. The track winds uphill through the trees, soon passing the farmhouse and a couple of cottages. Eventually it leads on through a gate; there are blue waymarker arrows."
      },
      {
        "stage": 3,
        "description": "Look out for a pedestrian gate and sign on the left side, and leave the track to head through the gate. A path leads through dense forestry. Ignore a path off left at a junction and continue ahead. Soon the path curves left and approachs the rim of the gorge carved by the River Pattack, with a view down over the dramatic falls. Take care as the edge is unprotected."
      },
      {
        "stage": 4,
        "description": "Return to the path junction. You can detour along the branch path to the right for a different persepective on the falls looking up the gorge. To return to the start of the walk, though, it's best to head back the same way."
      }
    ],
    "scraped_at": 1756310258.5510068
  },
  {
    "title": "Insh Marshes - Invertromie Trail",
    "summary": "A lovely walk exploring the edge of the Insh Marshes RSPB nature reserve with good views and varied countryside. Bring binoculars for the three bird hides.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/inshmarshes.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 2.0,
    "ascent_m": 89,
    "start_grid_ref": "NN774998",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Start at the Insh Marshes RSPB reserve car park and walk away from the B970 to the rear of the parking area. At the start there is the option to detour 250m to the Gordonhall hide. This hide and others on the route overlook the floodplain and depending on the time of year it is possible to see ducks, geese, swans, lapwings, curlews, redshanks, buzzards and osprey from here to name but a few. To start the walk head uphill from the parking area. At a fork the route takes the 'Invertromie Trail' to the right, but first go left visit the luxurious, circular Lookout hide which boasts a rooftop terrace, and information in the hide beneath."
      },
      {
        "stage": 2,
        "description": "Now take the Invertromie Trail, soon forking left onto a smaller path at a wooden barrier. There are good views over the marshes and woodland. The Insh Marshes are important for wildlife as they are the largest area of floodplain in Britain that has not been improved or drained meaning it supports a vast array of different species. It also means that as the marshes flood naturally several times a year the views are often different on each visit. Follow the trail as it passes next to a fence with the woodland on the left. Cross a small wooden bridge. Just afterwards there is a chance to detour 180m down steps to the Invertromie Hide which overlooks the wetland."
      },
      {
        "stage": 3,
        "description": "Continuing on the trail, climb gently across grassland towards the woods. Pass through a small gate and bear slightly right on the narrow but clear path as it enters the woodland. Roe deer can often be seen in this area and in the autumn there are many types of fungi. Soon a t-junction with a sign is reached. To the left here is another possible detour to a view point and picnic area; the main route turns right."
      },
      {
        "stage": 4,
        "description": "Keep following the white arrow markers and continue on the path to a gate where you cross a track to pick up the path on the other side. The path follows a ridge with good views from a seat, and lots of purple heather in late summer/autumn. Pass through another gate and into a lovely area of birch woodland. The trail then curves round to the left heading downhill and then turns right at a signed junction (path left leads to an old churchyard)."
      },
      {
        "stage": 5,
        "description": "At the bottom of a slope the path turns right, follows a wall and passes through a gate and then slopes downhill to emerge into Tromiebridge meadow, through another gate. Here the path follows the banks of the River Tromie, where Tromie Mills can be seen on the far side. 150 different plant species have been identified in this meadow which is particular good for orchids and butterflies. Follow the riverbank path which then heads away from the river into the meadow. Here the path splits, follow the grassy track to the left to a gate and the B970. Do not head out onto the road, instead turning right onto a broad constructed path - part of the Speyside Way."
      },
      {
        "stage": 6,
        "description": "Keep following the path through some fine birch woodland.When it emerges at a track, go left and then immediately right to continue on the path parallel to the road. After another 400m it returns to the start."
      }
    ],
    "scraped_at": 1756310261.1406367
  },
  {
    "title": "Frank Bruce Sculpture Trail & Lower Feshie",
    "summary": "A lovely varied walk, taking in the wood and stone sculptures of Frank Bruce as well as the banks of the Feshie and a forestry section with good views of the surrounding mountains. The sculptures are naturally decaying in the environment, as was the intention of the late artist.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/lower-feshie.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 2.0,
    "ascent_m": 122,
    "start_grid_ref": "NH849046",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "West of Feshiebridge off the B970 there is a Forestry & Land Scotland car park. Start the walk by following the waymarked trail that climbs up to the higher track first and turning right and then following the footpath at the rear of the disabled parking area. Each of the large wooden and stone sculptures is accompanied by a title or explanation. The late Frank Bruce started sculpting in 1965 and used natural materials and the landscape and politics as inspiration."
      },
      {
        "stage": 2,
        "description": "Follow the path as it meanders through the native woodland, passing a number of impressive and large wooden sculptures. Soon the path comes alongside the wall of what used to be the walled garden for Invereshie House. Enter the walled area and follow the path round the sculptures and picnic tables."
      },
      {
        "stage": 3,
        "description": "A curving path - take the left branch - leads round the sculptures, mostly carved in wood but some of stone; small interpretative panels help to understand their symbolic or political significance. There are good views of the surrounding countryside from here. Leave the walled garden area at the side gate towards the far end, and turn left."
      },
      {
        "stage": 4,
        "description": "Follow the path alongside the wall until a path leads down to the riverside on the right hand side. There is an orange marker post near the top. Here there are lovely views over the wide section of the River Feshie. Turn right at the bottom and follow the path as it runs along a bank above the river and then goes right to cross a small wooden bridge at one point. Pass the river gauging station and climb the path back to the car park. Turn left and follow the yellow marker post to take a path that climbs next to a telegraph pole."
      },
      {
        "stage": 5,
        "description": "This path follows the line of the river and after passing a picnic table reaches a lovely stone bridge over the River Feshie where the water pours through a narrow section. Go up to the road and cross over and follow the track alongside four houses before reaching an open area with forestry and mountain views. Continue on the track leading up the glen."
      },
      {
        "stage": 6,
        "description": "After some distance a signpost indicates where to turn right, leaving the track and following a path uphill beside a stone wall; there are great views back across the glen. Follow the markers which indicate where the path veers off to the right into the forest plantations. Soon it emerges onto a forest road; follow for a short distance and then take a marked path downhill to the right. Watch out for mountain bikers. When you reach the tarmac road follow the path directly across to the track leading down into the car park."
      }
    ],
    "scraped_at": 1756310263.7266414
  },
  {
    "title": "Ellan Wood and the river, Carrbridge",
    "summary": "Ellan Wood is a fine pine wood on the fringes of the village of Carrbridge. Partly owned by the Woodland Trust, it offers several short waymarked trails, which can be combined to give the walk described here. The route finishes with a riverside section to the much-photographed packhorse bridge.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/ellan-woods.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 53,
    "start_grid_ref": "NH903227",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The car park is accessed via Station Road in Carrbridge. Look out for a turning on the left signed for Ellan Wood; there is parking and a picnic area just short of the cemetery. Begin the walk on the path which starts just to the left of the information board, signed Main Street via Ellan Wood. Initially the route follows the yellow markers. Turn left at the first junction, and then keep straight on when a short loop of path goes off right. There is a bench up to the right at the next junction, where you should keep left again (sign Main Street). At the next path junction a route comes in from Carrbridge on the left (this is an alternative start, heading between a church and the village hall); turn right here, signed 'Boat of Garten via Carr Plantation Trail' and waymarked in both red."
      },
      {
        "stage": 2,
        "description": "Keep straight on at a crosspaths, and then straight ahead again at a three way fork, signed 'Railway Wood walk' and marked in red. Continue ahead again across the access track for the overflow parking for the Landmark Forest park. The route now passes the Lookout Tower, an impressive structure and the highest wooden tower in Britain; it is part of Landmark and so cannot be accessed. The path continues through the woods; this part is a dense plantation of Scots pine."
      },
      {
        "stage": 3,
        "description": "The path eventually reaches the main railway line, where you should turn right, signed Railway Wood walk. The path continues beside the railway before eventually bearing right back into the woods; ignore a minor path off left. Red squirrels are plentiful around here; if you are here in the Autumn then the fungi can be quite spectacular."
      },
      {
        "stage": 4,
        "description": "Turn left when the path reaches a t-junction. Continuing the walk, a 'Glencharnoch Wood' sign indicates when you enter the part of the forest that is owned by the Woodland Trust. The path descends a flight of wooden steps at one point and then turns sharp right."
      },
      {
        "stage": 5,
        "description": "When a finely sculpted wooden bench is reached, turn left (passing another bench). The path continues to wind through a beautiful section of pinewood. At the next junction take a right turn, and then at the one after that turn left, then right - signed for Station Road."
      },
      {
        "stage": 6,
        "description": "When the road is reached go diagonally across (veering left) to meet a path leading off on the far side, signed for Village Centre via Riverside walk. A track leads round to the back of some houses; follow it round to the left as it forks. As the track approaches a bungalow, a low footpath sign indicates a turn to the right. Take this turning and continue to a suspension footbridge over the River Dulnain. On the far side, turn right downstream."
      },
      {
        "stage": 7,
        "description": "Eventually the path leads to the main road beside the remarkable old packhorse bridge, built in 1717 and still missing its parapets after the terrible floods of 1829 - known as the 'Muckle Spate' and probably the worst ever experienced in Scotland. Turn right to cross the modern road bridge alongside, and then right again to head along Station Road. Eventually the entrance to Ellan Woods is reached on the left and the car park at the start of the walk."
      }
    ],
    "scraped_at": 1756310266.3156328
  },
  {
    "title": "Queen's Drive and River Clunie, Braemar",
    "summary": "This beautiful circular walk leaves Braemar along the River Clunie before picking up the Queen's Drive - a carriage drive once favoured by Queen Victoria. This gently gains height and gives excellent views before a steeper descent through the woods leads back to Braemar.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/queens-drive.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.5,
    "estimated_hours": 1.5,
    "ascent_m": 86,
    "start_grid_ref": "NO151913",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk starts from the centre of Braemar; there is a carpark (with toilets) just on the left off the A93 which runs through the village towards the Linn of Dee (there's another carpark just over the bridge opposite the Fife Arms)if full. Head back to the street leading into the village from the car park, turn left to cross the bridge over the River Clunie, giving views over a low waterfall. On the far side turn left onto a minor road signed for the golf course. Note the 'engine' preserved as a memorial to servicemen who lost their lives in an aircrash over the hills in 1945."
      },
      {
        "stage": 2,
        "description": "Continue along the quiet road out of the village until a signpost for 'Queen's Drive' and a footbridge on the left. Cross the bridge over the Clunie then turn right to cross a second footbridge over a tributary. A grassy path now keeps to the right of the fence, with views over the river and Morrone Birkwood beyond."
      },
      {
        "stage": 3,
        "description": "After passing through a gate the path climbs gently and then swings away from the river, overlooking the golf course, to eventually meet the main A93 road. Cross this and pick up the path over the far side, turning right to head further from the village (a left turn here heads straight back to Braemar). The path begins to climb, goes through a gate and widens."
      },
      {
        "stage": 4,
        "description": "This is the Queen's Drive, and it rises gently through scattered birchwoods, giving some grand views to Braemar and beyond."
      },
      {
        "stage": 5,
        "description": "Eventually a green footpath signpost is reached. The piles of stones on the left here are all that remains of a cottage, Dubh Chlais (meaning black hollow) which was the home of Mr and Mrs Thompson. They were relatives of John Brown, Queen Victoria's famous servant, and the Queen often came here with him to bring tobacco and tea to the Thompsons. To extend the walk, you could continue ahead from the sign to make the Lion's Face circuit; otherwise turn left as signed for 'Village Centre'."
      },
      {
        "stage": 6,
        "description": "The path now descends through the woods, running alongside a wall and then turning left through a gap in it. When it meets a bench keep left, then continue ahead at further junctions as the route continues to descend, passing a wigwam wildlife hide. At the bottom of the woods a signpost is met where the route from the Lion's Face and Cromlins walk and the ascent route to Creag Choinnich come in from the right. Keep ahead here to leave the woods through a gate and reach the village. At the lane keep straight on to head past the church and back down to the main road. Cross and head down the ramp opposite to return to the car park."
      }
    ],
    "scraped_at": 1756310268.903572
  },
  {
    "title": "The Colonel's Bed, Inverey",
    "summary": "This short walk heads into the lower reaches of lonely Glen Ey. Its objective is the Colonel's Bed, where the river flows through a narrow rocky chasm. The rockwalls of the gorge here are loose and have partially collapsed - do not attempt to descend into the gorge and view from above with great care.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/colonels-bed.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.9,
    "estimated_hours": 1.5,
    "ascent_m": 130,
    "start_grid_ref": "NO089892",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a car park in Meikle Inverey, which is the part of Inverey on the east side of the River Ey; the part on the other side is known as Little Inverey. Begin the walk by following the track which slants uphill and is marked with a wooden signpost for Glen Ey. There are great views over to the right to Ben Macdui and Derry Cairngorm. Continue up the track through the grounds of Inverey House."
      },
      {
        "stage": 2,
        "description": "The track leaves the grounds of the house through a gate and heads into the glen. Further on it crosses a wooden bridge over the River Ey; note that the bridge shown on some maps heading across to the track on the west side of the Ey no longer exists. Beyond the bridge the track climbs fairly steeply, with great views looking back over Inverey towards the high Cairngorms. Shortly after the track bends to the right you can short cut the zig-zag by following a path up on the left, rejoining the track a short distance uphill."
      },
      {
        "stage": 3,
        "description": "Continue on the landrover track up the glen for almost a kilometre. Just after it bends to the right, a small cairn marks the point to leave the track. Turn left here on a narrow path  in the heather that almost doubles back on the track; this is the line of the original stalkers path which was the main route up the glen before the current track was bulldozed. When back round the corner, a small wooden sign indicates the path off to the right that slopes down to the Colonel's Bed."
      },
      {
        "stage": 4,
        "description": "The path is narrow and a little rough; as you near the river take great care. The river here flows through a vertically-sided rocky gorge, and great care is needed near the edge; the ground is slippery and some of the rocks are loose - clearly any slip would be fatal.  In the 17th Century a colonel, outlawed for the murder of a Laird, made this his refuge, and was brought food each day by his lover. Today part of the wall of the gorge has collapsed and buried the bed itself - do not attempt to descend into the gorge as it is very dangerous and doesn't lead anywhere."
      },
      {
        "stage": 5,
        "description": "After enjoying the gorge from above, return to Inverey the same way."
      }
    ],
    "scraped_at": 1756310271.4878914
  },
  {
    "title": "Fairy Pool and Riverside walk, Glen Tanar",
    "summary": "This delightful walk on the Glen Tanar estate combines forestry and farmland with a long, pretty riverside section. The walk is waymarked (combining the Fairy Lochan and Riverside paths), the visitor centre has information on the wildlife to be found on the estate. Toilets near the start and parking charge.",
    "source_url": "https://www.walkhighlands.co.uk/cairngorms/glen-tanar-riverside.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.9,
    "estimated_hours": 2.0,
    "ascent_m": 30,
    "start_grid_ref": "NO479965",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Take the minor road up Glen Tanar, parking in the Braeloine car park (charge) on the right hand side part way up the glen. Begin the walk by crossing the very beautiful old steeply-arched Bridge of Tanar. On the far side, the building over to the left is an information centre giving details of the estate and the wildlife to be found here; there are also toilets. The walk described here mainly follows white waymarkers although it combines the Fairy Lochan and Riverside paths to make a longer circuit. Start by following the track upstream waymarked in white and green."
      },
      {
        "stage": 2,
        "description": "After a short while the attractive stone-built Chapel of St Lesmo - built in 1872 - is passed on the right and then a junction reached. Turn left here to follow the clear track."
      },
      {
        "stage": 3,
        "description": "Keep on the main track when another track joins from the right and soon the reed-covered Fairy Lochan is reached. Marginal plants have been encouraged at the edges of the water and the lochan is breeding ground for many dragonflies in summer. Continue past the water on the track which rises slightly uphill and passes pine and birch trees."
      },
      {
        "stage": 4,
        "description": "This section is a good area to spot fungi especially in late summer and autumn. After a short while ignore the Fairy Lochan path which leaves to the left (a possible shortcut) - instead continuing for around 500m to the next junction and then turning left here (Riverside Path marker post). The narrow path follows a ridge which was formed by terminal moraine, the wall of boulders and gravel left behind by a glacier and where a loch would have formed behind it. Follow the ridge down past a bench and towards the riverside."
      },
      {
        "stage": 5,
        "description": "The path turns to the left and heads back upstream following the river. The path is narrow as it plunges through silver birches and then emerges into more open ground. A number of slow moving pools are passed and a bench and some faster sections of river."
      },
      {
        "stage": 6,
        "description": "Cross a wooden bridge and then a smaller bridge and follow the path as it leads away from the river bank for a short section before returning and continuing upsteam. Eventually the back of the visitor centre can be seen on the left and the path emerges next to the arched stone bridge at the start of the walk. Cross the bridge and the road to return to the car park."
      }
    ],
    "scraped_at": 1756310284.076693
  }
]