[
  {
    "title": "Lael Forest Garden and forest walk",
    "summary": "An easy and pleasant walk taking in the Lael Forest Garden with its 200 different tree species together with a longer plantation section with waterfalls.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/lael.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.75,
    "estimated_hours": 1.0,
    "ascent_m": 60,
    "start_grid_ref": "NH196810",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There are 2 car parks for Lael Forest, this walk starts from the north one, opposite the sign for the Woodturner. From the car park and picnic site it is worth first heading up the steps at the back of the car park and along the path to view a lovely waterfall. Return to the car park and go over the bridge and through the gate on the left hand side (as you face the road) to enter the Lael Forest Garden. Before Forestry & Land Scotland took it over in 1929 the land belonged to tree enthusiasts who had collected species from all over the world. Now over 200 species are represented and sign boards identify the different trees including giant redwoods and cricket bat willows."
      },
      {
        "stage": 2,
        "description": "Turn left almost immediately to head uphill through the woods passing a Tulip tree from the USA on your right. At the next junction turn left again, continuing to gain height. The route passes through Lawson cypress which is the predecessor to the most commonly planted garden conifer today. Continue as the path meanders through the trees and turns downhill to reach a gate at the far end of the forest garden."
      },
      {
        "stage": 3,
        "description": "Go through the gate into the other car park and picnic area. From the car park take the path on the left, with a green and red marker post, to enter the forest. Keep heading uphill at a junction. At the right time of year many species of fungi can be found in this section of woodland."
      },
      {
        "stage": 4,
        "description": "Eventually the path reaches a forest track. Turn left along this, continuing gently uphill until the track crosses a bridge over a gorge. On the far side turn left down steps onto a path - waymarked red - downhill. This gives glimpses into the gorge on the descent back to the car park."
      }
    ],
    "scraped_at": 1756311035.0772405
  },
  {
    "title": "Knockan Crag trail",
    "summary": "This interpretative trail brings the geology of the Moine Thrust to life as the path climbs past the exposed rocks and up onto the top of the Knockan Crag. From here there are spectacular views over Assynt. The trail includes sculptures and poetry as well as places to sit and a treasure hunt for younger children.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/knockancrag.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 1.0,
    "ascent_m": 185,
    "start_grid_ref": "NC188091",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "From the car park walk up to the hexagonal visitor centre with its turfed roof. Here there is an explanation of the Moine Thrust, why one type of rock 500 million years older ended up being thrust upwards to lie above another band of rock. From the centre follow the path and at a junction keep to the lower path, marked Trails."
      },
      {
        "stage": 2,
        "description": "The trail passes a pipe rock display explaining that the white tubes seen in the rock here are fossils of pipe worms. The path continues upwards, turning left at a junction and climbing to pass Jo Smith's impressive Globe sculpture on the right."
      },
      {
        "stage": 3,
        "description": "Soon the path crosses a small wooden bridge, continue upwards following a sign for Moine Thrust. Eventually you reach an area where the two rock bands are exposed."
      },
      {
        "stage": 4,
        "description": "Continue on the path as it climbs up the crag on well made stone steps. From this section there are lovely views back over the Inverpolly area."
      },
      {
        "stage": 5,
        "description": "A short diversion to the left takes you to a viewpoint at the northern end of the trail. From here you can see out over Assynt, with Suilven and Canisp both prominent. Backtrack to the main path and follow it along the top of the crag. Part way along there are particularly good views of Lochan an Ais below and wee Stac Pollaidh in the distance between Cul Mòr and Cul Beag."
      },
      {
        "stage": 6,
        "description": "The path passes another short diversion to the left to the Eagle Stone viewpoint and then descends in a series of zig zags back to the car park."
      }
    ],
    "scraped_at": 1756311037.6628993
  },
  {
    "title": "Nigg Church and the Bishops' walk",
    "summary": "Nigg Church is well worth a visit to see the stunning Pictish carved cross-slab inside. The walk is a short one, looping down from the church to the shores of Nigg Bay along an ancient route by the burn. The Bishop of Ross is said to have sailed from his seat in the Black Isle to his summer holiday home at Nigg, coming ashore at Nigg Bay and using the path now known as the Bishops Walk.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/nigg-bishops.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 45.0,
    "ascent_m": 25,
    "start_grid_ref": "NH847239",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at Nigg old church. The walk begins through the gate into the graveyard. There has been a church here since the thirteenth century, and the present building dates back to 1626. It is well worth wandering around the graveyard to see some fine medieval graveslabs, dating back to the 1300s."
      },
      {
        "stage": 2,
        "description": "The church is open from 10am - 5pm April to October. Do not miss the chance to explore inside, as in the far room is the amazing 8th century Pictish cross-slab. Standing two metres high and a metre across, the slab once stood in the graveyard but has been moved inside to protect it. The rich and intricate carvings include what is one of the earliest depictions in Britain of the Eucharist or Mass."
      },
      {
        "stage": 3,
        "description": "Go through the gate to the right of the church to reach the rear graveyard. A path leaves through a gate in the far right corner. Pass alongside a wall and then keep left. The path swings left and then back right through the trees. At a fork, ignoring a path rising to the left (used on the return) and keep along the path through the bottom of the wooded dell. The path can be a little wet - and overgrown in late summer."
      },
      {
        "stage": 4,
        "description": "Eventually it crosses a wooden footbridge over the burn, and then further on crosses back. Turn right here to follow the path down to a gate where it emerges on the road by the shore of Nigg Bay. There are extensive views across the Bay and the Cromarty Firth, with the distant mountains often rising behind the oil rigs which are serviced and maintained here. There is an RSPB hide around 1.5km along the road to the east."
      },
      {
        "stage": 5,
        "description": "Retrace your steps to the last footbridge, but this time continue up the right side of the burn. The route follows a high bank above the river which may be part of an old causeway. Eventually the path descends to rejoin the outward route. At the fork near the church bear left to head down to a footbridge, crossing this and reaching the road just beyond some picnic tables. The church and the start of the walk are just to the right."
      }
    ],
    "scraped_at": 1756311040.314358
  },
  {
    "title": "Tain Hill and Pulpit Rock",
    "summary": "A short and easy walk to the top of Tain Hill which has good views over the Cromarty and Dornoch Firths.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/tain-hill.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.0,
    "estimated_hours": 40.0,
    "ascent_m": 78,
    "start_grid_ref": "NH752812",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk can be done from Tain (adding 3km each way) by turning uphill near the Tolbooth and heading up Craighill Terrace passed the primary school, then crossing the A9 and continuing up Jubilee Road to the car park. From the car park follow the path uphill marked by a red marker post.  The path soon passes a picnic table."
      },
      {
        "stage": 2,
        "description": "The path climbs between a fence and a dyke, through mixed pine woodland with some open views in places. As the trees thin out, the woodland is mainly old Scots Pine. The path skirts round the remains of a long disused quarry which provided the stone for many of Tain's buildings - including the Tolbooth - and was considered when searching for suitable stone for the Houses of Parliament. The path passes through a more open area with good views of the surrounding countryside and sea."
      },
      {
        "stage": 3,
        "description": "Climb steadily to reach the Pulpit Rock and a wooden picnic bench, an excellent viewpoint over Tarbat Ness and the Dornoch Firth. The large rock - thought to be a glacial erratic - is an impressive landmark with concrete steps leading to its flat top."
      },
      {
        "stage": 4,
        "description": "From here retrace a couple of steps and turn right to head downhill following the red marker posts. The path passes along the edge of a cleared area and then swings left (ignoring muddy tracks off) into the woodland. When the path emerges at a track turn left and follow this until a gate marks the return to the car park."
      }
    ],
    "scraped_at": 1756311042.89816
  },
  {
    "title": "Clashnessie Bay and Falls",
    "summary": "Clashnessie Bay has a very fine sandy beach, one of few in Assynt to face north. Its name comes from the Gaelic Clais an Easaidh - the Channel of the Waterfall - and the falls which give the name make for a short if boggy hike. The Clashnessie Falls are 15m high and are most impressive when in spate.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/clashnessie-beach.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.25,
    "estimated_hours": 45.0,
    "ascent_m": 45,
    "start_grid_ref": "NC057308",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the layby by Clashnessie beach on the B869. The beach here receives fewer visitors than the better known Clachtoll or Achmelvich further south, and is a truly stunning spot for relaxing, though the sea is usually bitingly cold."
      },
      {
        "stage": 2,
        "description": "Begin the walk by heading west along the road. Soon it crosses the bridge over the burn - the Clais an Eas. Note the ruined mill down on the right, where grain would once have been brought for processing. Continue along the road as it climbs uphill, passing a phone box."
      },
      {
        "stage": 3,
        "description": "Eventually a wooden signpost indicates the route 'To the falls' - cutting a grassy corner to meet a track. Head left along the track, and when it forks take the left branch."
      },
      {
        "stage": 4,
        "description": "The track ends at a whiteashed cottage by the burn. Just before reaching it, turn left to cross the burn via rough stepping stones, then turn right along the far bank. There is a path, but it is often wet underfoot; it quickly leads to the foot of the waterfall which has been in view for some distance. With a single drop of around 15m, the falls are very impressive when in spate (pictured here in dry summer conditions). The return walk is the same way, but if you wish you can cross the burn and take a path up through the bracken to reach the top of the falls, before heading back."
      }
    ],
    "scraped_at": 1756311045.5031466
  },
  {
    "title": "Leitir Easaidh all-abilities path, Little Assynt",
    "summary": "There are few walks in the northwest set-up for wheelchairs (and those who don't want to get wet boots!) so Leitir Easaidh is all the more welcome. This trail visits two lochs with picturesque shelters and toilets, and has stunning views across this wild landscape to the surrounding mountains.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/leitir-easaidh.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 45.0,
    "ascent_m": 25,
    "start_grid_ref": null,
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the Leitir Easaidh car park which is signed on the A837. The walk has been developed by the Culag Community Woodlands Trust who own both the Little Assynt estate and the Culag Woods in Lochinver. The walk begins along the surfaced path, passing an interpretative board and a map of the trail before passing through a gate. As it nears the two small buildings it forks, with the right fork giving access to the buildings and the loch of Leitir Easaidh. The thatched hut with a wind-turbine and solar panel is an eco-friendly composting toilet, whilst just beyond is a shelter and a pier giving access to boats available for fishing on the loch (permit required). There are grand views to the great mountain wall of Quinag."
      },
      {
        "stage": 2,
        "description": "Further on the trail forks. The first fork on the right leads down to the lochside, whereas a second fork on the right further on crosses a bridge and passes a picnic area to reach a further lochside spot - worth the detour. Otherwise keep left at both forks to follow the main trail."
      },
      {
        "stage": 3,
        "description": "The trail leads to the shores of the second loch, Loch na h-Innse Fraoich, which also has a shelter, jetty and toilet. The path forks here - both ways lead to the same viewpoint so this part of the walk is a loop. Keep to the right branch for the outward walk."
      },
      {
        "stage": 4,
        "description": "The path climbs up a little from the loch to reach another fork. Go right here at first, then left (this second right is a link path to the Little Assynt route further along the road). The path now ends at a viewpoint. Quinag looks impressive, but the viewpoint also looks south towards the strange ridge of Suilven across Loch Torr an Lochain. On the way back keep right at both junctions to follow the alternative route back to the second toilet. From there retrace your steps back to the start."
      }
    ],
    "scraped_at": 1756311048.1044333
  },
  {
    "title": "Culag Woods, Lochinver",
    "summary": "Culag Woods on the edge of Lochinver are owned and managed by a local community trust and have been made into an excellent facility for short family walks. There are some lovely views.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/culag-woods.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 120,
    "start_grid_ref": "NC092222",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Lochinver is a busy working port as the large warehouse buildings around the harbour testify. Culag Woods offer an easy escape from this hive of activity. The walk is described from in front of the Culag Hotel on the harbour in Lochinver; there are dedicated car parks for the woods on the road towards Inverkirkaig. From the Culag hotel, continue along the road further through the harbour area. After passing the lifeboat station, look out for a wooden signpost for 'Culag Woods' and 'Billy's Path' going off to the left - it is set back slightly from the road and could be easily missed."
      },
      {
        "stage": 2,
        "description": "Billy's Path climbs up through the woods, curving round to the left, and gives a view back over Lochinver - slowly becoming blocked by trees. The path bends right and then reaches a junction by a wishing tree; take the left path (ignoring the one signed as Anna's Path). The rough path now continues through the lovely mixed woodland, going up a flight of stone steps at one point and crossing a wooden boardwalk at another."
      },
      {
        "stage": 3,
        "description": "Ignore the 'higgledy-piggledy' path off to the left and the path off right, and instead continue ahead up some rough wooden steps. Eventually the path reaches a signed junction with a larger path; you'll return to this point, but first turn right to visit the White Shore. Continue along the path until it reaches this pebble beach, and then return to the junction."
      },
      {
        "stage": 4,
        "description": "This time keep ahead. When another path is reached go left, then turn right at a signed junction for the 'Viewpoint' - with a teepee visible over to the left. The path reaches a boardwalk off to the right that gives access to a viewing area out on the forest bog - a great spot for looking for dragonflies. Return to the path and continue to another junction, this time turning left (signed for the viewpoint again)."
      },
      {
        "stage": 5,
        "description": "The path to the viewpoint can be muddy in places and ascends to and fro before reaching the top of the little hill. There's a seat with a view over Lochinver; continue through the trees to reach another seat, this time with a view of Suilven's improbable dome dominating the scene. Return back down the path, turning right to return to the teepee junction. This time turn right past the teepee to continue the walk."
      },
      {
        "stage": 6,
        "description": "The path leads through the attractive woodland. Ignore the 'higgledy piggledy' path off to the left and continue, joining a track and bearing right uphill on this. Pass some gas storage tanks and then fork left at the junction. The track now leads downhill passing workshops and the bunkhouse and cafe before arriving back at Lochinver harbour."
      }
    ],
    "scraped_at": 1756311050.6932871
  },
  {
    "title": "Clachtoll Beach and the Broch",
    "summary": "This lovely short walk includes a visit to beautiful Clachtoll beach with its perfect sand and the crumbling iron-age broch of An Dùn.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/clachtoll-beach.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.5,
    "ascent_m": 40,
    "start_grid_ref": "NC039273",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "There is a car park for Clachtoll beach. Before beginning the walk you could visit the small Rangers' hut to find out more about what you can see along the way. Start by heading past the toilet block; when you reach a track continue straight ahead onto a wooden boardwalk. This leads down to Clachtoll beach, a truly stunning spot, famed for the split rock beyond the far end of the bay. After enjoying the sands, return to the path and head through a gate to reach the former salmon bothy."
      },
      {
        "stage": 2,
        "description": "The poles outside were erected for drying the drag-nets used to catch the fish. If it isn't locked, the bothy has interpretative displays inside to help you find out more. There are great views back over the beach, with Stac Pollaidh and other peaks visible beyond. Continue the walk by heading to the left of the gate decorated with pieces of driftwood. Continue by the wall until there's a small gate provided for walkers on the right."
      },
      {
        "stage": 3,
        "description": "Cross the track to another walkers gate, then keep left alongside the stone wall (with Clachtoll Cottage over to your left) to reach another small gate; again go through this and then follow the path that slopes uphill to the left to reach open grassland. Continue round the coast, keeping above the rocks that shelve down into the water - there are some huge slabs."
      },
      {
        "stage": 4,
        "description": "On the next section you may notice the grassland is formed into little ridges. These are the remains of lazybeds, once worked for crops and fertilised with seaweed. There are great views looking back along the coastline to the beach and mountains. Continue ahead towards what looks at first like a massive mound of stones."
      },
      {
        "stage": 5,
        "description": "The stones are the remains of Clachtoll broch, an iron-age defensive tower. Pass to the right of the broch and then detour left to head up to the entrance, still roofed with giant lintel stones. The interoir has been cleared in recent years and you can see the passageways and staircases within the double walls."
      },
      {
        "stage": 6,
        "description": "From the broch you can either return the way you came, or alternatively continue along the coast next to the fence which is rough going across boulders with the Bay of Stoer ahead. Though pebbly at high tide, there are extensive sands here when the sea is out. Continue until a tiny burn and then turn right along the near side of this, crossing two stiles, to reach the road. Turn right again on this; further along a sign indicates the turning back to the car park at Clachtoll beach."
      }
    ],
    "scraped_at": 1756311053.2821863
  },
  {
    "title": "Tobar na Slainte, Shandwick",
    "summary": "Park at any of the beach car parks in Shandwick; the one at the west end is the most convenient for this route. This is reached by turning down a very narrow lane (signed 'Beach') from the main street. Begin the walk by turning right from the car park (facing the sea) and following a path along the grass above the beach. The beach itself is a magnificent stretch of sand, bounded at its western end by Ballintore harbour.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/tobar-na-slainte.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 70,
    "start_grid_ref": "NH859750",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at any of the beach car parks in Shandwick; the one at the west end is the most convenient for this route. This is reached by turning down a very narrow lane (signed 'Beach') from the main street. Begin the walk by turning right from the car park (facing the sea) and following a path along the grass above the beach. The beach itself is a magnificent stretch of sand, bounded at its western end by Ballintore harbour."
      },
      {
        "stage": 2,
        "description": "Continue along the grassy path for some distance. The grass becomes tall marram grass, and you may prefer to walk on the sands alongside. Be careful to keep glancing to the fence on the right, as you could easily miss the crucial stile at a corner in the fence. Cross the style and turn left on the grassy path on the far side, keeping left when the path forks. At the end of the field the path crosses another stile."
      },
      {
        "stage": 3,
        "description": "Beyond the stile is a wooden bench, complete with comic 'bus stop' sign. The route on from here is very rough at first; the path ascends diagonally beyond the seat to continue at a slightly higher level. A little further on the path is protected by a rope and mesh fence. The path surface is badly worn in places and care is needed."
      },
      {
        "stage": 4,
        "description": "The path now descends to reach a flat area, with more rustic seating. Steps lead down to the beach here, and a very short distance to the right is the Tobar na Slainte or the Well of Health. This consists of a small stone-trough built on a spring, but damaged by high tides. According to local folklore water from the well, if 'silvered' by the addition of a silver coin to a ladel-full, could cure one who had been cursed by the 'Evil Eye' or ill-luck. The cure only worked if the person who brought them the water made the journey to and from the well without speaking to another soul - so if you've met anyone who didn't return your greeting, they may have an excuse."
      },
      {
        "stage": 5,
        "description": "Whilst the well is unspectacular, it has a beautiful situation on its own secluded sandy beach, well hidden from houses and roads. The sea however can only be reached across rocks. To return to Shandwick, go back the same way. When leaving the village, be sure to stop and visit the remarkable Pictish scultped stones nearby. One is close by the road climbing from the west end. It is easy to spot as it has had a glass enclosure built round it to protect it from erosion; the stone dates from 780AD and the carvings are exquisite. There is another fine stone just east of Shandwick at Hilton of Cadboll."
      }
    ],
    "scraped_at": 1756311055.8692229
  },
  {
    "title": "Aldie Burn, near Tain",
    "summary": "This easy forestry walk is popular with local dog-walkers. The surface has been improved to make it suitable for many prams and wheelchairs.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/aldie-burn.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.0,
    "estimated_hours": 1.0,
    "ascent_m": 45,
    "start_grid_ref": "NH756791",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "From the forestry car park start the walk along the clear path marked by blue and red marker posts. The start of the walk is through plantation pines which have been cleared next to the path. Cross straight over a track, keeping an eye out for cyclists as the track is part of a mountain bike route. When you come to a fork keep left following the blue marker posts. The other way is a much shorter route."
      },
      {
        "stage": 2,
        "description": "The path now crosses any area of older pines. A second fork is reached, this time keep right and soon you reach a cleared area with remains of a croft house visible. This was Mineral Bank, and a family tried to make a living on the land here as late as the 1920s - but it simply proved too difficult. Keep on the main path which heads slightly downhill."
      },
      {
        "stage": 3,
        "description": "Soon the Aldie Burn is reached and crossed on a wooden bridge. Immediately after the bridge turn right and follow the burn back into the woods, passing a seat. Amongst the pines, the path has been marked with large stones. Keep right at two forks. The path then zig-zags down to the stream and passes a picnic table."
      },
      {
        "stage": 4,
        "description": "Follow the Aldie Burn downstream until you reach a bridge. This crosses to a picnic area and small wildlife pond. Keep on the left side of the stream and follow the path through the trees. Eventually it emerges onto a forestry track. Turn right here and follow the track watching out for bikes. Turn right at the next junction to return to the outward path. Turn left onto the original path and return to the car park."
      }
    ],
    "scraped_at": 1756311058.4561677
  },
  {
    "title": "Lochanan nan Tunag, Kildary",
    "summary": "A visit to the site of some old gravel quarries behind doesn't sound very promising; nature has now taken over the old ground however, and the loch itself is very beautiful, particularly in the autumn months.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/kildary.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.25,
    "estimated_hours": 1.0,
    "ascent_m": 18,
    "start_grid_ref": "NH767750",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "Park at Kildary near Ken's Garage; there is plenty of space along the road to the right in front of the houses. The walk begins by following the lane that begins right next to the garage. It curves round to the right and has a sign for 'Public Path to Logie Hill'. Continue to the end of the lane where the path (now signed 'Kildary Loch') continues ahead through the trees. After a short distance the route reaches an overgrown gate where a path heads left; our route goes straight ahead, but you can bypass the gate on the left side before rejoining the line of the original path. It now continues through young native trees and scrub."
      },
      {
        "stage": 2,
        "description": "After nearly a kilometre the path reaches a gravelly track. Continue straight ahead across this, soon crossing a metal footbridge. Beyond the path leads up a flight of steps to reach the side of Lochanan nan Tunag (also known as Kildary Loch) beside a boatshed. The loch is owned by a local angling club who have created a circular trail around the shores. It is attractively fringed with pines and is a good place for spotting wildfowl. Turn left and follow the lochside path which undulates through the trees."
      },
      {
        "stage": 3,
        "description": "The path passes various (private) fishing spots named by boards on the trees; at the furthest end it reaches 'Poacher's Corner' and swings round to return via the northern shores. Complete the circuit to the boatshed and descend the steps to return to the gravel track mentioned earlier."
      },
      {
        "stage": 4,
        "description": "Go straight across the track to retrace your steps back on the path through the scrubby young woodland to Kildary."
      }
    ],
    "scraped_at": 1756311061.041688
  },
  {
    "title": "Corrieshalloch Gorge, Braemore Junction",
    "summary": "Test your head for heights on the dramatic bridge and viewing platform suspended over this dramatic gorge, while the water surges many metres below your feet. The surrounding walk has spectacular views of waterfalls and the open countryside towards Loch Broom.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/corrieshalloch.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 45.0,
    "ascent_m": 87,
    "start_grid_ref": "NH208776",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the National Trust for Scotland's Corrieshalloch Gorge gateway centre and car park, a short distance W from Braemore junction; there is a parking charge, toilets and a kiosk / cafe. Note that the car park is closed outside the cafe opening hours; there is a small layby just W, or an overflow car park just under 1km further west (with access to the walk at ). From the gateway centre, take the path that soon runs beside the burn, the Abhainn Droma. It flows over rocky slabs through the pinewoods, with little hint of the drama to come."
      },
      {
        "stage": 5,
        "description": "The walk begins from the National Trust for Scotland's Corrieshalloch Gorge gateway centre and car park, a short distance W from Braemore junction; there is a parking charge, toilets and a kiosk / cafe. Note that the car park is closed outside the cafe opening hours; there is a small layby just W, or an overflow car park just under 1km further west (with access to the walk at ). From the gateway centre, take the path that soon runs beside the burn, the Abhainn Droma. It flows over rocky slabs through the pinewoods, with little hint of the drama to come."
      },
      {
        "stage": 2,
        "description": "There are a couple of forks to choose between fords or footbridges, but both times the two options quickly rejoin. Eventually the path arrives at a junction, with the bridge over the narrowest point of the gorge on the right. The bridge is limited to only six people at a time; peer down from the middle to see the Falls of Measach where the water plunges down to a much lower level in the gorge - it's quite a sensational drop."
      },
      {
        "stage": 3,
        "description": "Cross the bridge and turn left and follow the path to where a metal viewing platform juts out over the gorge giving vertigo-inducing views the gorge - and back up to the bridge."
      },
      {
        "stage": 4,
        "description": "Return to the bridge and cross to the other side. Turn right and follow the path as it skirts the edge of the gorge. Take great care to stay on the path here as the gorge sides are unstable."
      },
      {
        "stage": 5,
        "description": "Through the trees you can see the viewing platform on the opposite side. The path passes through pines and then heads downhill on some steps to an information area and then a further viewing area for the gorge."
      },
      {
        "stage": 6,
        "description": "Keep following the path as it turns uphill and into open countryside. There are great views down towards Loch Broom to the right. At the top of the uphill section there is a seat beautifully crafted from a tree trunk. Follow the level path to emerge at the overflow car park. From here go left again through the gate to follow a path that descends back to the footbridge over the gorge via zig-zags. Do not cross, instead turn right to retrace your steps back to the start."
      }
    ],
    "scraped_at": 1756311063.637046
  },
  {
    "title": "Tain links circuit",
    "summary": "This straightforward short walk explores the environs of Tain, the oldest Royal Burgh in Scotland. It takes in a range of historic buildings as well as taking in a stretch along the shores of the Dornoch Firth.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/tain-links.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.0,
    "ascent_m": 38,
    "start_grid_ref": "NH779821",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins in the High Street (for those arriving by car, there is on-street parking nearby or in the car park on Queen Street). Tain has some fine sandstone buildings; at the west end of the High Street is the grand Royal Hotel, whilst to its right is the Tolbooth. This was originally a jail and court offices and dates in part from 1630. Continue past the Royal Hotel, where the road dog-legs right and then left."
      },
      {
        "stage": 2,
        "description": "Look to the right to see the entrance to the Tain Museum and the Collegiate Church. The church was built between 1370 and 1430 to house the shrine of St Duthac, an early medieval saint who was born in the town. It replaced an earlier chapel which was burnt down (see next paragraph). St Duthac's relics made Tain an important centre of pilgrimage in the Middle Ages. After exploring the church and museum, take the next right turn - after the bank - down a street signed 'Dangerous for Motorist and Cyclist'. Turn right at the bottom of this short street."
      },
      {
        "stage": 3,
        "description": "Turn left at the next junction (towards both the station and golf club) and then keep right at the next fork (signed for the golf club). The road crosses a bridge over the railway, and then bends to the right alongside it. Continue along the road until the wall of the cemetery on your left - the route turns left on the path alongside this, but before going this way continue for a short distance to reach the entrance to a large graveyard containing the remains of the original chapel of St Duthac. This was burnt down when an outlaw tried to test out the theory that a church provides sanctuary. After looking at the graves, return to the path along the outside of the cemetery wall and follow the path down to the seafront."
      },
      {
        "stage": 4,
        "description": "Cross the metal suspension bridge over the river and then follow the main path on the far side (green marker post). A short distance along the route bears right at a marker post to head through broom."
      },
      {
        "stage": 5,
        "description": "Further on, a wooden signpost indicates a turn to the right (signed 'Plaids circuit').  The route now follows the tarmac road past the house and over a bridge. Tain golf course stretches out on both sides of the road; this was designed in 1890 by Old Tom Morris. Pass under the railway."
      },
      {
        "stage": 6,
        "description": "The road doglegs through a farmyard and then reaches a junction; turn right here. A short distance further on, turn left just before a modern house. The path soon leads to a series of steps to re-enter the town of Tain. Turn right along the attractive street of stone buildings; further on it becomes the High Street."
      }
    ],
    "scraped_at": 1756311066.219581
  },
  {
    "title": "Uamh an Tartair, Knockan, Elphin",
    "summary": "Uamh an Tartair - the Cave of the Roaring - is a spectacular pot hole with a cave below, into which pour the waters of the Abhainn a' Chnocain above Knockan. The cave should not be confused with another of the same name above Inchnadamph.",
    "source_url": "https://www.walkhighlands.co.uk/ullapool/uamh-an-tartair.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.75,
    "estimated_hours": 1.5,
    "ascent_m": 78,
    "start_grid_ref": "NC211105",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the parking layby with an information board on the west side of the A835 in Elphin. Head briefly south along the main road verge (with care), then turn left onto the Knockan loop road. Follow this until the sharp corner where the road turns left. Turn right here, between the two houses, passing through a gate and along a grassy track, to the left of the telegraph pole. Almost immediately it reaches another track at a bend; take the right branch."
      },
      {
        "stage": 2,
        "description": "The track climbs gently through pastures. Ignore a branch heading left, continuing on the right track uphill. Note a mossy pothole on the right, and further on a fenced depression on the left."
      },
      {
        "stage": 3,
        "description": "Eventually the main track bends left, and a fainter ATV track leads across the moor ahead. Leave the main track here and follow the very boggy ATV track up the moorland, aiming from occassional old marker post to marker post. Eventually the boggy route turns left and heads past a wide, grassy sinkhole."
      },
      {
        "stage": 4,
        "description": "Climb round the left side of the sinkhole, passing a makeshift seat and then continuing down to a final battered signpost reading 'Uamh an Tartair'. Immediately behind the signpost is a unfenced, evil-looking pothole - care is needed; you can hear but not see the water rushing through it below. Descend to the left to see the slit-like cave opening where the main burn flows into the pothole, disappearing underground. This is Uamh an Tartair - the Cave of the Roaring - not to be confused with a similar cave opening in the Tralgill cave system near Inchnadamph. Entering the cave is reserved for expert cavers."
      },
      {
        "stage": 5,
        "description": "After admiring the entrance, retrace your steps back to the start."
      }
    ],
    "scraped_at": 1756311068.8049293
  },
  {
    "title": "Weem Forest Trail, Weem by Aberfeldy",
    "summary": "This short circular waymarked trail climbs through Weem Wood to St David's Well which has a good view over Aberfeldy and Strathtay and then descends past crags and through native woods.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/weem-wood.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 1.7,
    "estimated_hours": 1.0,
    "ascent_m": 74,
    "start_grid_ref": "NN839497",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Turn onto the entrance for Castle Menzies from the Weem Road, then fork right before reaching the castle to head to Weem Wood car park. Start the walk by taking the path to the right following red waymarkers. The path climbs gently behind the houses of Weem and then turn left to climb more steeply through Weem woods. These woods contain many specimen trees planted by the Menzies family to provide a pleasant backdrop to the nearby castle. At this time, in the early 19th century, plant collecting from abroad was just beginning to be popular in this area and there was renewed interest in Scottish forestry. Keep on the main path as it zig-zags uphill, ignoring paths to right and left."
      },
      {
        "stage": 2,
        "description": "The path weaves up between large boulders amongst the trees before eventually reaching a very short detour to the left onto level ground on top of a crag, where there is a good view out over Strathtay and modern 'cup and ring' carvings on the rocks."
      },
      {
        "stage": 3,
        "description": "Return to the path and follow the path until a large crag, riddled with caves and St David's Well is reached. It is marked with a modern carved celtic cross. This was a hermit's retreat, used by St Cuthbert in the early days of Christianity. It is named after David Menzies, the laird's son from Castle Menzies who occupied it when he took on an austere religious life in the fifteenth century."
      },
      {
        "stage": 4,
        "description": "Continue past the high crag and soon the path descends a flight of steps with a wooden handrail. At the bottom of the slope turn right at a T junction opposite a red waymarker."
      },
      {
        "stage": 5,
        "description": "The path undulates as it returns towards the car park at a lower level. Ignore a path directly downhill to the left which leads to the centre of Weem, instead climb slightly and pass behind the backs of more Weem houses."
      },
      {
        "stage": 6,
        "description": "A break in the trees provides a good view over Strathtay. Continue on the path, keeping right at a path junction to climb slightly again before turning left when the outward path is rejoined to head downhill and back to the start."
      }
    ],
    "scraped_at": 1756311071.3909402
  },
  {
    "title": "Edramucky Trail, Ben Lawers",
    "summary": "This short (though steep) nature trail begins at the Ben Lawers car park, giving easy access to the mid-level slopes of the mountain, a National Nature Reserve which is renowned for its remarkable arctic-alpine flora.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/lawers-nature-trail.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.2,
    "estimated_hours": 45.0,
    "ascent_m": 220,
    "start_grid_ref": "NN608377",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Start at the Ben Lawers car park on the west side of the road (parking charge). The area is designated as a National Nature Reserve and is owned by the National Trust for Scotland. Begin the walk by heading through the walled intepretation area and on the surfaced path to a gap in a fence."
      },
      {
        "stage": 2,
        "description": "Go through this and cross the road to continue on the path, with views to Beinn Ghlas ahead. The path then approaches an area of regenerating native woodland."
      },
      {
        "stage": 3,
        "description": "At a signpost by the trees, turn right, leaving the main path (which is the usual ascent route to Ben Lawers) and following the Edramucky Trail path, crossing a footbridge over the burn. The path heads up the far side of the Edramucky Burn. In spring, look out for many species of wild flowers - some of them rare such as varieties of saxifrage."
      },
      {
        "stage": 4,
        "description": "The bouldery bed of the burn is attractive too; the path crosses back to the left side for a while before crossing once more back to the right on stepping stones. It then climbs slightly to give a view of Loch Tay. The views to the mountains are impressive too. Meall Corranaich is uphill to the left with the peak of Beinn Ghlas to its right; Beinn Ghlas hides Ben Lawers when seen from this area and is often mistaken for it. Looking back, the rocky slopes of Meall nan Tarmachan can be seen."
      },
      {
        "stage": 5,
        "description": "Further up the main path to Ben Lawers is reached once more, often busy with walkers. Turn left down this path, crossing over the burn once more. The well maintained path gives excellent going as it descends back towards the start. The outward route is rejoined just before leaving the trees. Continue back down to the road and the car park beyond."
      }
    ],
    "scraped_at": 1756311073.97655
  },
  {
    "title": "The Falls of Bruar, near Blair Atholl",
    "summary": "A beautiful short but surprisingly strenuous walk with good views of the gorge and falls from two stone bridges and a picnic area.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/falls-of-bruar.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 2.5,
    "estimated_hours": 1.5,
    "ascent_m": 150,
    "start_grid_ref": "NN821660",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Park at the House of Bruar car park where you can also make use of the poshest toilets in the Highlands. Walk around the front of the building and then head left uphill just before the bridge following the signs for the Falls of Bruar. The walk passes under the railway line (trespass on the lines is strictly prohibited) and follows the Bruar Water upstream where clear pools can be seen below. Care should be taken with young children near the steep sides of the gorge. The path passes through pine trees and later birch, rowan, aspen and willow. When visitors first came here in the eighteenth century there were no trees. Robert Burns, after visiting the popular beauty spot in 1787, petitioned the Duke of Atholl and asked for the falls to be surrounded with \"lofty firs and ashes cool\". The first pine plantations were laid out in 1796 and mostly felled to provide wood during the second world war and replanted afterwards."
      },
      {
        "stage": 2,
        "description": "The walk continues to climb, reaching a carved wooden bench where a flight of steps go up to the right. These lead to a viewing platform for the first of the falls where a rock arch projects low across the river. Continue on the main path to reach the lower bridge just beyond. The arched remains of a Victorian viewing house can be seen just on the left side of the bridge. This was designed to give a sudden and surprising view of the waterfalls beyond and was thought to heighten the effect."
      },
      {
        "stage": 3,
        "description": "Do not cross the lower bridge but continue on the uphill path for the higher bridge. Continue heading uphill ignoring a path to the left which climbs away from the river. Eventually you reach the pretty stone upper bridge which offers views down into the gorge."
      },
      {
        "stage": 4,
        "description": "Continue up the path on the other side of the bridge - recently trees have been felled to try and stop the spread of a disease affecting larch. After a short distance there is a picnic area off to the left with good views of the Bruar Water from the seats. The walk continues on the main path though Scots pine and begins to descend. There are views to the higher upper falls from a seat."
      },
      {
        "stage": 5,
        "description": "When you reach the lower bridge cross it and continue back down the outward path to the start of the walk."
      }
    ],
    "scraped_at": 1756311076.559011
  },
  {
    "title": "The Birks of Aberfeldy, Aberfeldy",
    "summary": "This beautiful short walk is deservedly popular. Celebrated in a poem by Robert Burns, the fine walk up the steep gorge of the Moness burn reveals several waterfalls.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/birks-of-aberfeldy.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 2.0,
    "ascent_m": 195,
    "start_grid_ref": "NN855486",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "The walk begins from the upper level of the Birks car park; if on foot from Aberfeldy you can follow a path from the main square. Leaflets giving details of some of the plants and birds you might see on the walk are available by the information board. Begin along the obvious trail, bearing left to cross the large bridge over the foaming Moness burn."
      },
      {
        "stage": 2,
        "description": "This lower part of the Birks is in fact mostly a beech wood. The walk continues along the path beside the attractive burn with several small waterfalls. A little further is a bench. The valley narrows and the beginnings of a gorge are reached. From here on most of the path has a handrail; it rises briefly and then descends again."
      },
      {
        "stage": 3,
        "description": "Cross a bridge over a feeder stream with attractive waterfalls on the left. Just beyond is a natural shelf in the rocks known as Burns' Seat. It was here that Robert Burns is said to have  taken a rest when he visited in 1787. His visit inspired his poem 'The Birks of Aberfeldy' - and the little glen has been a popular place to visit ever since."
      },
      {
        "stage": 4,
        "description": "Continue on the path which climbs up several flights of stone steps and zigzags left and right, the effort being repayed by several waterfalls. Once at a higher level a wooden walkway continues the route up the gorge. At the end of this the path forks. The path straight ahead was a detour to reach a viewpoint for the Middle Falls where the Moness burn flows through a ravine - but this path has been closed following a landslide, hopefully it will eventually be repaired. To continue the route, take the path up to the left."
      },
      {
        "stage": 5,
        "description": "You are now high above the river with views of the crags on the opposite side of the ravine. There is a break in the trees that gives a fine view of the impressive Upper Moness Falls, the highest on the walk. Continue on the path which heads for and crosses the footbridge directly above the falls, giving a giddy view down to the river far below. Once over the bridge turn right to begin the walk back down the other side of the gorge."
      },
      {
        "stage": 6,
        "description": "The return walk is higher above the ravine and there are fewer open views of the waterfalls. However the woodland here is mostly the birches - or birks - that have given the glen its name and the scenery is very beautiful. At one point there is a wonderful view down the glen to the verdant Strath Tay, with distant Ben Vrackie visible beyond. Continue down the path to return to the start."
      }
    ],
    "scraped_at": 1756311079.1430633
  },
  {
    "title": "Den of Alyth, Alyth",
    "summary": "Explore this deep-sided wooded valley where the Burn of Alyth tumbles down. Although described here from the first car park on the road out of Alyth, it is possible to start from the centre of Alyth.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/den-of-alyth.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 3.5,
    "estimated_hours": 1.5,
    "ascent_m": 82,
    "start_grid_ref": "NO235486",
    "terrain": null,
    "latitude": null,
    "longitude": null,
    "stages": [
      {
        "stage": 4,
        "description": "Due to storm damage the furthest loop north of Tully () is currently closed; this can be omitted as the rest of the walk is open."
      },
      {
        "stage": 1,
        "description": "From the car park head downhill on the footpath signed for Alyth. When it reaches the end of the playing field, curve right and then turn right to follow the burn upstream. You can also reach this point from Alyth - to do so take the roadsigned for Den of Alyth, passing to the left of the large church. After the last house, the ornate gates for the Den are reached on the left. Go through these and follow the path past the play area to meet the main path along the Burn."
      },
      {
        "stage": 2,
        "description": "After a short while you can see where the Burn has cut down through the rock over time to create a high cliff of rock known as Old Red Sandstone.  Soon the first bridge comes into view amongst the beech trees. Do not cross but go down to it and then continue on the same side of the Burn on a narrow path. Take care here as there is a steep drop down to the water."
      },
      {
        "stage": 3,
        "description": "Soon the second bridge is reached, again stay on the same side and continue upstream. This area has been continuously wooded for several thousand years, probably protected from tree felling by the steep sides of the Den. Cross a small bridge and take the left hand fork to follow the water's edge as the burn takes in a wide curve."
      },
      {
        "stage": 4,
        "description": "At a stone bridge, cross the road and continue on the path on the same side of the water. At the remains of a stone wall follow the path which heads inland and then uphill. Lookout for a turning only a short way up. Turn right here onto a path which soon heads back down to the outward path. Use this to return to the stone bridge and turn right to cross the bridge and then immediately take the riverside path on the left."
      },
      {
        "stage": 5,
        "description": "Just before a green metal seat take the right hand fork to head uphill (the left fork leads back to the second bridge). The path meanders through mixed woodland with horse chestnut, birch and sycamore trees and smaller shrubs. Soon the first bridge is reached, cross this and take the path that slopes uphill to the right on the far side, which leads back to the start."
      }
    ],
    "scraped_at": 1756311081.729675
  },
  {
    "title": "Kinloch Rannoch Nature Trail",
    "summary": "This short circular walk around the village of Kinloch Rannoch takes in the shores of the loch, the riverside and some fine broad-leaved woodland.",
    "source_url": "https://www.walkhighlands.co.uk/perthshire/kinloch-rannoch.shtml",
    "difficulty_rating": 1,
    "bog_factor": null,
    "overall_rating": null,
    "distance_km": 4.0,
    "estimated_hours": 1.0,
    "ascent_m": 20,
    "start_grid_ref": "NN661587",
    "terrain": null,
    "latitude": 56.8,
    "longitude": -4.5,
    "stages": [
      {
        "stage": 1,
        "description": "Park in the attractive square at the centre of the village of Kinloch Rannoch. Begin the walk by walking along the road in the direction of Pitlochry."
      },
      {
        "stage": 2,
        "description": "Just after Allt Mor Crescent goes off on the right, take the path on the left, just beyond a fence, signed for Craig Varr. The path passes a cottage to your right then leads through a gate to reach an attractive waterfall cascading down a rocky slab. An information board has a map of the paths around the village."
      },
      {
        "stage": 3,
        "description": "Continue to reach a junction with the modern Allt Mhòr hydro building on your left. The track heading off up the hill is part of the steep ascent of Craig Varr; instead turn left following the path past the modern hydro building, signed for Loch Rannoch. This runs just above the level of the fields behind Kinloch Rannoch village. Further on an old stone well is passed; the path, which is boggy in a couple of places, keeps beside an old drystone dyke before emerging at the tarmac road by some houses. Turn left along a path that runs along the near side of the road, and follow it round the shore of Loch Rannoch."
      },
      {
        "stage": 4,
        "description": "The path joins the road as it leads back through the outskirts of the village - head towards the village. Just after the first cottage on the right, turn right onto a track, immediately taking the left track through a gate. Fork left again by the electricity substation onto a surfaced path. It leads down to the sluice gates at the foot of Loch Rannoch. Part of the Tummel hydro-power scheme, the powerful flow of the river is controlled and can lead to rapid changes in the water level so keep away from the banks.  The great conical peak of Schiehallion is prominent. Follow the path downstream through the woods, passing under the stone road bridge."
      },
      {
        "stage": 5,
        "description": "On the far side of the road bridge is a junction. The village centre and start of the walk are just off to the left here, but our walk continues by the river. Eventually it curves left and reaches a footbridge on the right over a feeder stream. Turn right to cross this, passing to the right of a small housing estate. When the tarmac path curves left, leave it by forking right onto a path through the woods."
      },
      {
        "stage": 6,
        "description": "This soon runs alongside the river; continue on the path to a parking area and pass through this. Just past the parking area the path ends and emerges on the road. Cross the road and go through the gate opposite, signed for the Hillside path."
      },
      {
        "stage": 7,
        "description": "Very soon turn very sharp left onto a path rising through the edge of the woods. This delightful route leads back towards the village through the magnificent trees. Go through a gate and finally fork left onto a path that leads back down to Kinloch Rannoch, emerging on the road by the Hub community centre. Turn right along the road to return to the start."
      }
    ],
    "scraped_at": 1756311084.3141978
  }
]